{
    "news": [
        {
            "url": "https://www.cnbc.com/2024/05/16/stock-market-today-live-updates.html", 
            "description": "The Dow briefly crossed 40,000 for the first time on Thursday.", 
            "title": "Dow futures are little changed after blue-chip average touches 40,000 for first time: Live updates - CNBC"
        }, 
        {
            "url": "https://apnews.com/article/france-synagogue-attack-suspect-killed-08a1aaf0f60d5aa4bee9ef2c5e48e411", 
            "description": "French police have shot and killed a man armed with a knife and a metal bar who is suspected of having set fire to a synagogue in the Normandy city of Rouen. French police said officers were alerted early Friday morning that smoke was rising from the synagogu…", 
            "title": "French police killed suspect planning to burn synagogue in Rouen - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/17/sport/caitlin-clark-indiana-fever-home-debut-wnba-spt-intl/index.html", 
            "description": "Caitlin Clark struggled to make much of an impact in her home debut on Thursday, as the Indiana Fever fell to the New York Liberty 102-66.", 
            "title": "Caitlin Clark struggles during Indiana Fever home debut - CNN"
        }, 
        {
            "url": "https://www.foxnews.com/health/melanoma-patients-dramatic-stories-skin-cancer-awareness-month-thought-i-was-careful", 
            "description": "For Skin Cancer Awareness Month, two melanoma patients shared their stories of how they overcame the invasive form of the disease. A dermatologist also revealed prevention tips.", 
            "title": "Melanoma patients reveal dramatic stories for Skin Cancer Awareness Month: ‘I thought I was careful’ - Fox News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/16/us/daniel-perry-texas-pardon-recommendation/index.html", 
            "description": "The Texas Board of Pardons has recommended a full pardon to Daniel Perry, a US Army sergeant who was sentenced to 25 years in prison after being convicted of murdering a protester at a Black Lives Matter rally in 2020.", 
            "title": "Former US Army sergeant released from prison after Gov. Abbott pardons him for 2020 fatal Black Lives Matter protest shooting - CNN"
        }, 
        {
            "url": "https://apnews.com/article/houston-texas-severe-weather-storms-d14447267de0a8900e1475a8ad7ed8ba", 
            "description": "Severe thunderstorms have hit southeastern Texas for the second time this month, and Houston's mayor says at least four people are dead. There have also been windows blown out of high-rise buildings, downed trees and power outages for more than 900,000 custom…", 
            "title": "Severe storms kill at least 4 in Houston, knock out power to 900000 homes and businesses - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/17/middleeast/gaza-floating-pier-aid-trucks-intl-hnk/index.html", 
            "description": "Trucks carrying humanitarian aid into Gaza have begun moving ashore after arriving through the floating pier built by the US military, according to the US Central Command (CENTCOM).", 
            "title": "US military starts delivering aid to Gaza through floating pier - CNN"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c2jd3k1zyjro", 
            "description": "Russia has launched a push north of Kharkiv but its ultimate goal is so far unclear.", 
            "title": "War in Ukraine: Key weeks ahead for Russia’s offensive in Ukraine - BBC.com"
        }, 
        {
            "url": "https://abcnews.go.com/International/wireStory/massive-ukrainian-drone-attack-crimea-leaves-sevastopol-power-110329755", 
            "description": "MOSCOW _ Russian President Vladimir Putin said Friday that Moscow’s offensive in Ukraine’s Kharkiv region aims to create a buffer zone but has no plans to capture the city", 
            "title": "Massive Ukrainian drone attack on Crimea causes power cutoffs in Sevastopol - ABC News"
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-69023014", 
            "description": "Instead of the usual TV spectacle of two autumn debates, this year the first one will come in summer.", 
            "title": "Why Biden might be happy to debate Trump in June - BBC.com"
        }, 
        {
            "url": "https://apnews.com/article/megalopolis-cannes-francis-ford-coppola-d965352b9f0f5d78d6c470beb801f6f8", 
            "description": "Francis Ford Coppola on Thursday premiered his self-financed opus “Megalopolis” at the Cannes Film Festival, unveiling a wildly ambitious passion project the 85-year-old director has been pondering for decades. Reactions ranged from “a folly of gargantuan pro…", 
            "title": "Francis Ford Coppola debuts 'Megalopolis' in Cannes, and the reviews are in - The Associated Press"
        }, 
        {
            "url": "https://www.startribune.com/timberwolves-nuggets-game-6-blowout-anthony-edwards-karl-anthony-towns-target-center/600366609/", 
            "description": "The Timberwolves trailed the Nuggets behind 9-2 in the first few minutes, but buried that slow start with a 20-point run that set the stage for one of the most successful games in the team’s history.", 
            "title": "Timberwolves beat Nuggets by 45 points, set up Game 7 on Sunday - Star Tribune"
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-17/china-removes-mortgage-rate-floor-for-individual-homebuyers-lwa88d1y", 
            "description": "China announced its most forceful attempt yet to shore up the beleaguered property market, easing mortgage rules and encouraging local governments to buy unsold homes from developers for conversion into affordable housing.", 
            "title": "China Unveils Broad Rescue Package to Prop Up Housing Market - Bloomberg"
        }, 
        {
            "url": "https://www.tomsguide.com/ai/chatgpt/ive-been-testing-openais-new-chatgpt-mac-app-this-is-what-spotlight-should-be", 
            "description": "Slowly rolling out to users", 
            "title": "I've been testing OpenAI's new ChatGPT-4o Mac app — this is a game changer - Tom's Guide"
        }, 
        {
            "url": "https://thehill.com/homenews/house/4669653-chaos-erupts-in-hearing-as-greene-ocasio-cortez-clash-over-fake-eyelashes-jibe-at-crockett/", 
            "description": "A House Oversight Committee hearing devolved into chaos Thursday night as Reps. Marjorie Taylor Greene (R-Ga.) and Alexandria Ocasio-Cortez (D-N.Y.) clashed after the firebrand Republican accused Rep. Jasmine Crockett (D-Texas) of wearing “fake eyelashes.” Th…", 
            "title": "Chaos erupts in hearing as Greene, Ocasio-Cortez clash over 'fake eyelashes' jibe at Crockett - The Hill"
        }, 
        {
            "url": "http://www.billboard.com/music/awards/2024-acm-awards-winners-list-1235685091/", 
            "description": "The 2024 ACM Awards were May 16. Here's the winners list.", 
            "title": "Here Are the 2024 ACM Awards Winners: Complete List - Billboard"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cxe92v47850o", 
            "description": "OpenAI and Reddit reach deal that will give ChatGPT access to content on the social media platform.", 
            "title": "Reddit-OpenAI deal: ChatGPT gets access to social media platform - BBC.com"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c3g9g63jl17o", 
            "description": "The ICJ ruling has come under intense scrutiny, centring on the word \"plausible\". What did the court mean?", 
            "title": "Israel-Gaza: What did the ICJ ruling really say? - BBC.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/16/politics/alito-upside-down-american-flag-house/index.html", 
            "description": "An upside-down American flag – a symbol used by some supporters of former President Donald Trump who challenged the legitimacy Joe Biden’s 2020 victory – hung outside the home of Supreme Court Justice Samuel Alito after the election, The New York Times report…", 
            "title": "New York Times: Upside-down US flag flew at home of Justice Samuel Alito after 2020 election - CNN"
        }, 
        {
            "url": "https://apnews.com/article/pga-championship-valhalla-tiger-scheffler-mcilroy-koepka-d0421ebb2e61aeff9c95a1bb87ee1a72", 
            "description": "Xander Schauffele has set the PGA Championship record with a 62. He also ties a major championship record that he shared last year in the U.S. Open. Schauffele took advantage of rain-softened conditions at Valhalla. And he's been playing some good golf. Schau…", 
            "title": "PGA Championship: Schauffele breaks scoring record with a 62 - The Associated Press"
        }
    ], 
    "last_updated": "2024-05-18 14:58:23"
}