{
    "news": [
        {
            "url": "https://www.washingtonpost.com/world/2024/05/29/rafah-strike-us-munition-israel/", 
            "description": "Weapons experts identified the fragments as an SDB GBU-39, a 250-pound small-diameter precision bomb.", 
            "title": "U.S. bomb fragments found at site of Israeli strike on Rafah camp - The Washington Post"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/29/politics/alito-flag-controversy-response-supreme-court/index.html", 
            "description": "Supreme Court Justice Samuel Alito told lawmakers in a letter Wednesday that he will not recuse from cases involving January 6, 2021, despite their concerns about two controversial flags that have flown on his properties.", 
            "title": "Alito tells lawmakers he will not recuse from Supreme Court cases despite flag controversy - CNN"
        }, 
        {
            "url": "https://apnews.com/article/iceland-volcano-eruption-grindavik-blue-lagoon-87c95e0f5893e1e3c69634c09d3913d8", 
            "description": "A volcano in southwestern Iceland is erupting again, spewing red streams of lava and triggering the evacuation of the popular Blue Lagoon geothermal spa. The eruption Wednesday occurred in an area north of Grindavik, a coastal town of 3,800 people that was la…", 
            "title": "Iceland volcano erupts again in Grindavik: Watch drone video - The Associated Press"
        }, 
        {
            "url": "https://www.eonline.com/news/1402630/hollywood-makeup-artist-allie-shehorn-stabbed-more-than-20-times-in-brutal-attack", 
            "description": "Allie Shehorn—a makeup artist who worked on Babylon and Mean Girls—is \"fighting for her life\" after being stabbed more than 20 times, according to her friends.", 
            "title": "Hollywood Makeup Artist Allie Shehorn Stabbed More Than 20 Times in Brutal Attack - E! NEWS"
        }, 
        {
            "url": "https://www.espn.com/mlb/recap?gameId=401674476", 
            "description": "Expert recap and game analysis of the Pittsburgh Pirates vs. Detroit Tigers MLB game from May 29, 2024 on ESPN.", 
            "title": "Pirates 10-2 Tigers (May 29, 2024) Game Recap - ESPN"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/29/after-revenue-miss-salesforce-ceo-details-enterprise-software-landscape.html", 
            "description": "Salesforce CEO Marc Benioff told CNBC's Jim Cramer how the market for enterprise software companies has changed since the pandemic.", 
            "title": "After revenue miss, Salesforce CEO details the 'measured' buying environment for enterprise software companies - CNBC"
        }, 
        {
            "url": "https://nypost.com/2024/05/29/lifestyle/introducing-peanuts-early-reduces-kids-allergy-risk-study/", 
            "description": "“This safe, simple strategy could prevent tens of thousands of cases of peanut allergy among the 3.6 million children born in the United States each year,” the director of the National …", 
            "title": "Introducing peanuts early reduces kids' allergy risk: study - New York Post "
        }, 
        {
            "url": "https://9to5mac.com/2024/05/29/apple-music-playlist-wwdc-2024/", 
            "description": "We’re less than two weeks away from WWDC 2024, another edition of Apple’s annual conference for developers. And although the...", 
            "title": "Apple Music launches special playlist to promote WWDC 2024, hints at new icon - 9to5Mac"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/29/biden-trump-birtherism-black-voters-00160502", 
            "description": null, 
            "title": "Biden: If Black Americans stormed the Capitol, Trump wouldn't be 'talking about pardons' - POLITICO"
        }, 
        {
            "url": "https://www.mmafighting.com/2024/5/29/24167242/islam-makhachev-dustin-poirier-doesnt-believe-he-can-beat-me-addresses-khabib-nurmagomedov-return", 
            "description": "Islam Makhachev says deep down Dustin Poirier knows he can’t win at UFC 302 and he also addresses Khabib Nurmagomedov’s decision to return to his corner after taking a step back from the sport just over a year ago.", 
            "title": "Islam Makhachev: Dustin Poirier 'doesn't believe he can beat me,' talks Khabib Nurmagomedov's return - MMA Fighting"
        }, 
        {
            "url": "https://thehill.com/policy/international/4692532-north-korea-sends-fleet-of-balloons-carrying-excrement-to-south-korea/", 
            "description": "North Korea sent a fleet of balloons carrying excrement and trash into South Korea, according to multiple reports. “As already warned by the [North Korean] vice minister of National Defence, a large amount of waste paper and rubbish are being scattered in the…", 
            "title": "North Korea sends fleet of balloons carrying excrement to South Korea - The Hill"
        }, 
        {
            "url": "https://www.gamespot.com/articles/playstation-days-of-play-2024-ps5-deals/1100-6523751/", 
            "description": "The event runs through June 12, giving you a chance to save on games, accessories, consoles, and more.", 
            "title": "Tons Of PS5-Exclusive Games Are On Sale For Low Prices For PlayStation's Days Of Play - GameSpot"
        }, 
        {
            "url": "https://apnews.com/article/bronny-james-draft-c625e5c48bef7308d0e502d680329fe6", 
            "description": "Bronny James is keeping his name in the NBA draft, with the hopes of joining his father in the league next season. Rich Paul, the CEO of Klutch Sports Group, confirmed the decision to The Associated Press. It was first reported by ESPN. LeBron James, Bronny’s…", 
            "title": "Bronny James is staying in the NBA draft, agent Rich Paul announces - The Associated Press"
        }, 
        {
            "url": "https://finance.yahoo.com/video/trump-consider-potential-white-house-203216491.html", 
            "description": "According to a Wall Street Journal report, Tesla (TSLA) CEO Elon Musk has discussed the possibility of assuming an advisory role related to energy policies...", 
            "title": "Trump to consider potential White House role for Musk: WSJ - Yahoo Finance"
        }, 
        {
            "url": "https://finance.yahoo.com/news/abercrombie--fitch-ceo-on-getting-into-the-wedding-business-after-strings-of-earnings-beats-200546816.html", 
            "description": "Abercrombie & Fitch CEO Fran Horowitz reveals the next pieces to her turnaround puzzle.", 
            "title": "Abercrombie & Fitch CEO on getting into the wedding business after strings of earnings beats - Yahoo Finance"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=DuUH2sdTL_4", 
            "description": "A joint European-Japanese satellite has launched to measure how clouds influence the climate. Some low-level clouds are known to cool the planet, others at h...", 
            "title": "European-Japanese satellite blasts off to space | BBC News - BBC News"
        }, 
        {
            "url": "https://www.bostonglobe.com/2024/05/29/sports/celtics-bill-walton-steve-pagliuca-wyc-grousbeck-jayson-tatum/", 
            "description": "\"I think this team is different from teams that have gone before,” said Grousbeck. “They’ve got a warrior mentality and they’re a unified force.\"", 
            "title": "Musings on Bill Walton, Wyc Grousbeck, Jayson Tatum, and other Celtics items - The Boston Globe"
        }, 
        {
            "url": "https://www.etonline.com/nicole-brown-simpsons-sisters-give-update-on-her-and-oj-simpsons-kids-and-react-to-his-death-226311", 
            "description": "Nicole Brown Simpson was killed on June 12, 1994. Her ex-husband, O.J. Simpson, was accused of the murder. He was later acquitted.", 
            "title": "Nicole Brown Simpson's Sisters Give Update on Her and O.J. Simpson's Kids and React to His Death (Exclusive) - Entertainment Tonight"
        }, 
        {
            "url": "https://neurosciencenews.com/gene-mapping-evolution-26192/", 
            "description": "Researchers created the first complete chromosome sequences from non-human primates, revealing significant variations in Y chromosomes among species.", 
            "title": "New Primate Chromosome Maps Shed Light on Human Evolution - Neuroscience News"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/29/biden-aides-signal-openness-to-allowing-ukraine-to-strike-russia-with-us-weapons-00160462", 
            "description": null, 
            "title": "Top Biden aides signal openness to letting Ukraine strike Russia with US weapons - POLITICO"
        }
    ], 
    "last_updated": "2024-05-31 03:44:17"
}