{
    "news": [
        {
            "url": "https://sports.yahoo.com/live/2024-nfl-schedule-release-live-updates-ahead-of-wednesdays-full-announcement-222736159.html", 
            "description": "Before Wednesday arrives, football fans got some appetizers as some games were formally announced.", 
            "title": "2024 NFL schedule release: Live updates ahead of Wednesday's full announcement - Yahoo Sports"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=OVpMkRf0OvE", 
            "description": "Listen in as Bronny James fields questions at the 2024 NBA Draft Combine and puts an emphasis on putting his own narrative out there rather than just being t...", 
            "title": "[FULL] Bronny James says he wants to put his own narrative out rather than just being LeBron's son - ESPN"
        }, 
        {
            "url": "https://www.thecrimson.com/article/2024/5/15/hoekstra-harvard-yard-encampment/", 
            "description": "Faculty of Arts and Sciences Dean Hopi E. Hoekstra praised interim University President Alan M. Garber ’76 for his handling of the pro-Palestine encampment and called for “true and meaningful dialogue” in her first public statement about the nearly three-week…", 
            "title": "FAS Dean Hopi Hoekstra Takes Victory Lap After Peaceful End to Harvard Yard Encampment | News - Harvard Crimson"
        }, 
        {
            "url": "https://www.cbsnews.com/baltimore/news/maryland-primary-election-results-2024/", 
            "description": "Polls across Maryland are closed and results for the 2024 primary election are pouring in.", 
            "title": "Maryland election results for 2024 primary: follow the latest vote totals - CBS News"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=ahCuf0_dNk0", 
            "description": "Tune-in to TNT to watch the #NBAPlayoffs presented by Google Pixel8:00 PM ET: Indiana Pacers/New York Knicks 10:30 PM ET: Minnesota Timberwolves/ Denver Nugg...", 
            "title": "Indiana Pacers @ New York Knicks Game 5 | #NBAPlayoffs presented by Google Pixel Live Scoreboard - NBA"
        }, 
        {
            "url": "https://abcnews.go.com/International/protesters-israel-arrested-after-attacking-gaza-aid-trucks/story?id=110220557", 
            "description": "Footage shows protesters apparently destroying boxes of aid bound for Gaza.", 
            "title": "Protesters in Israel arrested after attacking Gaza aid trucks - ABC News"
        }, 
        {
            "url": "http://deadline.com/2024/05/king-charles-first-official-portrait-red-1235916538/", 
            "description": "Painted by Jonathan Yeo, the eight-foot-tall work features the king's face looking benignly down at the viewer, his visage is set off by a sea of red behind him.", 
            "title": "King Charles’ First Official Portrait Is Unveiled: It’s Eight Feet Tall, Features A Sword, A Butterfly And A Lot Of Red - Deadline"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/tv/tv-news/disney-upfront-bob-iger-emma-stone-jimmy-kimmel-1235899498/", 
            "description": "Ryan Reynolds cracks jokes about cocaine and Jimmy Kimmel makes Sheryl Lee Ralph blush in the increasingly spicy House of Mouse.", 
            "title": "Inside the Racy Disney Upfront: Bob Iger and Amorous Golden Retrievers Take Center Stage - Hollywood Reporter"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/14/openai-co-founder-ilya-sutskever-says-he-will-leave-the-startup.html", 
            "description": "OpenAI co-founder Ilya Sutskever said Tuesday that he's leaving the Microsoft-backed startup.", 
            "title": "OpenAI co-founder Ilya Sutskever says he will leave the startup - CNBC"
        }, 
        {
            "url": "https://www.cbsnews.com/miami/news/boat-believed-to-have-hit-killed-ella-adler-while-she-was-water-skiing-in-biscayne-bay-has-been-found/", 
            "description": "On Saturday afternoon, Adler was water skiing near the Nixon Beach sandbar when she fell and was struck by a boat", 
            "title": "Vessel seized in investigation into death of Ella Adler, killed by boat in Biscayne Bay - CBS Miami"
        }, 
        {
            "url": "https://www.reuters.com/world/us/trumps-former-fixer-cohen-resume-testifying-about-hush-money-deal-with-porn-star-2024-05-14/", 
            "description": null, 
            "title": "Trump's lawyers assail estranged fixer Michael Cohen's credibility at hush money trial - Reuters"
        }, 
        {
            "url": "https://apnews.com/article/baltimore-bridge-collapse-safety-board-report-ntsb-b6d4797441350823adb7721164848c04", 
            "description": "Investigators probing the March collapse of the Francis Scott Key Bridge in Baltimore said in a preliminary report the cargo ship Dali experienced an electrical blackout about 10 hours before leaving the Port of Baltimore and yet again shortly before it slamm…", 
            "title": "Cargo ship that caused Baltimore bridge collapse had power blackouts hours before leaving port - The Associated Press"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/14/justice-department-says-boeing-breached-2021-agreement-that-shielded-it-from-criminal-charges-over-737-max-crashes.html", 
            "description": "The Justice Department said Boeing violated a 2021 deferred prosecution agreement that protected it from criminal charges over the two fatal 737 Max crashes.", 
            "title": "Justice Department says Boeing breached 2021 agreement that shielded it from criminal charges over 737 Max crashes - CNBC"
        }, 
        {
            "url": "https://www.washingtonpost.com/health/2024/05/14/covid-variant-flirt-symptoms-vaccine/", 
            "description": "The coronavirus has once again evolved. But this latest version does not appear to be sparking widespread illness.", 
            "title": "What to know about covid variant ‘FLiRT’ symptoms, spread and vaccines - The Washington Post"
        }, 
        {
            "url": "https://apnews.com/article/russia-ukraine-war-blinken-us-military-aid-41df75260903f6b9527fbf3a1a44c815", 
            "description": "U.S. Secretary of State Antony Blinken is seeking to rally the spirits of glum Ukrainians facing a fierce new Russian offensive. In a visit to Kyiv on Tuesday, he assured them that they're not alone and that billions of dollars in American military aid that's…", 
            "title": "Russia-Ukraine war: Blinken visits Ukraine to affirm US support for Kyiv - The Associated Press"
        }, 
        {
            "url": "https://finance.yahoo.com/news/live/stock-market-today-nasdaq-closes-at-record-high-meme-stocks-surge-again-ahead-of-inflation-data-200420429.html", 
            "description": "Meme stocks soared again as US equities more broadly stayed muted in the countdown to fresh inflation data and a Jerome Powell speech.", 
            "title": "Stock market today: Nasdaq closes at record high, meme stocks surge again ahead of inflation data - Yahoo Finance"
        }, 
        {
            "url": "https://www.cbssports.com/wnba/news/caitlin-clarks-wnba-debut-game-indiana-fever-vs-connecticut-sun-start-time-where-to-watch-odds/", 
            "description": "Clark officially begins her WNBA career on Tuesday night as she and the Fever play the first game of the season", 
            "title": "Caitlin Clark's WNBA debut game -- Indiana Fever vs. Connecticut Sun: Start time, where to watch, odds - CBS Sports"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.cbsnews.com/news/solar-cycle-largest-flare-bursts-not-over-may-2024/", 
            "description": "The large explosion of energy and light from the sun comes just days after Earth was slammed with the biggest geomagnetic storm in more than 20 years.", 
            "title": "Sun emits its largest X-class flare of the solar cycle as officials warn bursts from massive sunspot \"not done yet\" - CBS News"
        }
    ], 
    "last_updated": "2024-05-16 03:08:48"
}