{
    "news": [
        {
            "url": "https://apnews.com/article/trump-trial-hush-money-robert-costello-b1beb56a666c398ae5393ede16c326da", 
            "description": "Donald Trump’s lawyers have rested their defense without the ex-president taking the witness stand in his New York hush money trial. The jury was sent home Tuesday until May 28, when closing arguments are expected. Trump did not stop to speak as he left the c…", 
            "title": "Defense rests without Trump taking the witness stand in his New York hush money trial - The Associated Press"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy91ay1wb2xpdGljcy02OTA0MzYxMdIBMWh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy91ay1wb2xpdGljcy02OTA0MzYxMS5hbXA?oc=5", 
            "description": null, 
            "title": "Move to extend police protest powers ruled unlawful - BBC.com"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.cbssports.com/nba/news/nba-predictions-conference-finals-expert-picks-for-celtics-vs-pacers-and-timberwolves-vs-mavericks/", 
            "description": "After some surprising results in the second round, the conference finals tip off this week", 
            "title": "NBA predictions: Conference finals expert picks for Celtics vs. Pacers and Timberwolves vs. Mavericks - CBS Sports"
        }, 
        {
            "url": "https://www.theverge.com/24161498/microsoft-surface-pro-laptop-gpt-4o-voice-macbook-vergecast", 
            "description": "The new Surfaces are here, Scarlett Johansson takes issue with GPT-4o, and the case for a touchscreen MacBook, on this episode of The Vergecast.", 
            "title": "Microsoft’s AI era: the Surface Pro, Surface Laptop, Copilot PCs, and more - The Verge"
        }, 
        {
            "url": "https://cointelegraph.com/news/ether-etfs-eth-price-10k-approval-2025", 
            "description": null, 
            "title": "Ether ETFs could drive ETH price to $10K, but approval could take until 2025 - Cointelegraph"
        }, 
        {
            "url": "https://9to5mac.com/2024/05/21/sonos-officially-unveils-ace-their-highly-anticipated-headphones-and-answer-to-airpods-max/", 
            "description": "Here is everything you need to know about the brand new Sonos Ace headphones. We also have a hands on first impression!", 
            "title": "Sonos unveils new Ace Headphones! - 9to5Mac"
        }, 
        {
            "url": "https://www.nintendolife.com/reviews/nintendo-switch/paper-mario-the-thousand-year-door", 
            "description": "Paper, un-jammed", 
            "title": "Review: Paper Mario: The Thousand-Year Door (Switch) - Still The King Of Mario RPGs - Nintendo Life"
        }, 
        {
            "url": "https://apnews.com/article/live-transmission-israel-associated-press-57e8f662907334ba3599156276381190", 
            "description": "Israeli officials have seized a camera and broadcasting equipment belonging to The Associated Press in southern Israel. Officials accused the news organization of violating a new media law by providing images to Al Jazeera. The Qatari satellite channel is amo…", 
            "title": "Israeli officials seize AP equipment and take down live shot of northern Gaza, citing new media law - The Associated Press"
        }, 
        {
            "url": "https://finance.yahoo.com/news/lowes-beats-estimates-even-as-diy-consumers-pull-back-125204019.html", 
            "description": "Home Depot earnings showed Wall Street with what to expect from Lowe's.", 
            "title": "Lowe's beats estimates, even as DIY consumers pull back - Yahoo Finance"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/21/health/nightmares-daymares-autoimmune-flares-wellness/index.html", 
            "description": "Horrifying dreams involving murder or being crushed or trapped might be a sign of an emerging autoimmune disease such as lupus in certain people, a new study finds.", 
            "title": "Horrific nightmares may signal oncoming flare of these chronic diseases, study says - CNN"
        }, 
        {
            "url": "https://nypost.com/2024/05/21/us-news/diddys-ex-bodyguard-saw-rapper-get-really-physical-with-exes/", 
            "description": "Sean “Diddy” Combs’ former head of security said he had witnessed the rapper being violent toward women, namely his exes Cassie Ventura and Kim Porter, “four or five times&#…", 
            "title": "Diddy's former bodyguard claims he saw rapper 'get really physical' with exes 'four or five times' - New York Post "
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDUvMjEvdWtyYWluZS13YXItbGl2ZS11cGRhdGVzLWxhdGVzdC1uZXdzLW9uLXJ1c3NpYS1hbmQtdGhlLXdhci1pbi11a3JhaW5lLmh0bWzSAW5odHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyNC8wNS8yMS91a3JhaW5lLXdhci1saXZlLXVwZGF0ZXMtbGF0ZXN0LW5ld3Mtb24tcnVzc2lhLWFuZC10aGUtd2FyLWluLXVrcmFpbmUuaHRtbA?oc=5", 
            "description": null, 
            "title": "Ukraine war live updates: Kremlin says Zelenskyy 'slipping into hysterics' wanting the West to get directly involved in the war - CNBC"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy9hcnRpY2xlcy9jMjU1bmp6engybG_SATJodHRwczovL3d3dy5iYmMuY29tL25ld3MvYXJ0aWNsZXMvYzI1NW5qenp4MmxvLmFtcA?oc=5", 
            "description": null, 
            "title": "Greek court throws out shipwreck trial against nine Egyptians - BBC.com"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/21/one-dead-as-london-to-singapore-flight-hit-by-turbulence", 
            "description": "There were 211 passengers and 18 crew members on board the Boeing 777-300ER, which made an emergency landing in Bangkok.", 
            "title": "One dead as Singapore Airlines flight from London hit by severe turbulence - Al Jazeera English"
        }, 
        {
            "url": "https://nypost.com/2024/05/21/world-news/doomsday-glacier-is-more-vulnerable-than-scientists-thought-study/", 
            "description": "Dubbed the “Doomsday Glacier” by scientists, the Thwaites could raise global sea levels by up to two feet if it melts.", 
            "title": "Doomsday glacier is more vulnerable than scientists thought: study - New York Post "
        }, 
        {
            "url": "https://www.businessinsider.com/elon-musk-comments-on-scarlett-johansson-voice-imitation-dispute-openai-2024-5", 
            "description": "The OpenAI cofounder said the use of a voice for ChatGPT that was \"eerily similar\" to Johansson's was like something out of the TV series \"Black Mirror.\"", 
            "title": "Elon Musk wades in on Scarlett Johansson's dispute with OpenAI - Business Insider"
        }, 
        {
            "url": "https://www.cnn.com/travel/fujikawaguchiko-japan-photo-blocking-barrier-intl-hnk/index.html", 
            "description": "The Japanese town of Fujikawaguchiko has erected a giant black net to block views of Mount Fuji, a reaction to the town’s huge popularity on Instagram and other social media platforms.", 
            "title": "Japanese town overrun with tourists puts up view-blocking barrier near Mount Fuji - CNN"
        }, 
        {
            "url": "https://scitechdaily.com/webb-space-telescope-cracks-case-of-puffy-microwaved-marshmallow-exoplanet/", 
            "description": "A surprising deficiency of methane suggests that tidal heating has puffed up the atmosphere of the warm gas giant WASP-107 b. Why is the warm gas-giant exoplanet WASP-107 b so, so puffy? With a moderate temperature and an ultra-low density on par with a micro…", 
            "title": "Webb Space Telescope Cracks Case of Puffy “Microwaved Marshmallow” Exoplanet - SciTechDaily"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=fpX39HY7ujI", 
            "description": "Check out the gorgeous opening moments of Ninja Theory's long-anticipated Hellblade II, captured using a PC equipped with a GeForce RTX 4090 at full 4K 60fps...", 
            "title": "Senua's Saga: Hellblade 2 - The First 20 Minutes of Gameplay | 4K 60FPS PC Gameplay - IGN"
        }
    ], 
    "last_updated": "2024-05-22 17:00:09"
}