{
    "news": [
        {
            "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-closes-above-40000-for-first-time-to-cap-winning-week-for-stocks-200951979.html", 
            "description": "Stocks trod water as investors assess the chances of the Dow succeeding in another bid to cross 40,000 for the first time.", 
            "title": "Stock market today: Stocks tread water with Dow aiming for 40,000 - Yahoo Finance"
        }, 
        {
            "url": "https://variety.com/2024/film/news/yorgos-lanthimos-emma-stone-kinds-of-kindness-cannes-standing-ovation-1236007352/", 
            "description": "Yorgos Lanthimos’ ‘Kinds of Kindness,’ with Emma Stone and Jesse Plemons, earned a standing ovation at the 2024 Cannes Film Festival.", 
            "title": "Emma Stone’s Descent Into Sex Cults and Cannibalism in ‘Kinds of Kindness’ Lands 4.5-Minute Standing Ovation in Cannes - Variety"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/17/nvidias-earnings-will-be-in-focus-next-week-as-stocks-try-to-sustain-record-levels.html", 
            "description": "The AI chipmaker could reinvigorate a trade that has the power to propel stocks higher at a time when market leadership has broadened.", 
            "title": "Nvidia's earnings will be in focus next week as stocks try to sustain record levels - CNBC"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/17/entertainment/sean-combs-cassie-ventura/index.html", 
            "description": "A 2016 surveillance video obtained exclusively by CNN shows Sean “Diddy” Combs grab, shove, drag and kick his then-girlfriend Cassie Ventura during an altercation that matches allegations in a now-settled federal lawsuit filed by Ventura in November.", 
            "title": "Sean 'Diddy' Combs seen physically assaulting Cassie Ventura in 2016 surveillance video obtained by CNN - CNN"
        }, 
        {
            "url": "https://www.wtae.com/article/scottie-scheffler-detained-police-valhalla-louisville-pga/60823312", 
            "description": "Masters champion Scottie Scheffler was arrested Friday morning on his way to the PGA Championship.", 
            "title": "Scottie Scheffler arrested at PGA Championship for traffic violation - WTAE Pittsburgh"
        }, 
        {
            "url": "https://www.cbsnews.com/news/merrick-garland-contempt-of-congress-house/", 
            "description": "The Justice Department said Thursday morning that the president was asserting executive privilege over the recordings with special counsel Robert Hur.", 
            "title": "Garland contempt resolution clears House panels as Biden asserts privilege over recordings - CBS News"
        }, 
        {
            "url": "https://www.reuters.com/world/us/supreme-court-justice-alitos-home-flew-us-flag-upside-down-following-jan-6-nyt-2024-05-17/", 
            "description": null, 
            "title": "Supreme Court Justice Alito's home flew US flag upside down following Jan. 6-NYT - Reuters"
        }, 
        {
            "url": "https://deadline.com/video/francis-ford-coppola-megalopolis-adam-driver-aubrey-plaza-nathalie-emmanuel-interview-cannes/", 
            "description": "Francis Ford Coppola, Adam Driver, Aubrey Plaza and Nathalie Emmanuel", 
            "title": "Francis Ford Coppola \"Not Interested\" In Streaming For 'Megalopolis' - Deadline"
        }, 
        {
            "url": "https://apnews.com/article/israel-hamas-war-gaza-aid-us-pier-05-17-2024-336c810724d107a41bb6628c721aea7c", 
            "description": "Trucks carrying badly needed aid for the Gaza Strip have rolled across a newly built U.S. pier and into the besieged enclave for the first time. Friday's shipment is the first in an operation that American military officials anticipate could scale up to 150 t…", 
            "title": "Israel-Hamas war: Gaza aid driven across new US-built pier. Challenges remain - The Associated Press"
        }, 
        {
            "url": "https://nypost.com/2024/05/17/entertainment/joy-behar-warns-jennifer-lopez-to-be-quiet-amid-ben-affleck-split-rumors/", 
            "description": "“When you go around shouting your love from the rooftops, it gets tricky when things don’t go well. My advice is keep your mouth shut,” Joy Behar said to Jennifer Lopez.", 
            "title": "'Addicted to marriage': Joy Behar warns Jennifer Lopez to keep her 'mouth shut' as Ben Affleck divorce rumors swirl - New York Post "
        }, 
        {
            "url": "https://www.wlky.com/article/scottie-scheffler-detained-pga-championship-louisville/60823461", 
            "description": "Scottie Scheffler, the No. 1 golfer in the world, has been detained by LMPD outside of Valhalla Golf Club, ESPN reports.", 
            "title": "Scottie Scheffler arrested outside of PGA Championship in Louisville - WLKY Louisville"
        }, 
        {
            "url": "https://apnews.com/article/israel-hamas-war-gaza-hostages-shani-louk-a37e4fd656b46be36c4c659a9c2aac7d", 
            "description": "The Israeli military says its troops in Gaza found the bodies of three Israeli hostages killed by Hamas in its Oct. 7 attack, including German-Israeli Shani Louk. A photo of Louk’s twisted body in the back of a pickup truck ricocheted around the world, bringi…", 
            "title": "Israeli military finds bodies of 3 hostages in Gaza, including Shani Louk - The Associated Press"
        }, 
        {
            "url": "https://www.cbsnews.com/news/covid-likely-growing-states-cdc-estimates/", 
            "description": "Health authorities are watching for signs the virus might be starting to accelerate again after a springtime lull in COVID rates.", 
            "title": "COVID \"likely growing\" in D.C. and 12 states, CDC estimates - CBS News"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.usatoday.com/story/news/world/2024/05/17/bull-attacks-tourist-mexico-beach/73732636007/", 
            "description": null, 
            "title": "Video shows bull attack tourist who was feeding the animal on a Mexico beach - USA TODAY"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=mQBcH_a7nLA", 
            "description": "China Wants to Rescue its Housing Market. Will Beijing Succeed? | Vantage with Palki SharmaWith more than seven million homes sitting empty, China's housing ...", 
            "title": "China Wants to Rescue its Housing Market. Will Beijing Succeed? | Vantage with Palki Sharma - Firstpost"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cp3g8kl8dd5o", 
            "description": "The man was armed with a knife and a metallic tool and was shot by an officer after he threatened the police.", 
            "title": "Rouen: Man shot dead after French synagogue set on fire - BBC.com"
        }, 
        {
            "url": "https://9to5mac.com/2024/05/17/iphone-plus-going-the-way-of-the-iphone-mini-after-final-update-this-fall/", 
            "description": "Earlier this month we saw a report from Jeff Pu predicting that the iPhone 16 lineup will be the last...", 
            "title": "iPhone Plus going the way of the iPhone mini after final update this fall - 9to5Mac"
        }, 
        {
            "url": "https://apnews.com/article/pandas-atlanta-zoo-leaving-china-1f50b2f79b7d0ebc765acfff87f57bea", 
            "description": "The last U.S. zoo to have pandas in its care is preparing to say goodbye to the four giant bears this fall. Officials at Zoo Atlanta said Friday they preparing to return panda parents Lun Lun and Yang Yang to China along with their American-born twins, Ya Lun…", 
            "title": "The last pandas at any US zoo are expected to leave Atlanta for China this fall - The Associated Press"
        }, 
        {
            "url": "https://www.espn.com/soccer/story/_/id/40164590/lionel-messi-famous-barcelona-napkin-sold-auction", 
            "description": "The famous napkin that linked a young Lionel Messi to Barcelona sold for £762,400 ($965,000) on Friday, British auction house Bonhams said.", 
            "title": "Lionel Messi's famous Barcelona napkin sold for $965,000 - ESPN"
        }
    ], 
    "last_updated": "2024-05-19 01:00:39"
}