{
    "news": [
        {
            "url": "https://www.cnn.com/2024/05/22/world/sun-magnetic-field-scn/index.html", 
            "description": "The sun’s powerful magnetic field has long puzzled scientists. A new study suggests the source of its magnetic field is nearer the surface than first thought.", 
            "title": "Scientists a step closer to unraveling mystery of sun’s magnetic field - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/22/us/uvalde-shooting-victims-lawsuit/index.html", 
            "description": "Nineteen families of the students and teachers killed or injured at Robb Elementary School in Uvalde, Texas, announced Wednesday they have settled a lawsuit with the city for $2 million and said they are suing 92 officers with Texas Department of Public Safet…", 
            "title": "Uvalde families reach $2M settlement with city and say they are suing school district and 92 officers over shooting response - CNN"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/21/stock-market-today-live-updates.html", 
            "description": "The major averages declined Wednesday after the latest Fed meeting minutes indicated the central bank is apprehensive about when to cut rates.", 
            "title": "Dow closes 200 points lower for worst day in May as Fed reignites inflation worries: Live updates - CNBC"
        }, 
        {
            "url": "https://www.nbcnews.com/health/health-news/second-human-case-bird-flu-linked-dairy-cows-found-michigan-rcna153536", 
            "description": "A second person in the U.S. has been infected with bird flu linked to dairy cows, the Michigan Department of Health and Human Services reported Wednesday.", 
            "title": "Second human case of bird flu linked to dairy cows found in Michigan - NBC News"
        }, 
        {
            "url": "https://www.nbcnews.com/business/personal-finance/biden-grants-legal-protections-buy-now-pay-later-customers-rcna153441", 
            "description": "The Biden administration announced Wednesday that consumers who use \"buy now, pay later\" (BNPL) services for purchases are entitled to the same legal protections as consumers who use credit cards.", 
            "title": "Buy now, pay later customers granted legal protections through Consumer Financial Protection Bureau - NBC News"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cx99lnn2kn4o", 
            "description": "Protesters clashed for hours while police waited to intervene, prompting a university investigation.", 
            "title": "UCLA removes police chief after protesters clashed over Gaza war - BBC.com"
        }, 
        {
            "url": "https://www.foxnews.com/entertainment/jennifer-lopez-ben-affleck-living-separately-whirlwind-love-over-real-life-sets-source", 
            "description": "A source confirms to Fox News Digital that Ben Affleck and Jennifer Lopez are living separately, nearly two years after tying the knot.", 
            "title": "Jennifer Lopez, Ben Affleck living separately as 'whirlwind of love' is over and 'real life' sets in: source - Fox News"
        }, 
        {
            "url": "https://www.huffpost.com/entry/kate-middleton-return-to-work_n_664e0b46e4b048d73b54ff93", 
            "description": "The Princess of Wales revealed on March 22 that she had been diagnosed with an unspecified kind of cancer.", 
            "title": "Kensington Palace Clarifies Kate Middleton's Return To Work Timeline - HuffPost"
        }, 
        {
            "url": "https://www.nfl.com/news/roger-goodell-addresses-potential-18-game-schedule-private-equity-in-ownership-at-spring-league-meeting", 
            "description": "Commissioner Roger Goodell on Wednesday addressed the possibility of an 18-game regular-season schedule in the future and the prospect of private equity in ownership among other topics at the conclusion of the Spring League Meeting in Nashville, Tenn.", 
            "title": "Roger Goodell addresses potential 18-game schedule, private equity in ownership at Spring League Meeting - NFL.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/22/investing/graceland-foreclosure-hearing/index.html", 
            "description": "Graceland can stay in the hands of Elvis Presley’s family for the time being, after a Tennessee court chancellor ruled Wednesday that a mysterious company trying to sell it likely committed fraud.", 
            "title": "Court rules Elvis’ Graceland mansion cannot be foreclosed upon – for now - CNN"
        }, 
        {
            "url": "https://www.foxbusiness.com/lifestyle/red-lobster-bankruptcy-how-get-your-fix-chains-famed-biscuits", 
            "description": "Red Lobster said there were \"no current changes\" to the Red Lobster At Home offerings that the chain sells at retailers, despite the retailer filing for bankruptcy.", 
            "title": "Red Lobster bankruptcy: How to get your fix of chain’s famed biscuits - Fox Business"
        }, 
        {
            "url": "https://www.reuters.com/world/uk/rishi-sunak-calls-uk-national-election-july-4-2024-05-22/", 
            "description": null, 
            "title": "Rishi Sunak calls UK national election for July 4 - Reuters UK"
        }, 
        {
            "url": "https://www.cbsnews.com/news/india-teen-drunk-driving-deaths-bail-terms-essay-changed-amid-outrage/", 
            "description": "The son of a wealthy businessman in India, accused of killing 2 people in a Porsche, was initially told he'd be bailed if he wrote a short essay and spent some time with local police.", 
            "title": "Officials change course amid outrage over bail terms for Indian teen accused in fatal drunk driving accident - CBS News"
        }, 
        {
            "url": "http://9to5google.com/2024/05/22/android-find-my-device-trackers-shipping/", 
            "description": "After Google announced the launch of the Find My Device network on Android last month, the first trackers are finally...", 
            "title": "Android Find My Device trackers are starting to ship - 9to5Google"
        }, 
        {
            "url": "https://www.cbsnews.com/news/doomsday-glacier-ice-melt-sea-level-rise-projections/", 
            "description": "The \"doomsday glacier\" packs so much ice that if it were to completely collapse, it could singlehandedly cause global sea levels to rise by more than two feet.", 
            "title": "The doomsday glacier is undergoing \"vigorous ice melt\" that could reshape sea level rise projections - CBS News"
        }, 
        {
            "url": "https://apnews.com/article/norway-palestinian-state-ddfd774a23d39f77f5977b9c89c43dbc", 
            "description": "Norway, Ireland and Spain say they will recognize a Palestinian state. The historic but largely symbolic move further deepens Israel’s isolation more than seven months into its grinding war against Hamas in Gaza. Israel immediately denounced Wednesday's decis…", 
            "title": "Norway, Ireland and Spain say they will recognize a Palestinian state, deepening Israel's isolation - The Associated Press"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/22/nvidia-nvda-earnings-report-q1-2025-.html", 
            "description": "Nvidia reported earnings after the bell. Here are the results.", 
            "title": "Nvidia reports a 262% jump in sales, signals continuing AI boom - CNBC"
        }, 
        {
            "url": "https://nypost.com/2024/05/22/world-news/sickening-new-video-shows-hamas-line-up-female-israeli-soldiers-on-oct-7-here-are-the-girls-who-can-get-pregnant/", 
            "description": "The five bloodied women, who are still hostages of Hamas, were filmed surrounded by the bodies of their slain comrades.", 
            "title": "Sickening new video shows Hamas line up female Israeli soldiers on Oct. 7: 'Here are the girls who can get pregnant' - New York Post "
        }, 
        {
            "url": "https://www.ft.com/content/e3b5c1a0-48ac-4922-970a-8b9ca7c2539e", 
            "description": "Analysts see Target and Walmart setting a new tone for sector after years of increases", 
            "title": "Biggest US retailers cut prices as inflation hits shoppers - Financial Times"
        }, 
        {
            "url": "https://www.nbcnews.com/news/world/singapore-airlines-severe-turbulence-passengers-emergency-landing-rcna153435", 
            "description": "Passengers on board a Singapore Airlines flight that hit “severe turbulence” have described their terror as the plane dropped thousands of feet.", 
            "title": "Singapore Airlines turbulence left blood 'everywhere'; 20 remain in ICU - NBC News"
        }
    ], 
    "last_updated": "2024-05-24 00:30:38"
}