{
    "news": [
        {
            "url": "https://apnews.com/article/iran-president-ebrahim-raisi-426c6f4ae2dd1f0801c73875bb696f48", 
            "description": "Iranian President Ebrahim Raisi and the country’s foreign minister have been found dead hours after their helicopter crashed in fog. That leaves the Islamic Republic without two key leaders as extraordinary tensions grip the wider Middle East. Supreme Leader …", 
            "title": "Iran helicopter crash: Mohammad Mokhber becomes acting president - The Associated Press"
        }, 
        {
            "url": "https://www.usatoday.com/videos/news/politics/2024/05/20/julian-assange-wins-right-appeal-extradition-us-face-espionage-charges/73772328007/", 
            "description": null, 
            "title": "Julian Assange wins right to appeal extradition to US to face espionage charges - USA TODAY"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/20/us/baltimore-bridge-collapse-ship-relocation/index.html", 
            "description": "After 55 days stuck in the Patapsco River, the Dali cargo ship was hauled away from the site of its catastrophic crash into the Francis Scott Key Bridge – a crucial step toward fully reopening the busy Port of Baltimore.", 
            "title": "Almost 2 months after it destroyed Baltimore’s Key Bridge, the Dali cargo ship has been moved and docked. Here’s what’s next - CNN"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/20/jpmorgan-ceo-jamie-dimon-retirement-approaching.html", 
            "description": "The ambiguity of Dimon's plans has made succession timing at JPMorgan one of the persistent questions for the bank's investors and analysts. He is 68.", 
            "title": "JPMorgan CEO Jamie Dimon signals retirement is closer than ever - CNBC"
        }, 
        {
            "url": "https://www.washingtonpost.com/wellness/2024/05/20/heart-tests-echocardiograms-stress-test/", 
            "description": "Some tests have been found to be used far too often, at little benefit.", 
            "title": "Echocardiograms, cardiac calcium tests: Should you get these checkups? - The Washington Post"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/20/24160707/microsoft-surface-pro-price-release-date-ai", 
            "description": "Microsoft’s new laptop / tablet hybrid device comes with improved processors, a new focus on AI, and new keyboard and stylus accessories.", 
            "title": "Microsoft Surface Pro announced: price and release date - The Verge"
        }, 
        {
            "url": "https://www.houstonchronicle.com/news/houston-weather/article/storm-tornado-live-updates-closures-outages-19466994.php", 
            "description": "Follow along for the latest on power outages, road conditions, school closures and more following Houston's deadly May thunderstorm.", 
            "title": "Live updates: AC issues affecting multiple Houston ISD schools - Houston Chronicle "
        }, 
        {
            "url": "https://www.newsnationnow.com/crime/gilgo-beach-killings/police-search-heuermann-home/", 
            "description": "Heuermann is currently awaiting trial in the deaths of four women whose bodies were found along Gilgo Beach.", 
            "title": "Medical examiner arrives at Gilgo Beach suspect’s house as search continues - NewsNation Now"
        }, 
        {
            "url": "https://www.windowscentral.com/software-apps/windows-11/microsoft-ushers-in-new-era-of-windows-with-copilot-pcs-the-true-next-gen-ai-laptops-are-here", 
            "description": "The next stage of the AI PC is here, and it comes in the form of Copilot+ PCs that are capable of some truly next-gen AI experiences.", 
            "title": "Microsoft ushers in new era of Windows with 'Copilot+' PCs — the true next-gen AI laptops are here - Windows Central"
        }, 
        {
            "url": "https://www.reuters.com/world/us/trump-has-chance-testify-hush-money-trial-if-he-so-chooses-2024-05-20/", 
            "description": null, 
            "title": "Stealing from Trump was 'self-help,' Cohen testifies at hush money trial - Reuters"
        }, 
        {
            "url": "https://www.wdrb.com/news/scottie-schefflers-arraignment-for-allegedly-assaulting-a-louisville-police-officer-delayed-until-june/article_6df4c3b4-16c8-11ef-a836-a78b4fa14e7b.html", 
            "description": "Attorney Steve Romines, who is representing Scheffler, said he had scheduling issues requiring the delay. Scheffler, because he is charged with a felony, is expected to have to attend the", 
            "title": "Scottie Scheffler's arraignment for allegedly assaulting a Louisville police officer delayed until June - WDRB"
        }, 
        {
            "url": "https://www.scrippsnews.com/us-news/crime/public-health-alert-issued-after-hiv-positive-sex-worker-had-over-200-clients", 
            "description": "Authorities in Ohio have released a public health warning after learning that an HIV-positive sex worker had interactions with over 200 clients spanning...", 
            "title": "Public health alert issued after HIV-positive sex worker had over 200 clients - AOL"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/kevin-costner-horizon-yellowstone-1235904037/", 
            "description": "During a career-spanning chat with Scott Feinberg, the Oscar-winning filmmaker opened up about a life-changing encounter with Richard Burton, what really happened with 'Waterworld' and investing chunks of his \"pile\" in films he believes in.", 
            "title": "Cannes: Kevin Costner Talks Passion Project ‘Horizon,’ ‘Yellowstone’ Standoff at Lively ‘Awards Chatter’ Podcast Taping - Hollywood Reporter"
        }, 
        {
            "url": "https://www.cbsnews.com/news/red-lobster-bankruptcy-chapter-11-sale-restaurants/", 
            "description": "Red Lobster's owner has said the pandemic and rising costs hurt the seafood chain's financial performance.", 
            "title": "Red Lobster files for Chapter 11 bankruptcy protection - CBS News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/20/entertainment/american-idol-finale-katy-perry/index.html", 
            "description": "Katy Perry said her goodbyes on “American Idol” after seven seasons.", 
            "title": "Katy Perry sings goodbye to ‘American Idol’ - CNN"
        }, 
        {
            "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/20/trump-glitch-pause-during-nra-speech/73767035007/", 
            "description": null, 
            "title": "Trump glitch? Biden and Trump spar over Trump pause during NRA speech - USA TODAY"
        }, 
        {
            "url": "https://techcrunch.com/2024/05/20/chatgpts-mobile-app-revenue-saw-biggest-spike-yet-following-gpt-4o-launch/", 
            "description": "The ChatGPT mobile app's net revenue first jumped 22% on the day of the GPT-4o launch and continued to grow in the following days.", 
            "title": "ChatGPT's mobile app revenue saw biggest spike yet following GPT-4o launch - TechCrunch"
        }, 
        {
            "url": "https://www.espn.com/soccer/story/_/id/40184389/man-city-premier-league-title-liverpool-jurgen-klopp-marcotti", 
            "description": "It might take some time to appreciate what Man City have done under Pep Guardiola, while Juventus fired Max Allegri and Liverpool said goodbye to Jurgen Klopp.", 
            "title": "Assessing Man City's four-peat, Liverpool's goodbye to Klopp, more: Marcotti recaps the weekend - ESPN"
        }, 
        {
            "url": "https://www.theverge.com/24158374/google-ceo-sundar-pichai-ai-search-gemini-future-of-the-internet-web-openai-decoder-interview", 
            "description": "Google’s Sundar Pichai discusses the latest in AI, search, and what the web will like in the future.", 
            "title": "Google CEO Sundar Pichai on AI-powered search and the future of the web - The Verge"
        }, 
        {
            "url": "https://www.foxnews.com/media/pope-francis-corrects-60-minutes-church-blessing-same-sex-unions-sacrament", 
            "description": "Pope Francis corrected \"60 Minutes\" in an interview airing Sunday as he explained the Church did not sanction the blessings of same-sex unions.", 
            "title": "Pope Francis corrects '60 Minutes' on Church not blessing same-sex unions: 'That is not the sacrament' - Fox News"
        }
    ], 
    "last_updated": "2024-05-21 21:00:22"
}