{
    "news": [
        {
            "url": "https://www.cnbc.com/2024/05/28/stock-market-today-live-updates.html", 
            "description": "Stock futures were lower Wednesday, as traders kept an eye on Treasury yields with inflation concerns simmering.", 
            "title": "Dow futures drop more than 200 points on Wednesday: Live updates - CNBC"
        }, 
        {
            "url": "https://www.washingtonpost.com/education/2024/05/29/harvard-university-political-statements/", 
            "description": "The university said it will avoid statements on public issues and current events. It faced backlash for its response to the Oct. 7 Hamas attack on Israel.", 
            "title": "Harvard will no longer provide statements of empathy on public issues - The Washington Post"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/crgg2neyr65o", 
            "description": "The governing party is battling to retain its parliamentary majority, 30 years after Nelson Mandela led it to victory.", 
            "title": "South Africans vote in pivotal election for the ANC - BBC.com"
        }, 
        {
            "url": "https://www.reuters.com/world/asia-pacific/union-samsung-electronics-south-korea-declares-strike-2024-05-29/", 
            "description": null, 
            "title": "Samsung Electronics' union threatens first ever walkout next week - Reuters"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3Lm5kdHYuY29tL3dvcmxkLW5ld3MvZXhwbGFpbmVkLXdoYXQtcHJvYmUtaW50by10dXJidWxlbmNlLWhpdC1zaW5nYXBvcmUtYWlybGluZXMtZmxpZ2h0LXJldmVhbHMtNTc3MDk4M9IBeGh0dHBzOi8vd3d3Lm5kdHYuY29tL3dvcmxkLW5ld3MvZXhwbGFpbmVkLXdoYXQtcHJvYmUtaW50by10dXJidWxlbmNlLWhpdC1zaW5nYXBvcmUtYWlybGluZXMtZmxpZ2h0LXJldmVhbHMtNTc3MDk4My9hbXAvMQ?oc=5", 
            "description": null, 
            "title": "Explained: What Probe Into Turbulence-Hit Singapore Airlines Flight Reveals - NDTV"
        }, 
        {
            "url": "https://www.reuters.com/world/asia-pacific/south-korea-alert-balloons-dropping-trash-north-2024-05-29/", 
            "description": null, 
            "title": "S.Korea accuses North of sending balloons with excrement across border - Reuters"
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-29/anglo-won-t-extend-bhp-deadline-threatening-end-to-takeover-bid", 
            "description": "Anglo American Plc said it won’t give BHP Group any further time to commit to a takeover offer, threatening to end a $49 billion pursuit by the world’s biggest mining company.", 
            "title": "Anglo Won't Extend BHP Deadline, Threatening End to Takeover Bid - Bloomberg"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/29/trump-birth-control-contraception-00159555", 
            "description": null, 
            "title": "Trump says he won't 'ban' birth control. Here's what he may do instead. - POLITICO"
        }, 
        {
            "url": "https://www.reuters.com/world/middle-east/worlds-largest-humanitarian-network-calls-gaza-ceasefire-2024-05-29/", 
            "description": null, 
            "title": "World's largest humanitarian network calls for Gaza ceasefire - Reuters"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/crggxm0rd23o", 
            "description": "A standoff with Republicans in Ohio threatened to keep the US president off November's ballot in the state.", 
            "title": "Democrats unveil plan to get Biden on Ohio general election ballot - BBC.com"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LnRleGFzdHJpYnVuZS5vcmcvMjAyNC8wNS8yNC90b255LWdvbnphbGVzLWJyYW5kb24taGVycmVyYS10ZXhhcy1wcmltYXJ5LXJ1bm9mZi_SAQA?oc=5", 
            "description": null, 
            "title": "U.S. Rep. Tony Gonzales declares victory in GOP runoff - The Texas Tribune"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://nypost.com/2024/05/28/sports/shaq-charles-barkley-devastated-by-death-of-bill-walton/", 
            "description": "The basketball world was still mourning the Monday death of the beloved former player and broadcaster Bill Walton when “Inside the NBA” went on air Tuesday ahead of the Mavericks’ Game 4 batt…", 
            "title": "Shaq, Charles Barkley devastated by death of Bill Walton: 'World is not as good' - New York Post "
        }, 
        {
            "url": "https://ew.com/hollywood-makeup-artist-allie-shehorn-stabbed-by-ex-boyfriend-over-20-times-report-8655006", 
            "description": "Allie Shehorn, a makeup artist whose films include 'Babylon' and 'Rebel Moon,' is reportedly recovering in the hospital after allegedly being stabbed by her ex-boyfriend over 20 times.", 
            "title": "'Babylon' makeup artist Allie Shehorn allegedly stabbed by ex-boyfriend over 20 times: report - Entertainment Weekly News"
        }, 
        {
            "url": "https://spacenews.com/falcon-9-launches-esas-earthcare-mission/", 
            "description": "A Falcon 9 successfully launched an Earth science mission for Europe and Japan May 28 as part of ESA’s ongoing, if temporary, reliance on SpaceX.", 
            "title": "Falcon 9 launches ESA's EarthCARE mission - SpaceNews"
        }, 
        {
            "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-28-2024-21ea44e3b514d3f3f2bd26a33f157e48", 
            "description": "Renewed Israeli shelling and strikes have killed at least 37 people, most of them sheltering in tents, outside the southern Gaza city of Rafah. That's according to witnesses, first responders and hospital officials. The bombardment overnight and into Tuesday …", 
            "title": "Israeli strikes kill at least 37 Palestinians, most in tents, near Gaza's Rafah as offensive expands - The Associated Press"
        }, 
        {
            "url": "https://apnews.com/article/manhattanhenge-sun-photos-5365b8876ea12943442e8ea679505c4e", 
            "description": "Twice per year, New Yorkers and visitors are treated to a phenomenon known as Manhattanhenge, when the setting sun aligns with the Manhattan street grid and sinks below the horizon framed in a canyon of skyscrapers. The first Manhattanhenge of the year happen…", 
            "title": "Manhattanhenge 2024: Watch live and see what time it starts - The Associated Press"
        }, 
        {
            "url": "https://www.platformer.news/google-ai-overviews-eat-rocks-glue-pizza/", 
            "description": "The AI Overviews debacle and leaked search ranking documents tell a common story about the web's future — and it's not pretty", 
            "title": "Google's AI search setback - Platformer"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/28/politics/trump-hush-money-closing-arguments-takeaways/index.html", 
            "description": "Prosecutors told jurors on Tuesday they’ve seen a “mountain of evidence” to prove that Donald Trump falsified business records in order to cover up a damaging story about an alleged affair at the end of the 2016 election.", 
            "title": "Takeaways from closing arguments in the Donald Trump hush money trial - CNN"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/28/24166632/galaxy-z-flip-6-smart-ring-size-battery-capacity-leaks", 
            "description": "FCC testing documents reveal a slightly higher battery capacity for the Galaxy Z Flip 6 foldable versus its predecessor, as well as a size five ring for the Galaxy Ring.", 
            "title": "New Galaxy Z Flip 6 and Galaxy Ring details have leaked, courtesy of the FCC - The Verge"
        }
    ], 
    "last_updated": "2024-05-30 12:13:02"
}