{
    "news": [
        {
            "url": "https://apnews.com/article/boy-scouts-new-name-scouting-america-d583f5712680f155b4f6b762128734d3", 
            "description": "The Boy Scouts of America is changing its name for the first time in its 114-year history. The Texas-based organization announced Tuesday that it would become Scouting America. It's a significant shift for the organization as it emerges from bankruptcy after …", 
            "title": "Boy Scouts is changing its name to Scouting America - The Associated Press"
        }, 
        {
            "url": "https://www.washingtonpost.com/wellness/2024/05/07/olive-oil-dementia-lower-risk/", 
            "description": "A study has found that daily olive oil consumption is associated with a lower risk of dying from dementia.", 
            "title": "Olive oil use associated with lower risk of dying from dementia - The Washington Post"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/07/reddit-rddt-q1-2024-earnings.html", 
            "description": "Reddit reported a big increase in sales for the first quarter and said second-quarter revenue will jump by more than 30%, based on the midpoint of the range.", 
            "title": "Reddit shares soar almost 20% after company reports revenue pop in debut earnings report - CNBC"
        }, 
        {
            "url": "https://finance.yahoo.com/news/disney-stock-falls-as-company-attempts-to-make-streaming-business-profitable-103032382.html", 
            "description": "Disney reported its fiscal second quarter earnings before the bell on Tuesday. Here's what to know.", 
            "title": "Disney stock falls as company attempts to make streaming business profitable - Yahoo Finance"
        }, 
        {
            "url": "https://abcnews.go.com/International/2-ukrainians-detained-allegedly-plotting-zelenskyy-assassination-russia/story?id=108534193", 
            "description": "Two colonels from Ukraine's SBU were recruited by Russia, Ukraine said.", 
            "title": "2 Ukrainians detained for allegedly plotting Zelenskyy assassination with Russia, Ukraine says - ABC News"
        }, 
        {
            "url": "https://www.tennessean.com/story/news/local/wilson/mt-juliet/2024/05/07/nasa-boeing-launch-tennessee-astronaut-barry-wilmore-delayed/73597628007/", 
            "description": "Learn why the NASA Boeing Starliner launch was delayed and what Middle Tennessee astronaut Barry \"Butch\" Wilmore said.", 
            "title": "NASA Starliner launch with Tennessee astronaut Barry Wilmore delayed. What we know - Yahoo! Voices"
        }, 
        {
            "url": "https://www.macrumors.com/2024/05/07/2024-ipad-battery-life/", 
            "description": "The iPad Pro and iPad Air models that Apple introduced today continue to offer the same 10 hours of battery life that Apple has advertised with iPads...", 
            "title": "New 2024 iPads Still Have 10 Hours of Battery Life - MacRumors"
        }, 
        {
            "url": "https://www.usatoday.com/story/news/nation/2024/05/07/nasa-black-hole-simulation-fall-video/73597922007/", 
            "description": "NASA released a variety of videos Monday showing visualizations of what it would look like to either plummet into a black hole or narrowly escape it.", 
            "title": "NASA simulations show what it would be like to fall in black hole: Video - USA TODAY"
        }, 
        {
            "url": "https://www.cbssports.com/nfl/news/2024-nfl-strength-of-schedule-for-all-32-teams-browns-ravens-among-hardest-falcons-saints-have-it-easiest/", 
            "description": "Here's how the strength of schedule ranking breaks down for all 32 teams heading into the 2024 season", 
            "title": "2024 NFL strength of schedule for all 32 teams for upcoming season - CBS Sports"
        }, 
        {
            "url": "https://www.windowscentral.com/hardware/cpu-gpu-components/apple-unveils-m4-processor-thats-an-ai-powerhouse-but-qualcomm-and-its-snapdragon-x-elite-have-nothing-to-worry-about", 
            "description": "Apple's new M4 processor is impressive, but it won't steal the thunder of Qualcomm's Snapdragon X Elite.", 
            "title": "Apple M4 vs Qualcomm Snapdragon X Elite: Who takes the AI crown? - Windows Central"
        }, 
        {
            "url": "https://abcnews.go.com/US/us-weather-tornadoes-may-7-tuesday/story?id=109984037", 
            "description": "One person was killed when a storm hit Oklahoma.", 
            "title": "19 tornadoes reported in 7 states across the Plains - ABC News"
        }, 
        {
            "url": "https://www.wtae.com/article/police-investigating-shooting-outside-drake-toronto-home/60719289", 
            "description": "A security guard working at Drake's home in Toronto, Canada, has been shot, authorities said Tuesday.", 
            "title": "Police investigating shooting of security guard outside Drake's Toronto home - WTAE Pittsburgh"
        }, 
        {
            "url": "https://www.eonline.com/news/1401043/bridgertons-phoebe-dynevor-engaged-to-cameron-fuller-see-her-debut-ring-at-met-gala", 
            "description": "After Bridgerton's Phoebe Dynevor debuted a gorgeous engagement ring at the 2024 Met Gala May 6, E! News can confirm she's set to tie the knot with producer Cameron Fuller.", 
            "title": "Bridgerton's Phoebe Dynevor Engaged to Cameron Fuller: See Her Debut Ring at Met Gala - E! NEWS"
        }, 
        {
            "url": "https://www.espn.com/nfl/story/_/id/40101148/source-wr-tyler-boyd-agrees-one-year-contract-titans", 
            "description": "Receiver Tyler Boyd is signing with the Tennessee Titans on a one-year deal worth up to $4.5 million, a source told ESPN's Jeremy Fowler on Tuesday.", 
            "title": "Source: WR Boyd agrees to contract with Titans - ESPN"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://techcrunch.com/2024/05/07/openai-says-its-building-a-tool-to-let-content-creators-opt-out-of-ai-training/", 
            "description": "OpenAI says that it's building a tool, Media Manager, to allow content creators to \"opt out\" of training for AI models.", 
            "title": "OpenAI says it’s building a tool to let content creators ‘opt out’ of AI training - TechCrunch"
        }, 
        {
            "url": "https://www.politico.eu/article/emmanuel-macron-xi-jinping-china-france-meeting-trade-ukraine/", 
            "description": "Xi Jinping handed Emmanuel Macron some wins during his state visit, but offered few meaningful concessions on trade and Ukraine", 
            "title": "Macron's cognac — the only thing that went down smoothly with Xi - POLITICO Europe"
        }, 
        {
            "url": "https://www.washingtonpost.com/technology/2024/05/07/tiktok-legal-challenge-law-ban/", 
            "description": "The filing ignites a high-stakes court battle in Washington that could prove to be an existential fight for one of the world’s most popular apps.", 
            "title": "TikTok challenges federal law that could lead to its being banned - The Washington Post"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/07/biden-antisemitism-rafah-israel-protest-00156541", 
            "description": null, 
            "title": "Biden warns of a 'ferocious' surge in antisemitism in the U.S. and across the globe - POLITICO"
        }, 
        {
            "url": "https://www.wired.com/story/google-pixel-8a/", 
            "description": "The company's refined midrange Android phone packs its flagship Tensor G3 chipset. The handset was announced ahead of next week's Google I/O conference.", 
            "title": "Google Pixel 8A: News, Specs, Features, Price, Release Date - WIRED"
        }
    ], 
    "last_updated": "2024-05-09 00:05:29"
}