{
    "news": [
        {
            "url": "https://apnews.com/article/iran-president-ebrahim-raisi-426c6f4ae2dd1f0801c73875bb696f48", 
            "description": "Iranian President Ebrahim Raisi and the country’s foreign minister have been found dead hours after their helicopter crashed in fog. That leaves the Islamic Republic without two key leaders as extraordinary tensions grip the wider Middle East. Supreme Leader …", 
            "title": "Iran helicopter crash: Mohammad Mokhber becomes acting president after Raisi's death - The Associated Press"
        }, 
        {
            "url": "https://www.nbcnews.com/business/business-news/red-lobster-files-bankruptcy-rcna152437", 
            "description": "Red Lobster has filed for voluntary Chapter 11 bankruptcy in Florida, the company confirmed in a statement late Sunday night — but it intends to keep its locations open.", 
            "title": "Red Lobster files for bankruptcy, restaurants will stay open - NBC News"
        }, 
        {
            "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-challenges-maryland-assault-weapon-bans-rcna152641", 
            "description": "The Supreme Court on Monday declined to hear a challenge to a gun law in Maryland that bans assault-style weapons such as the AR-15 semiautomatic rifle, which has been used in various high-profile mass shootings.", 
            "title": "Supreme Court rejects challenge to Maryland 'assault weapon' ban - NBC News"
        }, 
        {
            "url": "https://www.cbsnews.com/baltimore/news/dali-refloated-key-bridge-collapse-port-of-baltimore-access/", 
            "description": "The Dali, the 948-foot-long cargo ship stuck in the Patapsco River for weeks since it felled the Francis Scott Key Bridge, was refloated Monday, before being transported to Seagirt Marine Terminal.", 
            "title": "Dali refloated weeks after collapse of Key Bridge, a milestone in reopening access to the Port of Baltimore. Here's what happens next - CBS Baltimore"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/20/24160621/openai-chatgpt-gpt4o-sky-scarlett-johansson-voice-assistant-her", 
            "description": "OpenAI is now pausing its “Sky” voice profile for its new GPT-4o model chatbot after users noted it sounds remarkably similar to actor Scarlett Johansson.", 
            "title": "OpenAI pulls its Scarlett Johansson-like voice for ChatGPT - The Verge"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/20/24160451/microsoft-surface-event-what-to-expect-ai", 
            "description": "Microsoft is holding a press-only event to discuss its AI and Surface device plans on May 20th, ahead of its Microsoft Build 2024 conference.", 
            "title": "What to expect from Microsoft's Surface event today - The Verge"
        }, 
        {
            "url": "https://www.cbssports.com/nba/news/wolves-anthony-edwards-shakes-off-disastrous-game-7-start-to-climb-yet-another-rung-on-nba-superstar-ladder/", 
            "description": "Edwards showed maturity in leading Minnesota to a historic second half comeback over the Nuggets", 
            "title": "Wolves' Anthony Edwards shakes off disastrous Game 7 start to climb yet another rung on NBA superstar ladder - CBS Sports"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.bostonglobe.com/2024/05/20/metro/bird-flu-virus-milk-raw-milk/", 
            "description": "What is pasteurization? How much testing does store-bought milk undergo? Is yogurt safe?", 
            "title": "Bird flu virus in milk: Seven things to know - The Boston Globe"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=fqjN7ijm53g", 
            "description": "Enjoy the videos and music you love, upload original content, and share it all with friends, family, and the world on YouTube.", 
            "title": "'I'll wreck you in Charlotte' - Ricky Stenhouse Jr. to Kyle Busch after the All-Star fight | NASCAR - NASCAR"
        }, 
        {
            "url": "https://www.foxbusiness.com/lifestyle/target-reduces-prices-5000-products-high-inflation-persists", 
            "description": "Target is the latest company to announce that it's slashing prices as inflation continues to squeeze consumer wallets. The price cuts will take effect this summer.", 
            "title": "Target reduces prices on 5,000 products as high inflation persists - Fox Business"
        }, 
        {
            "url": "https://finance.yahoo.com/news/morgan-stanley-wilson-capitulates-bearish-074726142.html", 
            "description": "(Bloomberg) -- One of Wall Street’s most prominent bears has just turned positive on the outlook for US stocks.Most Read from BloombergIran State TV Says ‘No...", 
            "title": "One of the last big bears on Wall Street turns bullish on US stocks - Yahoo Finance"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/20/middleeast/icc-israel-hamas-arrest-warrant-war-crimes-intl/index.html", 
            "description": "The International Criminal Court is seeking the arrest warrants on charges of war crimes and crimes against humanity over the October 7 attacks on Israel and the subsequent war in Gaza.", 
            "title": "EXCLUSIVE: ICC seeks arrest warrants against Sinwar and Netanyahu for war crimes over October 7 attack and Gaza war - CNN"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cw44l170xdwo", 
            "description": "The decision means Mr Assange will remain in the UK and be able to challenge US assurances over his prospective trial.", 
            "title": "Julian Assange wins right to challenge US extradition - BBC.com"
        }, 
        {
            "url": "https://www.nbcnews.com/politics/donald-trump/trump-hush-money-case-michael-cohen-testimony-trial-rcna152674", 
            "description": "Michael Cohen will return to the witness stand in a New York courtroom for a third day of cross-examination by Donald Trump's lawyers Monday in what could be the final day of testimony in the first criminal trial of a former president.", 
            "title": "Michael Cohen returns to witness stand as decision on Trump testimony in hush money trial looms - NBC News"
        }, 
        {
            "url": "https://www.reuters.com/business/aerospace-defense/ryanair-sees-flat-modestly-higher-summer-fares-after-record-fy-profit-2024-05-20/", 
            "description": "Ryanair CEO Michael O'Leary said on Monday that a \"recessionary feel around Europe\" could be a factor in slower-than-expected growth in airfares as the low-cost carrier posted record annual profits slightly ahead of expectations.", 
            "title": "Ryanair boss says 'recessionary feel' may be limiting air ticket price rises - Reuters"
        }, 
        {
            "url": "https://apnews.com/article/kevin-costner-2024-cannes-film-festival-horizon-528e240a45ff261242b44334316817a4", 
            "description": "A month before Kevin Costner puts the first installment of his multi-chapter Western “Horizon: An American Saga” into theaters, the actor-director came to the Cannes Film Festival to unveil his self-financed passion project. The movie is actually two, or if C…", 
            "title": "Q&A: Kevin Costner on unveiling his Western saga 'Horizon' at Cannes - The Associated Press"
        }, 
        {
            "url": "https://www.reuters.com/world/australia-nz-unable-send-evacuation-flights-new-caledonia-2024-05-20/", 
            "description": null, 
            "title": "Protesters block New Caledonia roads as French police pour in - Reuters"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://variety.com/2024/film/festivals/demi-moore-full-frontal-nudity-the-substance-margaret-qualley-1236009594/", 
            "description": "Demi Moore's new film, the feminist body horror \"The Substance,\" sees Demi Moore bare it all, with several scenes featuring full nudity.", 
            "title": "Demi Moore on Full Frontal Nudity With Margaret Qualley in ‘The Substance’: ‘A Very Vulnerable Experience’ but I Had a ‘Great Partner Who I Felt Very Safe With’ - Variety"
        }
    ], 
    "last_updated": "2024-05-21 17:30:06"
}