{
    "news": [
        {
            "url": "https://www.washingtonpost.com/world/2024/05/26/papua-new-guinea-landslide-kills-about-670/", 
            "description": "The International Organization for Migration said emergency responders have little hope of finding survivors after Friday’s disaster.", 
            "title": "About 700 dead in a Papua New Guinea landslide, U.N. estimates - The Washington Post"
        }, 
        {
            "url": "https://www.bostonglobe.com/2024/05/26/metro/braintree-movie-stabbing-spree/", 
            "description": "Cruz’s Sunday statement noted that the arrest followed “a day of multiple South Shore stabbing incidents, allegedly carried out by Ravizza.”", 
            "title": "Chilmark man charged Sunday with stabbings in Plymouth; ‘likely’ connection with Braintree attacks - The Boston Globe"
        }, 
        {
            "url": "https://www.cbsnews.com/news/hamas-rockets-central-israel-gaza-strip-sirens/", 
            "description": "The Israeli strike came hours after Hamas claimed that it fired a barrage of rockets from Gaza toward central Israel for the first time in months.", 
            "title": "At least 35 killed in Israeli airstrike on displaced persons camp in Rafah, health ministry says, hours after Hamas fired rockets into Israel - CBS News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/26/sport/indy-500-spt-intl/index.html", 
            "description": "Josef Newgarden used a scintillating last-lap pass to win the Indianapolis 500 on Sunday for the second consecutive year in a race that started four hours late due to extreme weather.", 
            "title": "Josef Newgarden wins Indianapolis 500 for second consecutive year after extreme weather delays - CNN"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=_Sklb8UI5w4", 
            "description": "Tune-in to TNT for Tonight's Game 3 between the Timberwolves and Mavericks! 8:00 PM ET | MIN/DALNever miss a moment with the latest news, trending stories an...", 
            "title": "Timberwolves @ Mavericks Game 3 | #NBAConferenceFinals presented by Google Pixel Live Scoreboard - NBA"
        }, 
        {
            "url": "https://www.cnet.com/deals/best-memorial-day-sales-2024-05-26/", 
            "description": "Memorial Day sales are in full swing, here’s everything you need to know.", 
            "title": "Memorial Day Sales 2024: Shop the Top Deals From Your Favorite Retailers - CNET"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.4029tv.com/article/arkansas-storm-damage-pictures-video-tornadoes/60906592", 
            "description": "Tornado-warned storms ripped through Arkansas early Sunday morning.", 
            "title": "Arkansas storm damage: Shocking pictures, videos - 4029tv"
        }, 
        {
            "url": "https://weather.com/news/weather/news/2024-05-25-deadly-tornado-texas-oklahoma-arkansas-storms", 
            "description": "Deadly tornadoes swept through Oklahoma, Texas and Arkansas Saturday night into Sunday.", 
            "title": "Tornadoes Strike Texas, Oklahoma, Arkansas | Weather.com - The Weather Channel"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.washingtonpost.com/weather/2024/05/26/pm-update-dc-weather-memorial-day-storms/", 
            "description": "Storms in the D.C. area may be most widespread from about noon to 9 p.m. Monday. Wind damage, large hail, a couple of tornadoes and flooding downpours are possible.", 
            "title": "PM Update: Strong to severe storms possible tonight and on Memorial Day - The Washington Post"
        }, 
        {
            "url": "https://nypost.com/2024/05/26/us-news/sitting-federal-judge-hits-justice-alito-for-eroding-trust-taking-sides-after-flag-controversy/", 
            "description": "Judge Michael Ponsor, a sitting federal judge appointed by Bill Clinton, weighed in on the upside-down flag flying at Justice Samuel Alito’s home.", 
            "title": "Sitting federal judge hits Justice Alito for eroding 'trust,' taking 'sides' after upside-down flag controversy - New York Post "
        }, 
        {
            "url": "https://apnews.com/article/furiosa-box-office-1b2a9c0aefec99b5105a09bfaf15679b", 
            "description": "The Memorial Day box office is cruising for a two-decade low. “Furiosa,” the Mad Max prequel starring Anya Taylor-Joy and Chris Hemsworth, claimed the first place spot for Friday-Saturday-Sunday with $25.6 million. That is according to studio estimates on Sun…", 
            "title": "'Furiosa,' 'Garfield' lead slowest Memorial Day box office in decades - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/26/world/qatar-airways-turbulence-dublin-injured-intl/index.html", 
            "description": "Six passengers and six cabin crew were injured after a Qatar Airways flight from Doha to Dublin was hit with turbulence on Sunday.", 
            "title": "12 people injured during turbulence on Qatar Airways flight - CNN"
        }, 
        {
            "url": "https://www.newsweek.com/pete-buttigieg-ridiculed-joe-bidens-massive-failure-electric-vehicles-1904860", 
            "description": "The U.S. Transportation Secretary is receiving backlash on social media for the department's slow roll out of electrical vehicle chargers.", 
            "title": "Pete Buttigieg Ridiculed for Joe Biden's $7.5 Billion 'Massive Failure' - Newsweek"
        }, 
        {
            "url": "https://www.tmz.com/2024/05/26/general-hospital-actor-johnny-wactor-dead-shot-killed-robbery-attempt-car-catalytic-converter/", 
            "description": "Johnny Wactor -- an actor best known for appearing in nearly 200 episodes of \"General Hospital\" -- has died, TMZ has learned.", 
            "title": "'General Hospital' Actor Johnny Wactor Shot, Killed During Robbery Attempt - TMZ"
        }, 
        {
            "url": "https://www.mlb.com/news/ronald-acuna-jr-exits-game-vs-pirates", 
            "description": null, 
            "title": "Ronald Acuña Jr. exits game vs. Pirates - MLB.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/26/politics/video/donald-trump-libertarian-convention-booed-heckled-contorno-ctmwknd-vpx", 
            "description": "Former President Donald Trump was loudly and consistently booed throughout his speech to the Libertarian convention, particularly when he asked attendees to “nominate me or at least vote for me.” CNN’s Steve Contorno reports.", 
            "title": "Watch Trump react to getting booed at Libertarian convention - CNN"
        }, 
        {
            "url": "https://bgr.com/science/it-might-be-time-for-nasa-to-bail-on-boeings-starliner/", 
            "description": "The first crewed launch of Boeing's Starliner has been put on hold once again. Maybe it's time to let the dream go.", 
            "title": "It might be time for NASA to bail on Boeing's Starliner - BGR"
        }, 
        {
            "url": "https://www.foxnews.com/entertainment/nicki-minaj-shares-update-after-amsterdam-arrest-livestream-ill-have-lawyers-god-take-from-here", 
            "description": "Nicki Minaj updated fans after she missed a show due to an alleged arrest in Amsterdam for drug possession, which she had livestreamed earlier that day.", 
            "title": "Nicki Minaj shares update after Amsterdam arrest livestream: ‘I’ll have the lawyers & GOD take it from here’ - Fox News"
        }
    ], 
    "last_updated": "2024-05-28 03:38:39"
}