{
    "news": [
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/kevin-costner-horizon-yellowstone-1235904037/", 
            "description": "During a career-spanning chat with Scott Feinberg, the Oscar-winning filmmaker opened up about a life-changing encounter with Richard Burton, what really happened with 'Waterworld' and investing chunks of his \"pile\" in films he believes in.", 
            "title": "Cannes: Kevin Costner Talks Passion Project ‘Horizon,’ ‘Yellowstone’ Standoff at Lively ‘Awards Chatter’ Podcast Taping - Hollywood Reporter"
        }, 
        {
            "url": "https://www.cbssports.com/mlb/news/mlb-power-rankings-why-only-five-teams-including-the-yankees-are-in-baseballs-upper-tier-of-contenders/", 
            "description": "What teams comprise the very top tier in baseball this season, and who sits at No. 1 right now?", 
            "title": "MLB Power Rankings: Why only five teams, including the Yankees, are in baseball's upper tier of contenders - CBS Sports"
        }, 
        {
            "url": "https://www.yahoo.com/news/cargo-ship-destroyed-baltimore-bridge-161445345.html", 
            "description": null, 
            "title": "Cargo ship that destroyed Baltimore bridge towed to port - Yahoo! Voices"
        }, 
        {
            "url": "https://www.cbsnews.com/news/red-lobster-bankruptcy-chapter-11-sale-restaurants/", 
            "description": "Red Lobster's owner has said the pandemic and rising costs hurt the seafood chain's financial performance.", 
            "title": "Red Lobster files for Chapter 11 bankruptcy protection - CBS News"
        }, 
        {
            "url": "https://gizmodo.com/apple-openai-chatbot-ios18-1851487977", 
            "description": "Reports say Apple will have its own in-house AI to improve Siri, and the makers of ChatGPT are working on a chatbot for iPhones.", 
            "title": "Apple Is Teaming With Open AI to Put a Chatbot Into iOS 18 - Gizmodo"
        }, 
        {
            "url": "https://phys.org/news/2024-05-outlining-microscopic-black-hole-entropy.html", 
            "description": "Black holes are intriguing astronomical objects that have a gravitational pull so strong that it prevents any object and even light from escaping. While black holes have been the topic of numerous astrophysical studies, their origins and underlying physics re…", 
            "title": "A model outlining the microscopic origin of black hole entropy - Phys.org"
        }, 
        {
            "url": "https://techcrunch.com/2024/05/20/chatgpts-mobile-app-revenue-saw-biggest-spike-yet-following-gpt-4o-launch/", 
            "description": "The ChatGPT mobile app's net revenue first jumped 22% on the day of the GPT-4o launch and continued to grow in the following days.", 
            "title": "ChatGPT's mobile app revenue saw biggest spike yet following GPT-4o launch - TechCrunch"
        }, 
        {
            "url": "https://finance.yahoo.com/news/wall-streets-biggest-bear-flips-raises-sp-500-price-target-by-20-142228247.html", 
            "description": "Morgan Stanley chief investment officer Mike Wilson believes an improving growth outlook and an earnings rebound will drive the S&P 500 higher over the next ...", 
            "title": "Wall Street's biggest bear flips, raises S&P 500 price target by 20% - Yahoo Finance"
        }, 
        {
            "url": "https://www.cbsnews.com/news/supreme-court-maryland-assault-weapons-ban/", 
            "description": "The Supreme Court on Monday declined to take up a challenge to Maryland's ban on so-called assault weapons, allowing legal proceedings to play out.", 
            "title": "Supreme Court turns away challenge to Maryland assault weapons ban - CBS News"
        }, 
        {
            "url": "https://www.theverge.com/24158374/google-ceo-sundar-pichai-ai-search-gemini-future-of-the-internet-web-openai-decoder-interview", 
            "description": "Google’s Sundar Pichai discusses the latest in AI, search, and what the web will like in the future.", 
            "title": "Google CEO Sundar Pichai on AI-powered search and the future of the web - The Verge"
        }, 
        {
            "url": "https://apnews.com/article/iran-ebrahim-raisi-obituary-helicopter-crash-107ffb888540ef022a84ec719b81398c", 
            "description": "Iranian President Ebrahim Raisi has died. He was a hard-line protege of the country’s supreme leader who helped oversee the mass executions of thousands in 1988 and later led the country as it enriched uranium near weapons-grade levels, launched a major attac…", 
            "title": "Iranian President Ebrahim Raisi, supreme leader's protege, dies at 63 in helicopter crash - The Associated Press"
        }, 
        {
            "url": "https://www.bostonglobe.com/2024/05/20/metro/bird-flu-virus-milk-raw-milk/", 
            "description": "What is pasteurization? How much testing does store-bought milk undergo? Is yogurt safe?", 
            "title": "Bird flu virus in milk: Seven things to know - The Boston Globe"
        }, 
        {
            "url": "https://abcnews.go.com/Politics/biden-silent-protest-morehouse-commencement/story?id=110376198", 
            "description": "\"I support peaceful, nonviolent protests,\" Biden said.", 
            "title": "Biden faces silent protests at Morehouse commencement - ABC News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/20/middleeast/icc-israel-hamas-arrest-warrant-war-crimes-intl/index.html", 
            "description": "The International Criminal Court is seeking the arrest warrants on charges of war crimes and crimes against humanity over the October 7 attacks on Israel and the subsequent war in Gaza.", 
            "title": "EXCLUSIVE: ICC seeks arrest warrants against Sinwar and Netanyahu for war crimes over October 7 attack and Gaza war - CNN"
        }, 
        {
            "url": "https://variety.com/2024/film/news/donald-trump-movie-the-apprentice-dan-snyder-feud-1236010060/", 
            "description": "As ‘The Apprentice,' a look at Donald Trump's early years, premieres in Cannes, one of its investors, Dan Snyder, is furious over the film", 
            "title": "Inside the Legal Battle to Recut Trump Movie ‘The Apprentice’: Why Billionaire Investor Dan Snyder Is Furious With Ex-President’s Portrayal (EXCLUSIVE) - Variety"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.space.com/space-trash-constellations-highlight-space-junk-problem", 
            "description": "The Space Trash Signs project has created \"constellations\" made of defunct satellites and old rocket parts to draw attention to the worsening space debris problem.", 
            "title": "Space Trash Signs project creates debris 'constellations' to highlight space junk problem (video) - Space.com"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cw44l170xdwo", 
            "description": "The decision means Mr Assange will remain in the UK and be able to challenge US assurances over his prospective trial.", 
            "title": "Julian Assange wins right to challenge US extradition - BBC.com"
        }, 
        {
            "url": "https://www.etonline.com/katy-perry-talks-possibility-of-returning-to-american-idol-after-exit-hopes-for-her-replacement", 
            "description": "Katy Perry told her fellow judges to keep her seat 'warm.'", 
            "title": "Katy Perry Talks Possibility of Returning to 'American Idol' After Exit, Hopes for Her Replacement (Exclusive) - Entertainment Tonight"
        }
    ], 
    "last_updated": "2024-05-21 19:00:13"
}