{
    "news": [
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://abcnews.go.com/US/number-1-golfer-world-scottie-scheffler-arrested-prior/story?id=110333394", 
            "description": "He now faces charges of second-degree assault of a police officer, among others.", 
            "title": "Star golfer Scottie Scheffler arrested prior to start of PGA Championship's 2nd round: Report - ABC News"
        }, 
        {
            "url": "https://apnews.com/article/trump-biden-debates-cnn-abc-e048a86824c5ed912d795bc37ae66f58", 
            "description": "The two planned presidential debates between Joe Biden and Donald Trump that were swiftly organized this week are good news for CNN and ABC News. But the arrangement virtually guarantees they will be among the least-watched general election debates ever. The …", 
            "title": "Taking presidential debates out of commission's hands virtually guarantees fewer viewers - The Associated Press"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/17/state-department-worldwide-caution-alert-lgbtq-00158753", 
            "description": null, 
            "title": "State Department issues unusual worldwide LGBTQ+ travel alert - POLITICO"
        }, 
        {
            "url": "https://finance.yahoo.com/news/boeing-shareholders-approve-ceo-compensation-164801983.html", 
            "description": "Boeing shareholders on Friday approved CEO David Calhoun's $32.8 million compensation and heard leaders explain what the troubled aircraft maker is doing to ...", 
            "title": "Boeing shareholders approve CEO's compensation as company faces investigations, possible prosecution - Yahoo Finance"
        }, 
        {
            "url": "https://apnews.com/article/houston-texas-severe-weather-storms-d14447267de0a8900e1475a8ad7ed8ba", 
            "description": "Harris County Judge Lina Hidalgo says it could take “weeks” for power to be restored in some parts of Houston following fierce storms with winds of up to 100 miles per hour. At least four people were killed after the storms Thursday swept through Harris Count…", 
            "title": "Houston weather: Some face weeks without power after storms, 4 killed - The Associated Press"
        }, 
        {
            "url": "https://www.theverge.com/24159022/microsoft-surface-ai-event-news-rumors-announcements", 
            "description": "Microsoft is bringing together Windows 11, AI, and Arm-based Snapdragon X Elite processors at its event on May 20th.", 
            "title": "Microsoft's Surface AI event: news, rumors, and lots of Qualcomm laptops - The Verge"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/dabney-coleman-dead-9-to-5-mary-hartman-tootsie-1235902521/", 
            "description": "The Texas native got laughs for his boorish behavior in 'Mary Hartman, Mary Hartman,' 'Tootsie,' 'Buffalo Bill' and much more.", 
            "title": "Dabney Coleman, ‘9 to 5’ Star Who Made a Career Out of Playing Jerks, Dies at 92 - Hollywood Reporter"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/17/entertainment/sean-combs-cassie-ventura/index.html", 
            "description": "A 2016 surveillance video obtained exclusively by CNN shows Sean “Diddy” Combs grab, shove, drag and kick his then-girlfriend Cassie Ventura during an altercation that matches allegations in a now-settled federal lawsuit filed by Ventura in November.", 
            "title": "Exclusive: Sean ‘Diddy’ Combs seen physically assaulting Cassie Ventura in 2016 surveillance video obtained by CNN - CNN"
        }, 
        {
            "url": "https://spacenews.com/helium-leak-further-delays-starliner-crewed-test-flight/", 
            "description": "NASA and Boeing have once again delayed first crewed flight of the company’s CST-100 Starliner as they work to resolve a helium leak in the spacecraft.", 
            "title": "Helium leak further delays Starliner crewed test flight - SpaceNews"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=U33S8ngaSuI", 
            "description": "Tiger Woods' near hole-in-one in Round 2 of the 2024 PGA Championship from Valhalla Golf Club.Subscribe now: https://bit.ly/PGAChampionshipYT Contested each ...", 
            "title": "Tiger Woods' Near HOLE-IN-ONE! | 2024 PGA Championship - PGA Championship"
        }, 
        {
            "url": "https://www.cbsnews.com/news/cold-case-murders-women-canada-linked-to-american-serial-rapist-gary-allen-srery/", 
            "description": "Police said Gary Allen Srery might also be linked to other unsolved murders and sexual assaults in Western Canada.", 
            "title": "Murders of 2 girls and 2 young women in Canada in the 1970s linked to American serial rapist - CBS News"
        }, 
        {
            "url": "https://www.washingtonpost.com/business/2024/05/17/dow-jones-average-40000/", 
            "description": "Among the biggest contributors to the widely watched index’s rally over the past year have been Microsoft and Goldman Sachs.", 
            "title": "Dow Jones Industrial Average closes above 40,000 for the first time - The Washington Post - The Washington Post"
        }, 
        {
            "url": "https://www.espn.com/mlb/story/_/id/40166583/pirates-paul-skenes-dominant-second-start-vs-cubs", 
            "description": "Paul Skenes struck out the first seven Cubs hitters he faced Friday, setting a record for a Pirates pitcher.", 
            "title": "Pirates' Paul Skenes holds Cubs hitless before exit after 6 - ESPN"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=qb2ONVgj-3Q", 
            "description": "Practicing Artemis Moonwalks in the desert, a developmental milestone for our lunar-roving robot, and previewing our new polar climate mission … a few of the...", 
            "title": "Practicing Artemis Moonwalks in the Desert on This Week @NASA – May 17, 2024 - NASA"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=G4-WBq3vnds", 
            "description": "AI has moved into a new era – from chatbots to AI agents capable of having instantaneous, real-time conversations as showcased by Microsoft-backed OpenAI’s G...", 
            "title": "Age of the AI agents: GPT-4o, Project Astra and an exclusive with Sundar Pichai - CNBC Television"
        }, 
        {
            "url": "https://variety.com/2024/film/news/yorgos-lanthimos-emma-stone-kinds-of-kindness-cannes-standing-ovation-1236007352/", 
            "description": "Yorgos Lanthimos’ ‘Kinds of Kindness,’ with Emma Stone and Jesse Plemons, earned a standing ovation at the 2024 Cannes Film Festival.", 
            "title": "Emma Stone’s Descent Into Sex Cults and Cannibalism in ‘Kinds of Kindness’ Lands 4.5-Minute Standing Ovation in Cannes - Variety"
        }, 
        {
            "url": "https://www.wtae.com/article/scottie-scheffler-detained-police-valhalla-louisville-pga/60823312", 
            "description": "Masters champion Scottie Scheffler was arrested Friday morning on his way to the PGA Championship.", 
            "title": "Scottie Scheffler arrested at PGA Championship for traffic violation - WTAE Pittsburgh"
        }, 
        {
            "url": "https://www.huffpost.com/entry/jennifer-lopez-ben-affleck-instagram-post-relationship-red-flags_n_664791fce4b0fad036eff5d3", 
            "description": "Until Thursday, J.Lo and husband, Ben Affleck, hadn't been photographed in public for 47 days.", 
            "title": "Rumors Fly After Jennifer Lopez Likes Post On Relationship Red Flags - HuffPost"
        }, 
        {
            "url": "https://www.reuters.com/world/us/supreme-court-justice-alitos-home-flew-us-flag-upside-down-following-jan-6-nyt-2024-05-17/", 
            "description": "An American flag was photographed hanging upside down at the Virginia home of Supreme Court Justice Samuel Alito in January 2021, weeks after the Jan. 6 protests, the New York Times reported on Thursday.", 
            "title": "Supreme Court Justice Alito's home flew US flag upside down following Jan. 6-NYT - Reuters"
        }
    ], 
    "last_updated": "2024-05-19 03:30:50"
}