{
    "news": [
        {
            "url": "https://apnews.com/article/israel-gaza-palestinians-court-ceasefire-01d093d21a1eadaa31af5708cf1cbf38", 
            "description": "The top United Nations court has ordered Israel to immediately halt its military offensive in the southern Gaza city of Rafah — but stopped short of ordering a full cease-fire. While Israel is unlikely to comply with Friday's order, it will ratchet up the pre…", 
            "title": "ICJ orders Israel to halt Gaza offensive; Israel unlikely to comply - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/24/health/new-experiments-milk-h5n1-infected-cows-raise-questions-flash-pasteurization/index.html", 
            "description": "New experiments confirm milk from H5N1-infected cows can make other animals sick — and raise questions about flash pasteurization", 
            "title": "New tests confirm milk from flu-infected cows can make other animals sick — and raise questions about flash pasteurization - CNN"
        }, 
        {
            "url": "https://variety.com/2024/film/obituaries-people-news/morgan-spurlock-dead-super-size-me-1236015338/", 
            "description": "Morgan Spurlock, a documentary filmmaker whose McDonald's takedown \"Super Size Me\" captured the zeitgeist and an Oscar nomination, has died of cancer.", 
            "title": "Morgan Spurlock, ‘Super Size Me’ Director, Dies at 53 - Variety"
        }, 
        {
            "url": "https://www.nbcnews.com/news/world/israeli-military-recovers-bodies-3-hostages-killed-oct-7-gaza-hamas-rcna153869", 
            "description": "TEL AVIV, Israel — The bodies of three more hostages who were killed in Hamas' Oct. 7 attacks were recovered from the Gaza Strip, the Israeli military said Friday, as the CIA chief headed to Europe in a bid to revive cease-fire talks and as the top United Nat…", 
            "title": "Israeli military recovers bodies of 3 more hostages from Gaza - NBC News"
        }, 
        {
            "url": "https://www.ksl.com/article/51022735/cdc-warns-of-multi-state-salmonella-outbreak-linked-to-backyard-poultry-including-utah", 
            "description": "The Centers for Disease Control and Prevention said on Thursday that public health officials are investigating multi-state outbreaks of salmonella linked to contact with backyard poultry.", 
            "title": "CDC warns of multi-state salmonella outbreak linked to backyard poultry, including Utah - KSL.com"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL3BhcHVhLW5ldy1ndWluZWEtbGFuZHNsaWRlLTg2ZmNmNDFlNjAwMTIyZmQ1NGRkY2ZiNTZiY2FiNDAz0gEA?oc=5", 
            "description": null, 
            "title": "More than 100 people believed killed by a landslide in Papua New Guinea, Australian media report - The Associated Press"
        }, 
        {
            "url": "https://www.cbssports.com/college-football/news/house-v-ncaa-settlement-winners-and-losers-athletes-take-monumental-step-non-revenue-sports-at-risk/", 
            "description": "Here are the winners and losers from the House v. NCAA settlement", 
            "title": "House v. NCAA settlement winners and losers: Athletes take monumental step, non-revenue sports at risk - CBS Sports"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://arstechnica.com/space/2024/05/daily-telescope-observing-a-distant-star-nursery-in-unprecedented-detail/", 
            "description": "\"Euclid’s instruments can detect objects just a few times the mass of Jupiter.\"", 
            "title": "Daily Telescope: Observing a distant star nursery in unprecedented detail - Ars Technica"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/24/politics/video/trump-bronx-black-hispanic-voters-ctm-sot-digvid", 
            "description": "Former President Donald Trump made a campaign stop in the Bronx Thursday in an effort to appeal to Black and Hispanic voters. David Levinthal, editor-in-chief of Raw Story, joins CNN’s Jessica Dean to discuss.", 
            "title": "There are two reasons why Trump held a rally in the Bronx, panelist says - CNN"
        }, 
        {
            "url": "https://www.businessinsider.com/russia-disrupting-elon-musk-starlink-satellite-service-ukraine-jamming-report-2024-5", 
            "description": "For the first time, the Russian military has caused widespread disruptions to Starlink in Ukraine, according to The New York Times.", 
            "title": "Russia has figured out how to mess up Ukraine's Starlink internet: NYT - Business Insider"
        }, 
        {
            "url": "https://finance.yahoo.com/video/nvidia-ceo-jensen-huang-were-110014107.html", 
            "description": "It's hard to find a company that has gained more from the AI boom than Nvidia (NVDA). In the first quarter, the company posted a 262% rise in revenue. Its...", 
            "title": "Nvidia CEO Jensen Huang: We're building AI factories - Yahoo Finance"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/23/asia/china-taiwan-drills-explainer-intl-hnk/index.html", 
            "description": "Tensions are once again ratcheting up in the Taiwan Strait, with China launching military drills encircling Taiwan just days after the democracy swore in a new leader long loathed by Beijing.", 
            "title": "China has launched new drills encircling Taiwan. Why now? - CNN"
        }, 
        {
            "url": "https://www.nbcnews.com/news/us-news/families-marines-died-osprey-crash-file-suit-boeing-makers-aircraft-rcna153792", 
            "description": "Families of Marines who died in a V-22 Osprey crash in California in June 2022 have filed a lawsuit accusing the makers of the twin-rotor aircraft of negligence.", 
            "title": "Families of Marines who died in an Osprey crash sue Bell Textron, Boeing and Rolls-Royce, makers of the aircraft - NBC News"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3Lm1hc3NsaXZlLmNvbS9jZWx0aWNzLzIwMjQvMDUvY2VsdGljcy1zdGFyLXRha2VzLXN1cnByaXNlLXNob3QtYXQtcGxheWVycy1hZnRlci1hbGwtbmJhLXNudWIuaHRtbNIBe2h0dHBzOi8vd3d3Lm1hc3NsaXZlLmNvbS9jZWx0aWNzLzIwMjQvMDUvY2VsdGljcy1zdGFyLXRha2VzLXN1cnByaXNlLXNob3QtYXQtcGxheWVycy1hZnRlci1hbGwtbmJhLXNudWIuaHRtbD9vdXRwdXRUeXBlPWFtcA?oc=5", 
            "description": null, 
            "title": "Celtics star takes surprise shot at players after All-NBA snub - MassLive.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/24/europe/carlo-acutis-first-catholic-millennial-saint-intl-scli/index.html", 
            "description": "Carlo Acutis, an Italian teenager and computer prodigy who earned the nickname “God’s influencer,” is set to become the Catholic Church’s first millennial saint.", 
            "title": "Italian teenager nicknamed ‘God’s influencer’ set to become Catholic Church’s first millennial saint - CNN"
        }, 
        {
            "url": "https://www.reuters.com/markets/us/nvidias-split-soaring-stock-could-boost-retail-investor-appeal-dow-chances-2024-05-23/", 
            "description": null, 
            "title": "Nvidia's split of soaring stock could boost retail investor appeal, Dow chances - Reuters"
        }
    ], 
    "last_updated": "2024-05-25 17:30:05"
}