{
    "news": [
        {
            "url": "https://www.tallahassee.com/story/news/2024/05/10/leon-county-under-tornado-warnings-as-severe-storms-sweep-across-area-tallahassee-weather/73638607007/", 
            "description": "Several tornado warnings have been issued this morning for Gadsden, Leon and Wakulla counties. Residents should take shelter and stay off roads.", 
            "title": "Tallahassee tornado: Storm damage reports roll in, 80K out of power - Tallahassee Democrat"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/10/business/sunspots-disrupt-phones-gps-scn/index.html", 
            "description": "Buckle up: An unusual amount of solar activity this week could disrupt some of the most important technologies society relies on.", 
            "title": "Why tonight’s massive solar storm could disrupt communications and GPS systems - CNN"
        }, 
        {
            "url": "https://apnews.com/article/apple-ipad-ad-social-media-reaction-12e7fbd335feb4875d94c31b87379359", 
            "description": "A newly released ad promoting Apple’s new iPad Pro has struck quite a nerve online. The ad shows a hydraulic press crushing just about every creative instrument artists and consumers have used over the years — from a piano and record player, to piles of paint…", 
            "title": "Technology crushing human creativity? Apple's new iPad ad has struck a nerve online - The Associated Press"
        }, 
        {
            "url": "https://www.foxbusiness.com/markets/mcdonalds-considering-5-meal-deal-lure-back-inflation-hit-consumers", 
            "description": "McDonald's is reportedly mulling a $5 meal deal in an effort to lure back inflation-plagued customers as sales at fast food restaurants dip due to consumers eating more meals at home.", 
            "title": "McDonald's considering $5 meal deal to lure back inflation-hit customers - Fox Business"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=mltGpTktWkM", 
            "description": "Tune-in to ESPN to watch the #NBAPlayoffs presented by Google Pixel7:00 PM ET: New York Knicks/Indiana Pacers9:30 PM ET: Denver Nuggets/Minnesota Timberwolve...", 
            "title": "New York Knicks @ Indiana Pacers Game 3 | #NBAPlayoffs presented by Google Pixel Live Scoreboard - NBA"
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-68992293", 
            "description": "The former US president's youngest child, 18, has \"prior commitments\", according to his mother.", 
            "title": "Trump's youngest son Barron 'declines' to be RNC delegate, his mother Melania says - BBC.com"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.cbssports.com/nba/news/suns-make-mike-budenholzer-their-next-head-coach-per-report-agrees-to-five-year-50-plus-million-pact/", 
            "description": "The Suns fired Frank Vogel after a single season", 
            "title": "Suns make Mike Budenholzer their next head coach, per report; Agrees to five-year $50-plus million pact - CBS Sports"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.ft.com/content/9b79b340-50e0-4813-8ed2-42a30e544e58", 
            "description": "Move marks latest effort by Biden administration to protect domestic industry from cheap competition", 
            "title": "US set to impose 100% tariff on Chinese electric vehicle imports - Financial Times"
        }, 
        {
            "url": "https://www.reuters.com/world/europe/bus-falls-into-river-russias-st-petersburg-2024-05-10/", 
            "description": null, 
            "title": "Seven killed as bus falls into river in Russia's St Petersburg - Reuters"
        }, 
        {
            "url": "https://www.nbcnews.com/health/health-news/covid-variant-kp2-summer-uptick-cdc-rcna150883", 
            "description": "The KP.2 variant now represents 28% of Covid infections in the U.S., up from just 6% in mid-April, according to data released Friday by the CDC.", 
            "title": "Experts predict mild summer Covid wave as new variant KP.2 takes over - NBC News"
        }, 
        {
            "url": "https://nypost.com/2024/05/10/world-news/israeli-war-cabinet-green-lights-military-push-into-rafah-over-bidens-objections-report/", 
            "description": "Israel’s war cabinet has approved expanding its Hamas battle plan to include Rafah, a move that could soon see Israel Defense Forces enter the densely populated city, which the Jewish state c…", 
            "title": "Israeli war cabinet green-lights military push into Rafah over Biden's objections: report - New York Post "
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-68984999", 
            "description": "State department says it is \"reasonable to assess\" that Israel used US-made weapons in ways inconsistent with its legal obligations.", 
            "title": "US says Israel may have breached international law with American weapons in Gaza - BBC.com"
        }, 
        {
            "url": "https://www.foxbusiness.com/technology/openai-announce-search-engine-rival-google-report", 
            "description": "OpenAI, which revolutionized the AI chatbot and launched an AI competition that includes big tech names such as Google, Microsoft and Apple, is launching a search engine.", 
            "title": "OpenAI to announce a search engine to rival Google: report - Fox Business"
        }, 
        {
            "url": "https://www.sfchronicle.com/politics/article/newsom-may-budget-19447474.php", 
            "description": "The deficit remains stubbornly high even after Gov. Gavin Newsom and lawmakers reduced the state budget deficit by about $17 billion in April.", 
            "title": "Gavin Newsom announces $27.6B California budget deficit - San Francisco Chronicle"
        }, 
        {
            "url": "https://gizmodo.com/boeing-starliner-nasa-valve-valvetech-spat-lawsuit-1851469705", 
            "description": "A scorned company has warned NASA of a \"disaster\" should it proceed with a second launch attempt of the crewed spacecraft.", 
            "title": "The Latest in Boeing's Starliner Fiasco Is a Feud Over That 'Buzzing' Valve - Gizmodo"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/10/us/college-campus-protests-encampments-cleared/index.html", 
            "description": "Pro-Palestinian encampments were cleared from at least three college campuses early Friday, marking some of the latest examples of schools using law enforcement to respond to demonstrations that have popped up across the country in recent weeks. Here are the …", 
            "title": "Encampments cleared from at least 3 university campuses early Friday as pro-Palestinian demonstrations continue - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/10/business/tesla-protests-berlin-factory-police/index.html", 
            "description": "As many as 800 activists gathered outside Tesla’s factory near Berlin Friday to protest its expansion plans, and some of them clashed with police as they attempted to break into the plant.", 
            "title": "Protesters attempt to storm Tesla’s factory in Germany - CNN"
        }, 
        {
            "url": "https://variety.com/2024/tv/news/sam-rubin-dead-ktla-entertainment-reporter-1235998979/", 
            "description": "Sam Rubin, a popular entertainment reporter on KTLA since 1991, died Friday, a source close to the station confirmed. He was 64.", 
            "title": "Sam Rubin, Longtime KTLA Entertainment Reporter, Dies at 64 - Variety"
        }
    ], 
    "last_updated": "2024-05-12 04:10:14"
}