{
    "news": [
        {
            "url": "https://finance.yahoo.com/news/biden-poised-impose-tariffs-china-004511416.html", 
            "description": "(Bloomberg) -- President Joe Biden’s administration is poised to unveil a sweeping decision on China tariffs as soon as next week, one that’s expected to...", 
            "title": "Biden Set to Impose Tariffs on China EVs, Strategic Sectors - Yahoo Finance"
        }, 
        {
            "url": "https://www.npr.org/2024/05/10/1249930674/california-restaurants-fees", 
            "description": "Service charges; resort fees; \"surcharge\" add-ons: A new state law requiring price transparency is set to take effect in July. Until now, no one knew how it would apply to restaurants.", 
            "title": "California says restaurants must bake all of their add-on fees into menu prices - NPR"
        }, 
        {
            "url": "https://www.axios.com/2024/05/09/israel-fire-palestinian-aid-refugee-jerusalem", 
            "description": null, 
            "title": "UN aid agency says Israelis set fire to its East Jerusalem headquarters - Axios"
        }, 
        {
            "url": "https://www.reuters.com/world/uk/uk-economy-grows-by-06-first-quarter-ons-data-shows-2024-05-10/", 
            "description": "Britain's economy grew by the most in nearly three years in the first quarter of 2024, ending the shallow recession it entered in the second half of last year and delivering a boost to Prime Minister Rishi Sunak ahead of an election.", 
            "title": "UK exits recession with fastest growth in nearly three years - Reuters UK"
        }, 
        {
            "url": "https://www.thecrimson.com/article/2024/5/10/protesters-reject-proposal-encampment/", 
            "description": "Members of the pro-Palestine encampment rejected a proposal from interim University President Alan M. Garber ’76 to end their two-week occupation of Harvard Yard and avoid receiving involuntary leave of absence notices.", 
            "title": "Pro-Palestine Students Reject Harvard President's Proposal to End Encampment | News - Harvard Crimson"
        }, 
        {
            "url": "https://www.bbc.com/news/world-middle-east-68980826", 
            "description": "Israeli leader says his country will \"stand alone\" and \"fight with fingernails\" if shipments are halted.", 
            "title": "Gaza war: Netanyahu says Israel can 'stand alone' if US halts arms shipments - BBC.com"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/09/us/shenandoah-county-confederate-school-names-reaj/index.html", 
            "description": "School board members in Virginia’s Shenandoah County voted early Friday to restore the names of two schools that previously honored Confederate leaders – four years after those names had been removed.", 
            "title": "Virginia school board votes to restore Confederate names to two schools - CNN"
        }, 
        {
            "url": "https://www.npr.org/2024/05/10/1250399425/senate-passes-faa-reauthorization-bill-sending-bill-to-house", 
            "description": "The Senate passed a bill designed to improve safety and customer service for air travelers, a day before the law governing the Federal Aviation Administration expires.", 
            "title": "Senate passes bill designed to improve air safety and service for travelers - NPR"
        }, 
        {
            "url": "https://sports.yahoo.com/nba-playoffs-luka-doncic-mavericks-fend-off-thunder-in-game-2-to-tie-series-041203241.html", 
            "description": "P.J. Washington dropped a playoff career-high 29 points to help the Mavericks pull off a huge win in Game 2 on Thursday night.", 
            "title": "NBA playoffs: Luka Dončić, Mavericks fend off Thunder in Game 2 to tie series - Yahoo Sports"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=wExNif-GGXo", 
            "description": "Jayson Tatum spoke postgame after the Celtics blowout loss to the Cavaliers in Game 2.Subscribe: https://www.youtube.com/user/BleacherReport?sub_confirmation...", 
            "title": "Jayson Tatum on Game 2 Loss to Cavs: 'The world thinks we're never supposed to lose' - Bleacher Report"
        }, 
        {
            "url": "https://apnews.com/article/police-shootings-home-roger-fortson-death-6e8db776663b684d878917e6b7ea4e57", 
            "description": "The fatal shooting of a U.S. Air Force airman at his off-base apartment by a Florida sheriff’s deputy brings to mind other instances of Black people being killed by law enforcement in their own homes as they’re going about their day. Senior Airman Roger Forts…", 
            "title": "Killing of an airman by Florida deputy is among cases of Black people being shot in their homes - The Associated Press"
        }, 
        {
            "url": "https://www.axios.com/2024/05/10/severe-solar-storm-northern-lights", 
            "description": null, 
            "title": "\"Severe\" solar storm could bring Northern Lights to U.S. this weekend - Axios"
        }, 
        {
            "url": "https://thehill.com/regulation/court-battles/4655381-stormy-daniels-trolls-trump-after-testifying-in-hush-money-trial/", 
            "description": null, 
            "title": "Stormy Daniels trolls Trump after testifying in hush money trial - The Hill"
        }, 
        {
            "url": "https://www.eonline.com/news/1401316/justin-biebers-exes-sofia-richie-and-caitlin-beadles-react-to-hailey-biebers-pregnancy", 
            "description": "Justin Bieber’s exes Sofia Richie and Caitlin Beadles—who he dated in 2016 and 2008, respectively—shared their reactions to Hailey Bieber's pregnancy.", 
            "title": "Justin Bieber's Exes Sofia Richie, Caitlin Beadles React to Pregnancy - E! NEWS"
        }, 
        {
            "url": "https://nypost.com/2024/05/09/business/chatgpt-maker-openai-to-unveil-google-search-competitor-on-monday-sources/", 
            "description": "OpenAI’s search product is an extension of its flagship ChatGPT product, and enables ChatGPT to pull in direct information from the Web and include citations.", 
            "title": "ChatGPT maker OpenAI to unveil Google search competitor on Monday: sources - New York Post "
        }, 
        {
            "url": "https://www.nbcnews.com/news/us-news/miss-usa-resignation-letter-toxic-work-culture-rcna151582", 
            "description": "The Miss USA who gave up her crown and title this week accused the pageant’s CEO of failing to take an incident of sexual harassment seriously and creating a toxic work environment, according to a copy of her resignation letter obtained Thursday by NBC News.", 
            "title": "Miss USA’s resignation letter accuses the organization of toxic work culture - NBC News"
        }, 
        {
            "url": "https://9to5mac.com/2024/05/09/m4-ipad-pro-always-on-display-oled/", 
            "description": "One of the biggest highlights of the new iPad Pro is the OLED display for the first time on an...", 
            "title": "M4 iPad Pro lacks always-on display despite OLED panel with variable refresh rate - 9to5Mac"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/09/health/bird-flu-cows-human-receptors/index.html", 
            "description": "Cows have the same kinds of gateways into their cells as humans and birds, a new study shows. The finding suggests that cows could be mixing bowls - hosts that could help H5N1 bird flu learn to spread in humans.", 
            "title": "Cows have human flu receptors, study shows, raising stakes on bird flu outbreak in dairy cattle - CNN"
        }, 
        {
            "url": "https://www.nbcnews.com/politics/donald-trump/missed-day-14-trumps-hush-money-trial-manhattan-rcna151563", 
            "description": "Judge Juan Merchan issued two rulings against Trump involving the gag order and a mistrial motion after the court heard from Daniels and three other witnesses.", 
            "title": "What you missed on Day 14 of Trump's hush money trial in Manhattan - NBC News"
        }
    ], 
    "last_updated": "2024-05-11 15:09:10"
}