{
    "news": [
        {
            "url": "https://www.bbc.com/news/articles/cxxxp1w6e2ro", 
            "description": "Powerful storms devastate areas in Texas, Arkansas and Oklahoma and leave hundreds of thousands without power.", 
            "title": "Tornadoes rip through Texas, Arkansas and Oklahoma, killing 14 - BBC.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/26/sport/indy-500-spt-intl/index.html", 
            "description": "The Indy 500, one of the most prestigious and highly-anticipated events of the motorsport calendar, is set to begin Sunday afternoon after extreme weather marred the race’s buildup.", 
            "title": "Indy 500: Iconic motorsport race set to begin after extreme weather delays - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/26/politics/video/donald-trump-libertarian-convention-booed-heckled-contorno-ctmwknd-vpx", 
            "description": "Former President Donald Trump was loudly and consistently booed throughout his speech to the Libertarian convention, particularly when he asked attendees to “nominate me or at least vote for me.” CNN’s Steve Contorno reports.", 
            "title": "Watch Trump react to getting booed at Libertarian convention - CNN"
        }, 
        {
            "url": "https://www.cbsnews.com/boston/news/amc-theater-massachusetts-stabbing-braintree/", 
            "description": "A man stabbed four girls inside a theater at an AMC multiplex in Braintree, Massachusetts, police said.", 
            "title": "4 girls hurt during unprovoked stabbing attack in AMC movie theater near Boston; suspect arrested - CBS Boston"
        }, 
        {
            "url": "https://sports.yahoo.com/grayson-murray-two-time-pga-tour-winner-dies-by-suicide-at-age-30-191304558.html", 
            "description": "Grayson Murray won two PGA tournaments, including the Sony Hawaii Open this past January.", 
            "title": "Grayson Murray, two-time PGA Tour winner, dies by suicide at age 30 - Yahoo Sports"
        }, 
        {
            "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-26-2024-eb25eb70d2c7b9e6bcd0497060eccbca", 
            "description": "Palestinian medics say an Israeli airstrike has killed at least 22 people when it hit tents for displaced people in the southern Gaza city of Rafah. They say “numerous” others are trapped in the debris. The strike Sunday came two days after the International …", 
            "title": "Palestinian medics say Israeli airstrike kills 22 in Gaza's Rafah as displaced people are hit - The Associated Press"
        }, 
        {
            "url": "https://variety.com/2024/film/global/jesse-eisenberg-polish-citizenship-a-real-pain-1236016839/", 
            "description": "'Social Network’ star Jesse Eisenberg applies for Polish citizenship after shooting ‘A Real Pain’ in Poland", 
            "title": "Jesse Eisenberg Applies for Polish Citizenship: ‘I Would Love to Create Better Relationships Between Jews and Polish People’ - Variety"
        }, 
        {
            "url": "https://ew.com/nicki-minaj-arrested-amsterdam-airport-alleged-drug-possession-8654055", 
            "description": "Nicki Minaj recorded Dutch police officers arresting her for alleged drug possession at an Amsterdam airport.", 
            "title": "Nicki Minaj arrested at Amsterdam airport for alleged drug possession - Entertainment Weekly News"
        }, 
        {
            "url": "https://apnews.com/article/paris-avenue-giant-picnic-82b6afa486a40a50d777f762c427f995", 
            "description": "The French capital’s most famous street has been transformed into a massive picnic blanket. Around 4,000 people sat in the sun on Sunday enjoying an al fresco meal on the Champs-Elysees Avenue. The lucky picnickers were selected in a draw and provided with fr…", 
            "title": "Paris' traffic-clogged Champs-Elysees turned into a mass picnic blanket for an unusual meal - The Associated Press"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.motorsport.com/f1/news/leclerc-struggled-to-see-through-tears-on-way-to-monaco-gp-win/10616202/", 
            "description": null, 
            "title": "Leclerc struggled to see through tears on way to Monaco GP win - Motorsport.com"
        }, 
        {
            "url": "https://www.cbsnews.com/news/turbulence-hits-qatar-airways-flight-to-dublin-injuring-12-people/", 
            "description": "The flight QR107, which landed in Dublin just before 1 p.m. local time, experienced turbulence while airborne over Turkey, Dublin Airport officials said in a statement.", 
            "title": "Turbulence hits Qatar Airways flight to Dublin, injuring 12 people - CBS News"
        }, 
        {
            "url": "http://9to5google.com/2024/05/26/google-search-ai-overviews-helpful/", 
            "description": "Google Search has AI now, but it's not helpful in its current form. That said, Google already knows how to make it helpful.", 
            "title": "Google Search AI can be helpful, just not with Overviews - 9to5Google"
        }, 
        {
            "url": "https://thehill.com/homenews/house/4686828-pennsylvania-democrat-madeleine-dean-samuel-alito-flag-controversy-wife/", 
            "description": "Rep. Madeleine Dean (D-Pa.) in a Sunday interview blasted Supreme Court Justice Samuel Alito for blaming his wife for displaying the upside-down flag outside his home in the days following the Jan. 6, 2021, attack on the Capitol. In an interview on NewsNation…", 
            "title": "Pennsylvania Democrat blasts Alito for blaming flag controversy on his wife - The Hill"
        }, 
        {
            "url": "https://www.wlwt.com/article/cincinnati-severe-weather-sunday-tornadoes-forecast/60906366", 
            "description": "A WLWT Weather Alert Day is in place due to severe storms that could produce tornadoes, damaging wind and hail.", 
            "title": "Severe weather threat brings chance for hail, strong winds, tornadoes - WLWT Cincinnati"
        }, 
        {
            "url": "https://www.autosport.com/f1/news/hulkenberg-stupid-f1-monaco-crash-unnecessary-from-perez-and-magnussen/10616053/", 
            "description": "Haas Formula 1 driver Nico Hulkenberg says the Monaco Grand Prix start accident that he fell victim to was \"stupid\" and \"unnecessary from both\" Sergio Perez and team-mate Kevin Magnussen.", 
            "title": "Hulkenberg: \"Stupid\" F1 Monaco crash unnecessary from Perez and Magnussen - Autosport"
        }, 
        {
            "url": "https://www.thestreet.com/investing/stocks/veteran-fund-manager-reboots-nvidia-stock-price-target-after-earning", 
            "description": "Here's what could happen next to Nvidia shares.", 
            "title": "Veteran fund manager revises Nvidia stock price target after earnings - TheStreet"
        }, 
        {
            "url": "https://www.yahoo.com/lifestyle/walmarts-secret-sale-room-is-bursting-with-memorial-day-deals--score-1600-off-a-samsung-tv-yes-really-and-more-135234649.html", 
            "description": "Also spotted for the holiday weekend: Ridiculously low prices on a Dyson vac, HP laptop and Michael Kors crossbody bag.", 
            "title": "Walmart's secret sale room is bursting with Memorial Day deals — score $1,600 off a Samsung TV (yes, really!) and more - Yahoo Life"
        }, 
        {
            "url": "https://phys.org/news/2024-05-tess-intriguing-world-sized-earth.html", 
            "description": "Using observations by NASA's TESS (Transiting Exoplanet Survey Satellite) and many other facilities, two international teams of astronomers have discovered a planet between the sizes of Earth and Venus only 40 light-years away. Multiple factors make it a cand…", 
            "title": "TESS finds intriguing world sized between Earth and Venus - Phys.org"
        }, 
        {
            "url": "https://www.nj.com/weather/2024/05/nj-weather-rain-and-thunderstorms-expected-for-memorial-day.html", 
            "description": "Forecasters are calling for two rounds of rainy weather for the holiday, with thunderstorms possible.", 
            "title": "N.J. weather: Rain and thunderstorms expected for Memorial Day - NJ.com"
        }
    ], 
    "last_updated": "2024-05-27 22:08:11"
}