{
    "news": [
        {
            "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/terrion-arnold-raiders-told-me-it-was-a-coin-flip-between-me-and-brock-bowers-at-no-13", 
            "description": "Lions first-round draft pick Terrion Arnold says he could have been a Raider, if the flip of a coin had gone the other way.", 
            "title": "Terrion Arnold: Raiders told me it was a coin flip between me and Brock Bowers at No. 13 - NBC Sports"
        }, 
        {
            "url": "https://apnews.com/article/antisemitism-congress-public-schools-gaza-acf92208a9ea0ef4878c6ba993ed1d83", 
            "description": "Leaders of three large public school systems strongly denied allegations that they let antisemitism run rampant. They told a congressional panel Wednesday that they’re fighting it with education and, when necessary, discipline. As part of a series of hearings…", 
            "title": "K-12 school leaders reject allegations that they let antisemitism run rampant - The Associated Press"
        }, 
        {
            "url": "https://www.nbcnews.com/news/weather/major-storms-continue-country-devastating-overnight-tornadoes-michigan-rcna151217", 
            "description": "Damaging winds, large hail and possible tornadoes continue to threaten parts the country from Texas to the mid-Atlantic through Thursday.", 
            "title": "Major storms continue across the country following devastating overnight tornadoes in Michigan - NBC News"
        }, 
        {
            "url": "https://www.nbcnews.com/science/space/astronomers-detect-rocky-planet-atmosphere-rcna151315", 
            "description": "Astronomers have long searched for rocky planets beyond our solar system with an atmosphere — a trait considered essential for any possibility of harboring life.", 
            "title": "Astronomers finally detect a rocky planet with an atmosphere - NBC News"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=xHgXyW72JkE", 
            "description": "“It just seems very hypocritical and seems very self-serving for Prince Harry.”Prince Harry is still attempting to find his place in the UK as him and Meghan...", 
            "title": "‘Deluded’ Prince Harry snubbed by King amid tug of war with Meghan | Kinsey Schofield - Times Radio"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/08/applebees-owner-dine-brands-targets-fast-food-customers.html", 
            "description": "Low-income consumers visited less frequently and spent more carefully when they did eat out in the first quarter, Dine Brands CEO John Peyton said.", 
            "title": "Applebee's owner Dine Brands wants to steal fast-food customers with its deals - CNBC"
        }, 
        {
            "url": "https://nypost.com/2024/05/08/sports/nikki-glaser-hopes-gisele-bundchen-forgives-her-for-tom-brady-roast/", 
            "description": "Comedian Nikki Glaser has reacted to the news that Gisele Bündchen was not happy about all the jokes about her during Tom Brady’s roast.", 
            "title": "Nikki Glaser hopes Gisele Bündchen forgives her for Tom Brady roast - New York Post "
        }, 
        {
            "url": "https://finance.yahoo.com/news/apples-ipad-event-was-an-ai-teaser-for-its-future-184058075.html", 
            "description": "Apple's latest M4 chip is bringing more AI capabilities, providing a look into the company's upcoming WWDC conference.", 
            "title": "Apple's iPad event was an AI teaser for its future - Yahoo Finance"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/08/us/george-washington-university-protesters-arrested/index.html", 
            "description": "The Metropolitan Police Department in Washington, DC, cleared out a pro-Palestinian encampment on George Washington University’s campus early Wednesday and arrested 30 protesters there and three others in a separate altercation, Metro Police Chief Pamela A. S…", 
            "title": "House hearing on George Washington University protest canceled after police clear out encampment and arrest over 30 - CNN"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/8/24151342/google-pixel-8a-lego-icons-tiny-plants-deal-sale", 
            "description": "Amazon and other retailers are already offering Google’s next midrange phone with a $100 gift card. You can also save on the Beats Studio Buds and Lego’s Tiny Plants set.", 
            "title": "You can get a $100 gift card when you preorder Google's Pixel 8A - The Verge"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/08/california-court-tax-initiative-00156834", 
            "description": null, 
            "title": "California Supreme Court appears split on blocking tax initiative - POLITICO"
        }, 
        {
            "url": "https://www.npr.org/2024/05/08/1249961060/swiss-army-knife-victorinox-bladeless", 
            "description": "Some governments have been cracking down on the knives people can carry in public as crime has increased. Victorinox said any bladeless offerings wouldn't replace its selection of Swiss Army Knives.", 
            "title": "Swiss Army Knife maker will offer bladeless products amid a rise in violence - NPR"
        }, 
        {
            "url": "https://nypost.com/2024/05/08/business/ftx-has-raked-in-billions-more-than-needed-to-pay-bankruptcy-victims-back/", 
            "description": "Fallen cryptocurrency exchange FTX has raked in billions of dollars more than it needs to fully pay back customers who lost funds in its November 2022 collapse. In a rare twist versus typical US ba…", 
            "title": "Failed crypto giant FTX has recovered billions more than it needs to pay back bankruptcy victims - New York Post "
        }, 
        {
            "url": "https://www.cnn.com/2024/05/08/us/pro-palestinian-protests-arrests-colleges-dg/index.html", 
            "description": "Pro-Palestinian protesters continue to be arrested on college campuses. Explore the timeline of where protests erupted and who police have arrested on these campuses.", 
            "title": "How pro-Palestinian protest arrests have unfolded across college campuses - CNN"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.wsj.com/world/middle-east/israel-says-it-has-reopened-a-gaza-border-crossing-as-fuel-supplies-dwindle-719f5810", 
            "description": null, 
            "title": "Israel Presses On in Rafah Amid Diplomatic Tensions and Deepening Humanitarian Crisis - The Wall Street Journal"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/08/world/boeing-starliner-new-launch-date-scn/index.html", 
            "description": "Engineers are replacing a valve on the rocket that will power the first crewed test flight of Boeing’s Starliner spacecraft. The launch is now expected no sooner than May 17.", 
            "title": "Boeing’s historic Starliner mission now expected to launch no sooner than May 17 after valve issue - CNN"
        }, 
        {
            "url": "https://www.reuters.com/world/middle-east/boeing-cargo-plane-lands-istanbul-without-front-landing-gear-no-casualties-2024-05-08/", 
            "description": null, 
            "title": "Probe launched after Boeing cargo plane lands in Istanbul without front landing gear - Reuters"
        }, 
        {
            "url": "https://abcnews.go.com/Lifestyle/wireStory/dogs-entering-us-6-months-microchipped-prevent-spread-110027684", 
            "description": "New U.S. rules require all dogs coming into the U.S. to be at least 6 months old and microchipped to help prevent the spread of rabies", 
            "title": "Dogs entering US must be 6 months old and microchipped to prevent spread of rabies, new rules say - ABC News"
        }, 
        {
            "url": "https://apnews.com/article/serbia-china-xi-jinping-visit-nato-e37b7ad0e89ac73b83e754142ce8e399", 
            "description": "China and European Union candidate Serbia have signed an agreement to build a “shared future” between the two states, making the Balkan country the first in Europe to agree on such a document with Beijing. After meeting in Belgrade on Wednesday, Chinese leade…", 
            "title": "China and EU-candidate Serbia sign an agreement to build a 'shared future' - The Associated Press"
        }
    ], 
    "last_updated": "2024-05-09 23:08:42"
}