{
    "news": [
        {
            "url": "https://www.cnn.com/2024/05/24/us/american-missionary-couple-haiti/index.html", 
            "description": "Three missionaries, including a married couple from the US, were killed in Haiti’s capital, Port-au-Prince, on Thursday evening.", 
            "title": "Three missionaries, including American couple, killed by gang in Haiti - CNN"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=u8U9PzmqR8g", 
            "description": "Join Bobby Karalla as he gets you ready for Game 2 of the Western Conference Finals between the Dallas Mavericks and Minnesota Timberwolves.Join Club Maveric...", 
            "title": "Mavs/Wolves Game 2 Pregame LIVE! - Dallas Mavericks"
        }, 
        {
            "url": "https://pagesix.com/2024/05/24/photos/millie-bobby-brown-and-jake-bongiovi-flaunt-wedding-rings-after-secretly-tying-the-knot/", 
            "description": "According to photos, the “Stranger Things” star and her new beau were all smiles as they were in a baby blue convertible after doing some shopping.", 
            "title": "Millie Bobby Brown and Jake Bongiovi flaunt wedding rings on Hamptons shopping spree after secretly tying the knot - Page Six"
        }, 
        {
            "url": "https://www.reuters.com/world/world-court-rule-request-halt-israels-rafah-offensive-2024-05-24/", 
            "description": null, 
            "title": "World Court orders Israel to halt assault on Gaza's Rafah - Reuters"
        }, 
        {
            "url": "https://www.foxnews.com/health/undercooked-bear-meat-blame-infecting-family-rare-roundworm-parasite-cdc", 
            "description": "A family was infected with a rare parasite after eating undercooked black bear meat that was harvested in Canada, the U.S. Centers for Disease Control and Prevention said.", 
            "title": "Undercooked bear meat to blame for infecting family with rare roundworm parasite: CDC - Fox News"
        }, 
        {
            "url": "https://www.nbcnews.com/news/us-news/alec-baldwin-involuntary-manslaughter-continue-rcna152672", 
            "description": "Alec Baldwin is set to stand trial on a charge of involuntary manslaughter in the 2021 killing of “Rust” cinematographer Halyna Hutchins after a New Mexico judge denied the actor’s bid to dismiss the case Friday.", 
            "title": "Alec Baldwin's involuntary manslaughter case in 'Rust' shooting to continue - NBC News"
        }, 
        {
            "url": "https://www.washingtonpost.com/nation/2024/05/24/uvalde-lawsuits-daniel-defense-meta-activision/", 
            "description": "The attorney representing Uvalde families announced several new lawsuits aimed at Meta, the manufacturer of video game “Call of Duty” and gunmaker Daniel Defense.", 
            "title": "Uvalde families sue gun manufacturer Facebook parent company - The Washington Post"
        }, 
        {
            "url": "https://arstechnica.com/security/2024/05/newly-discovered-ransomware-uses-bitlocker-to-encrypt-victim-data/", 
            "description": "ShrinkLocker is the latest ransomware to use Windows' full-disk encryption.", 
            "title": "Newly discovered ransomware uses BitLocker to encrypt victim data - Ars Technica"
        }, 
        {
            "url": "https://www.npr.org/2024/05/24/nx-s1-4978680/house-ncaa-settlement-pay-college-athletes", 
            "description": "The proposed legal settlement by the NCAA and its Power Five conferences would allow schools to directly pay athletes. But questions remain, including whether men and women will be paid equally.", 
            "title": "What we know and what we don't about a historic settlement to pay college athletes - NPR"
        }, 
        {
            "url": "https://www.nbcnews.com/tech/tech-news/google-ai-im-feeling-depressed-cheese-not-sticking-to-pizza-error-rcna153301", 
            "description": "Google's AI overview is facing online mockery after several of its answers, and some fake ones, have gone viral on social media.", 
            "title": "Google’s AI faces social media mockery after viral errors - NBC News"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/24/biden-trump-trial-verdict-00159981", 
            "description": null, 
            "title": "Biden has stayed silent on Trump's trial. The verdict will change that. - POLITICO"
        }, 
        {
            "url": "https://abcnews.go.com/Health/cdc-preparing-possibility-increased-risk-human-health-bird/story?id=110542040", 
            "description": "The CDC says the current risk to the general population is low.", 
            "title": "CDC preparing for 'possibility of increased risk to human health' from bird flu - ABC News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/24/health/dairy-cow-meat-bird-flu/index.html", 
            "description": "Meat from a dairy cow that was culled from its herd and sent to slaughter has tested positive for traces of the H5N1 bird flu virus, the US Department of Agriculture announced Friday, but no meat from the cow entered the food supply.", 
            "title": "Meat from condemned dairy cow tested positive for H5N1 flu virus but did not enter food supply, USDA says - CNN"
        }, 
        {
            "url": "https://thehill.com/policy/healthcare/4684914-colon-cancer-early-signs-young-adults-diagnosis-delayed/", 
            "description": "Experts are warning that more and more people younger than 40 years are being diagnosed with colon cancer, saying they could be missing the early signs. A study released Friday in the medical journal JAMA Network Open said the most common warning sign for the…", 
            "title": "Why younger adults are missing early signs of colon cancer - The Hill"
        }, 
        {
            "url": "https://www.yahoo.com/lifestyle/the-best-memorial-day-deals-over-50-off--save-hundreds-at-target-wayfair-macys-and-more-200645165.html", 
            "description": "Adidas, All-Clad, Coach, Staub: Get deep discounts on sneakers, kitchen gear, luggage, patio furniture and tech from all your favorite retailers.", 
            "title": "The best Memorial Day deals over 50% off — save hundreds at Target, Wayfair, Macy's and more - Yahoo Life"
        }, 
        {
            "url": "https://apnews.com/article/alito-flag-supreme-court-roberts-justice-senate-104ded51a089642a7a449b3d3234a3e6", 
            "description": "Two Democratic senators are requesting a meeting with Chief Justice John Roberts after reports that two separate flags carried by rioters at the Jan. 6, 2021, attack on the Capitol had flown outside of houses owned by Justice Samuel Alito. Senate Judiciary Ch…", 
            "title": "Democratic senators request meeting with Chief Justice Roberts over flags flown at Alito's homes - The Associated Press"
        }, 
        {
            "url": "https://www.space.com/boeing-starliner-launch-date-helium-leak", 
            "description": "\"We really just needed to work through it as a team.\"", 
            "title": "'It's so complicated:' Boeing Starliner teams diagnosing helium leak ahead of June 1 astronaut launch - Space.com"
        }, 
        {
            "url": "https://www.reuters.com/world/uk/more-uk-conservative-lawmakers-set-quit-than-before-1997-election-defeat-2024-05-24/", 
            "description": "British Prime Minister Rishi Sunak is facing a mass departure of lawmakers with the number of resignations surpassing the level the Conservative Party suffered before a landslide defeat in the 1997 election.", 
            "title": "More UK Conservative lawmakers set to quit than before 1997 election defeat - Reuters UK"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/24/uaw-mercedes-benz-challenge.html", 
            "description": "The UAW alleges Mercedes-Benz fired pro-union workers, forced workers to attend anti-union meetings, and interfered with workers' ability to advocate.", 
            "title": "UAW challenges Mercedes-Benz union vote, asks NLRB for new election - CNBC"
        }, 
        {
            "url": "https://apnews.com/article/israel-palestinians-hostages-16eb31044551df186a934dc66e3948aa", 
            "description": "Egypt says it has agreed to send U.N. humanitarian aid trucks through Israel’s main crossing into Gaza. But it remains unclear if the aid will be able to enter the territory as fighting raged in the southern city of Rafah amid Israel’s escalating offensive th…", 
            "title": "Israeli army finds bodies of 3 more hostages in Gaza - The Associated Press"
        }
    ], 
    "last_updated": "2024-05-26 03:30:50"
}