{
    "news": [
        {
            "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-louisiana-use-congressional-map-second-majority-b-rcna151955", 
            "description": "The Supreme Court paved the way for Louisiana to use a congressional map in this year's election that includes two majority-Black districts.", 
            "title": "Supreme Court allows Louisiana to use congressional map with second majority-Black district - NBC News"
        }, 
        {
            "url": "https://www.cbssports.com/golf/news/2024-pga-championship-odds-picks-field-predictions-golf-insider-backing-brooks-koepka-at-valhalla/", 
            "description": "Sia Nejad reveals his PGA Championship 2024 picks, props and sleepers for Valhalla Golf Club following Rory McIlroy's win at the Wells Fargo Championship", 
            "title": "2024 PGA Championship odds, picks, field, predictions: Golf insider backing Brooks Koepka at Valhalla - CBS Sports"
        }, 
        {
            "url": "https://www.eonline.com/news/1401646/sophie-turner-breaks-silence-on-shocking-aftermath-of-joe-jonas-divorce", 
            "description": "Eight months after Sophie Turner and Joe Jonas' breakup, the Game of Thrones alum detailed the \"shocking\" aftermath that played out online and how Taylor Swift provided her a \"safe space.\"", 
            "title": "Sophie Turner Breaks Silence on \"Shocking\" Aftermath of Joe Jonas Divorce - E! Online - E! NEWS"
        }, 
        {
            "url": "https://www.kcci.com/article/caitlin-clarks-wnba-debut-dwarfs-betting-on-last-years-clinching-game-in-the-finals/60804700", 
            "description": "Caitlin Clark's much-anticipated WNBA debut﻿ produced record betting, far larger than the amount of money wagered on last year's clinching game for the league championship.", 
            "title": "Big money bet on Caitlin Clark's WNBA debut - KCCI Des Moines"
        }, 
        {
            "url": "https://www.thestreet.com/investing/stocks/fed-gets-inflation-relief-as-cpi-slows-teeing-up-september-rate-cut", 
            "description": "Stocks got a big boost from a softer-than-expected April inflation report, which showed slowing price pressures across the board.", 
            "title": "CPI inflation report resets timing of Fed interest rate cuts - TheStreet"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cqene5z41y0o", 
            "description": "The PM is known for his ability to reinvent his political career in the face of major setbacks.", 
            "title": "How Robert Fico used Covid and Ukraine to gain power in Slovakia - BBC.com"
        }, 
        {
            "url": "https://www.clickorlando.com/news/local/2024/05/14/heres-what-we-know-about-the-driver-arrested-in-deadly-bus-crash-that-killed-8-farmworkers/", 
            "description": "Officials on Tuesday announced that Bryan Maclean Howard was arrested in connection to the fatal wreck that killed eight people and injured about 40 others Tuesday morning in Marion County.", 
            "title": "Here's what we know about the driver arrested in Marion bus crash that killed 8 farmworkers - WKMG News 6 & ClickOrlando"
        }, 
        {
            "url": "https://abcnews.go.com/US/wireStory/barge-hits-bridge-galveston-texas-damaging-structure-causing-110268879", 
            "description": "Officials say a barge has hit a bridge in Galveston, Texas, spilling oil into surrounding waters and closing the only road connecting the city to Pelican Island", 
            "title": "Barge hits bridge connecting Galveston and Pelican Island, causing partial collapse and oil spill - ABC News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/15/economy/consumer-price-index-inflation-april/index.html", 
            "description": "Markets surged to record highs Wednesday after new data showed that inflation cooled in April after ticking up recently.", 
            "title": "S&P 500, Nasdaq and Dow all hit record highs after encouraging inflation data - CNN"
        }, 
        {
            "url": "http://deadline.com/2024/05/furiosa-reactions-world-premiere-ovation-cannes-1235916996/", 
            "description": "George Miller’s Furiosa: A Mad Max Saga, the latest in his apocalyptic franchise, had its world premiere at the Cannes Film Festival on May 15.", 
            "title": "‘Furiosa’ Gets Nearly 8-Minute Standing Ovation After Its Cannes World Premiere - Deadline"
        }, 
        {
            "url": "https://www.reuters.com/world/asia-pacific/new-caledonia-riots-rage-after-paris-approves-voting-change-2024-05-15/", 
            "description": null, 
            "title": "Four dead in New Caledonia riots, France declares state of emergency - Reuters"
        }, 
        {
            "url": "https://www.washingtonpost.com/world/2024/05/15/blinken-announces-2-billion-aid-package-ukraine-russians-advance/", 
            "description": "But the Biden administration remains opposed to allowing Ukraine to strike targets inside Russian territory with U.S. weaponry — something Ukrainian policymakers have been pushing for.", 
            "title": "Blinken announces $2 billion aid package for Ukraine as Russians advance - The Washington Post"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://sports.yahoo.com/live/2024-nfl-schedule-release-live-updates-ahead-of-tonights-full-announcement-222736022.html", 
            "description": "Before Wednesday arrives, football fans got some appetizers as some games were formally announced.", 
            "title": "2024 NFL schedule release: Live updates ahead of tonight's full announcement - Yahoo Sports"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/15/us/baltimore-bridge-collapse-house-hearing/index.html", 
            "description": "The cargo ship Dali experienced two blackouts while moored in the Port of Baltimore a day before its catastrophic collision with the Francis Scott Key Bridge, and efforts to resolve those blackouts may have impacted the ship’s operations, the head of the Nati…", 
            "title": "Cargo ship outages on the day before the Baltimore bridge collision may have impacted ship’s operations, NTSB chief says - CNN"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/15/china-biden-ev-tariffs-may-not-be-enough-to-stave-off-growing-threat.html", 
            "description": "Automotive and trade experts say the increased tariffs are a near-term protectionism act that may delay, but won't stop, Chinese EVs from coming to the U.S.", 
            "title": "Biden's EV tariffs may not be enough to stave off the threat of Chinese vehicles in the U.S. - CNBC"
        }, 
        {
            "url": "https://www.bbc.com/news/science-environment-69012221", 
            "description": "The iconic trees evolved on Madagascar 21 million years ago and later spread to other countries.", 
            "title": "Scientists solve mystery of ancient 'tree of life' - BBC.com"
        }, 
        {
            "url": "https://www.nbcnews.com/news/world/massive-us-dock-deliver-food-humanitarian-aid-will-reach-gaza-tonight-rcna147623", 
            "description": "The U.S. has begun towing a floating dock system for delivering humanitarian aid toward Gaza and expects the system to be installed in the next 24 hours.", 
            "title": "A massive U.S. dock to deliver food and other humanitarian aid will reach Gaza tonight - NBC News"
        }, 
        {
            "url": "https://www.reuters.com/world/europe/dozens-countries-signing-up-ukraine-peace-summit-switzerland-says-2024-05-15/", 
            "description": null, 
            "title": "Dozens of countries signing up for Ukraine peace summit, Switzerland says - Reuters.com"
        }
    ], 
    "last_updated": "2024-05-17 02:00:42"
}