{
    "news": [
        {
            "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI0LzA1LzI5L2lzcmFlbC1oYW1hcy13YXItbmV3cy1nYXphLXBhbGVzdGluZS1yYWZhaC_SAQA?oc=5", 
            "description": null, 
            "title": "Aid group suspends main Rafah kitchen over 'ongoing attacks' - The Washington Post"
        }, 
        {
            "url": "https://www.washingtonpost.com/dc-md-va/2024/05/29/dc-new-giant-pandas-national-zoo-china/", 
            "description": "D.C.’s National Zoo said China has agreed to lease it two new pandas — Bao Li, 2, a male, and Qing Bao, 2, a female. They are set to arrive later this year.", 
            "title": "Giant pandas are returning to D.C.'s National Zoo. Meet Bao Li and Qing Bao. - The Washington Post"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/29/5-things-to-know-before-the-stock-market-opens-wednesday-may-29.html", 
            "description": "Here are the most important news items that investors need to start their trading day.", 
            "title": "5 things to know before the stock market opens Wednesday - CNBC"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c166xxd4y36o", 
            "description": "Several parts of northern and central India have recorded soaring temperatures this summer.", 
            "title": "Summer 2024: Temperatures cross 50C in northern India - BBC.com"
        }, 
        {
            "url": "https://finance.yahoo.com/news/conocophillips-acquire-marathon-oil-22-110225775.html", 
            "description": null, 
            "title": "ConocoPhillips to Acquire Marathon Oil in $17 Billion Deal - Yahoo Finance"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-deliberations-jury-judge-verdict-390f045e9e8a37f069e82576edd7a842", 
            "description": "Jurors in Donald Trump’s New York hush money trial are expected to begin deliberations after receiving instructions from the judge on the law and the factors they may consider as they strive to reach a verdict in the first criminal case against a former Ameri…", 
            "title": "Trump hush money trial: Jury begin deliberations after marathon closing arguments - The Associated Press"
        }, 
        {
            "url": "https://www.startribune.com/anthony-edwards-karl-anthony-towns-western-conference-finals-charles-barkley-snowy-minnesota/600369322/", 
            "description": "The Timberwolves kept the playoffs alive in large measure because the players expected to carry them came through — and Mavericks superstar Luka Doncic said that he didn't", 
            "title": "Ten clutch points: Timberwolves stars deliver, Luca Doncic doesn't, Charles Barkley has the weather - Star Tribune"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/29/dicks-sporting-goods-dks-earnings-q1-2024.html", 
            "description": "Dick's Sporting Goods saw sales grow well ahead of estimates, following behind other retailers that said consumers are spending on new clothes and shoes.", 
            "title": "Dick's Sporting Goods raises guidance, says shoppers are spending more on sneakers and athletic gear - CNBC"
        }, 
        {
            "url": "https://www.washingtonpost.com/health/2024/05/29/peanut-allergy-baby-infants/", 
            "description": "An author of the study said the correlation was “extraordinary.” She advised parents that “plain old peanut butter mixed in warm water can work for a 4-month-old.”", 
            "title": "Babies exposed to peanuts less likely to be allergic years later, study says - The Washington Post"
        }, 
        {
            "url": "https://nypost.com/2024/05/29/us-news/general-hospital-star-johnny-wactors-family-doesnt-want-his-ex-fiancee-tessa-farrell-speaking-on-la-murder/", 
            "description": "In a video Tuesday, Farrell broke down in tears over the “General Hospital” star’s death, slamming the gunmen for shooting “the wrong guy.”", 
            "title": "'General Hospital' star Johnny Wactor's family doesn't want his ex-fiancée Tessa Farrell speaking on LA murder - New York Post "
        }, 
        {
            "url": "https://www.cnn.com/2024/05/29/entertainment/sean-diddy-combs-federal-investigation/index.html", 
            "description": "Federal investigators are preparing to bring accusers of music mogul Sean “Diddy” Combs before a federal grand jury, two sources familiar with the probe tell CNN — signaling the US Justice Department is moving towards possibly seeking an indictment of Combs.", 
            "title": "Exclusive: A federal grand jury may soon hear from Sean ‘Diddy’ Combs’ accusers - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/29/sport/caitlin-clark-wnba-history-indiana-fever-sparks-spt-intl/index.html", 
            "description": "The Indiana Fever’s early season woes continued Tuesday with an 88-82 defeat to the Los Angeles Sparks, but Caitlin Clark produced a historic performance.", 
            "title": "Caitlin Clark makes WNBA history in Indiana Fever loss to Los Angeles Sparks - CNN"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c9xx5pj095jo", 
            "description": "Rapid changes in gravitational force caused the altitude drop which injured passengers, investigators say.", 
            "title": "Singapore Airlines plane dropped 178ft in five seconds, black box data reveals - BBC.com"
        }, 
        {
            "url": "https://www.reuters.com/world/asia-pacific/south-korea-alert-balloons-dropping-trash-north-2024-05-29/", 
            "description": null, 
            "title": "S.Korea accuses North of sending balloons with excrement across border - Reuters"
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-29/anglo-won-t-extend-bhp-deadline-threatening-end-to-takeover-bid", 
            "description": "Anglo American Plc said it won’t give BHP Group any further time to commit to a takeover offer, threatening to end a $49 billion pursuit by the world’s biggest mining company.", 
            "title": "Anglo Won't Extend BHP Deadline, Threatening End to Takeover Bid - Bloomberg"
        }, 
        {
            "url": "https://www.usatoday.com/story/news/weather/2024/05/29/is-2024-a-record-year-for-tornadoes/73875481007/", 
            "description": null, 
            "title": "Is 2024 a record year for tornadoes? Data shows a busy, deadly spring. - USA TODAY"
        }, 
        {
            "url": "https://www.wsbtv.com/news/local/stetson-bennett-opens-up-first-time-about-stepping-away-rams-last-year/XJ4GJPF6V5DLLEALBNUN5BHN2Y/", 
            "description": "", 
            "title": "Stetson Bennett opens up for first time about stepping away from Rams last year - WSB Atlanta"
        }, 
        {
            "url": "https://www.cbsnews.com/news/bird-flu-vaccine-chicken-eggs-researching-alternatives/", 
            "description": "The spread of an avian flu virus in cattle has again brought public health attention to the potential for a global pandemic. Fighting it would depend, for now, on 1940s technology that makes vaccines from hens' eggs.", 
            "title": "The bird flu vaccine is made with eggs. That has scientists worried. - CBS News"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/29/trump-birth-control-contraception-00159555", 
            "description": null, 
            "title": "Trump says he won't 'ban' birth control. Here's what he may do instead. - POLITICO"
        }
    ], 
    "last_updated": "2024-05-30 14:43:14"
}