{
    "news": [
        {
            "url": "https://www.cbsnews.com/news/michelle-troconis-jennifer-dulos-death-sentencing/", 
            "description": "Family and friends of Jennifer Dulos offered testimony before her late estranged husband's former girlfriend, Michelle Troconis, is sentenced after being convicted of helping plan and cover up her killing.", 
            "title": "Watch Live: Michelle Troconis hears emotional testimony ahead of sentencing in Jennifer Dulos murder conspiracy - CBS News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/31/politics/biden-middle-east-remarks/index.html", 
            "description": "President Joe Biden announced Friday that Israel has offered a “comprehensive new proposal” that provides a “roadmap” to a ceasefire in the war with Hamas in Gaza and the release of all hostages held by the terror group.", 
            "title": "Biden says Israel has offered a new ‘roadmap’ to bring about a ceasefire in Gaza - CNN"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=08_bUsPwi8I", 
            "description": "Experts discuss ahead of Boeing’s Starliner Crew Flight Test, which will carry NASA astronauts Butch Wilmore and Suni Williams to and from the International ...", 
            "title": "NASA’s Boeing Starliner Crew Flight Test Prelaunch News Conference (May 31, 2024) - NASA Video"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDUvMzAvc3RvY2stbWFya2V0LXRvZGF5LWxpdmUtdXBkYXRlcy5odG1s0gFIaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjQvMDUvMzAvc3RvY2stbWFya2V0LXRvZGF5LWxpdmUtdXBkYXRlcy5odG1s?oc=5", 
            "description": null, 
            "title": "S&P 500 falls on Friday, heads for first losing week in six: Live updates - CNBC"
        }, 
        {
            "url": "https://www.espn.com/nfl/story/_/id/40250779/olympic-gold-medal-wrestler-gable-steveson-signing-bills", 
            "description": "Gable Steveson, an Olympic gold medalist and one of the most dominant college wrestlers in NCAA history, is jumping to the NFL to sign with the Buffalo Bills, his agent Carter Chow told ESPN.", 
            "title": "Olympic gold medal wrestler Gable Steveson signing with Bills - ESPN"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjQvMDUvMzEvd29ybGQvYXNpYS91cy1jaGluYS1taWxpdGFyeS10YWxrcy5odG1s0gEA?oc=5", 
            "description": null, 
            "title": "U.S. and Chinese Defense Chiefs Hold First In-Person Talks Since 2022 - The New York Times"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/31/science/planet-parade-six-planetary-alignment-scn/index.html", 
            "description": "A “planet parade” of six planets will appear to align in the sky near dawn on Sunday, but only three will be visible to the naked eye. Here’s how to view the event.", 
            "title": "‘Planetary parade’ will see six planets line up in the morning sky - CNN"
        }, 
        {
            "url": "https://apnews.com/article/texas-abortion-ban-lawsuit-supreme-court-ruling-53b871dcd40b2660604980e5daa19512", 
            "description": "The Texas Supreme Court has rejected a challenge to one of the most restrictive abortion bans in the U.S. following a lawsuit by women who had serious pregnancy complications. Friday's ruling from the court is the latest decision to uphold Texas’ abortion ban…", 
            "title": "Texas Supreme Court rejects challenge to state's abortion law over medical exceptions - The Associated Press"
        }, 
        {
            "url": "http://deadline.com/2024/05/wake-up-dead-man-a-knives-out-mystery-adds-daryl-mccormack-to-cast-1235945873/", 
            "description": "'Wake Up Dead Man: A Knives Out Mystery' has added rising Irish actor Daryl McCormack to its cast led by Daniel Craig, Deadline can confirm.", 
            "title": "Daryl McCormack Boards ‘Wake Up Dead Man: A Knives Out Mystery’ - Deadline"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/31/politics/voters-trump-conviction-2024/index.html", 
            "description": "Some things take time to sink in. But don’t expect committed Donald Trump voters to suddenly waver because their candidate is now a convicted felon.", 
            "title": "Trump’s historic conviction isn’t doing much to shift these voters’ 2024 picks - CNN"
        }, 
        {
            "url": "https://variety.com/2024/tv/features/hacks-season-3-finale-jean-smart-hannah-einbinder-1236012252/", 
            "description": "The creators of 'Hacks' break down that Season 3 finale twist and how Deborah and Ava's relationship has evolved.", 
            "title": "‘Hacks’ Creators on That Finale Twist and Deborah and Ava’s Relationship: ‘It’s Arousing That She Has a Worthy Opponent’ - Variety"
        }, 
        {
            "url": "https://www.cbsnews.com/news/mediterranean-diet-reduces-mortality-study/", 
            "description": "The Mediterranean diet has long been regarded as a heart-healthy option, but a new study has found the diet may help reduce risk of death.", 
            "title": "Mediterranean diet associated with 23% reduction in mortality, study finds - CBS News"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/31/fda-approves-moderna-rsv-vaccine-for-seniors.html", 
            "description": "The decision is a win for Moderna, which needs another revenue source amid plunging demand for its Covid vaccine, its only commercially available product.", 
            "title": "FDA approves Moderna's RSV vaccine for seniors, the company's second-ever product - CNBC"
        }, 
        {
            "url": "https://www.hindustantimes.com/entertainment/hollywood/brad-pitt-and-angelina-jolie-s-daughter-shiloh-seeks-legal-help-to-drop-pitt-from-her-surname-101717163490510.html", 
            "description": "Shiloh, daughter of Brad Pitt and Angelina Jolie, seeks to drop 'Pitt' from her surname. | Hollywood", 
            "title": "Brad Pitt and Angelina Jolie’s daughter Shiloh seeks legal help to drop ‘Pitt’ from her surname - Hindustan Times"
        }, 
        {
            "url": "https://www.tomsguide.com/computing/mobile-apps/google-news-goes-down-for-millions-of-users-worldwide-in-mysterious-outage", 
            "description": "A slow news day?", 
            "title": "Google News goes down for millions worldwide in mysterious outage — latest updates - Tom's Guide"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmVhc3RpZGFob25ld3MuY29tLzIwMjQvMDUvd2F0Y2gtbGl2ZS1kYXktMS1vZi1jaGFkLWRheWJlbGwtc2VudGVuY2luZy1waGFzZS_SAQA?oc=5", 
            "description": null, 
            "title": "WATCH LIVE: Day 1 of Chad Daybell sentencing phase - East Idaho News"
        }, 
        {
            "url": "https://finance.yahoo.com/news/openais-apple-deal-sparks-concerns-142258074.html", 
            "description": null, 
            "title": "OpenAI's Apple Deal Sparks Concerns In Microsoft, Could Shift AI Market Dynamics - Yahoo Finance"
        }, 
        {
            "url": "https://www.politico.com/live-updates/2024/05/31/congress/manchin-independent-west-virginia-senate-governor-00160969", 
            "description": null, 
            "title": "Manchin registering as independent in West Virginia - Live Updates - POLITICO - POLITICO"
        }, 
        {
            "url": "https://apnews.com/article/israel-palestinians-rafah-2f603675195f80c73c593020398ed72a", 
            "description": "The Israeli military has confirmed that its forces are operating in central parts of Rafah in its expanding offensive in the southern Gaza city. The military said in a statement Friday that its troops in central Rafah had uncovered Hamas rocket launchers and …", 
            "title": "Israel confirms its forces are in central Rafah in expanding offensive in the southern Gaza city - The Associated Press"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=6IMwIXBWP2A", 
            "description": null, 
            "title": "UFC 302 OFFICIAL WEIGH-INS: Islam Makhachev vs Dustin Poirier - MMAWeekly.com"
        }
    ], 
    "last_updated": "2024-06-01 21:17:02"
}