{
    "news": [
        {
            "url": "https://www.cbssports.com/nba/news/knicks-vs-pacers-schedule-where-to-watch-game-2-tv-channel-nba-scores-prediction-live-stream-online/", 
            "description": "The Knicks are trying to go up 2-0 in the best-of-seven series", 
            "title": "Knicks vs. Pacers schedule: Where to watch Game 2, TV channel, NBA scores, prediction, live stream online - CBS Sports"
        }, 
        {
            "url": "https://apnews.com/article/police-shooting-airman-florida-8bcc82463ada69264389edf2a4f1a83d", 
            "description": "A civil rights attorney says deputies responding to a disturbance call at a Florida apartment complex burst into the wrong unit and fatally shot a Black U.S. Air Force airman. Attorney Ben Crump says Senior Airman Roger Fortson was home alone Friday when depu…", 
            "title": "Florida deputies who fatally shot US airman burst into wrong apartment, attorney says - The Associated Press"
        }, 
        {
            "url": "https://www.espn.com/nba/story/_/id/40109006/nuggets-nikola-jokic-wins-nba-mvp-3rd-4-seasons", 
            "description": "Nuggets star Nikola Jokic became the NBA's ninth three-time MVP, easily beating out the Thunder's Shai Gilgeous-Alexander and the Mavs' Luka Doncic on Wednesday.", 
            "title": "Nuggets' Nikola Jokic wins NBA MVP for 3rd time in 4 seasons - ESPN"
        }, 
        {
            "url": "https://www.washingtonpost.com/entertainment/music/2024/05/08/steve-albini-death-nirvana/", 
            "description": "Steve Albini, the Chicago alt-rock producer who worked with some of the greatest American rock acts, has died, his studio confirmed.", 
            "title": "Steve Albini, Nirvana and The Pixies music producer, dies at 61 - The Washington Post"
        }, 
        {
            "url": "https://www.bbc.com/news/uk-politics-68980700", 
            "description": "Natalie Elphicke has previously attacked Labour over policies including migration and taxes.", 
            "title": "Natalie Elphicke: Starmer faces anger after Tory MP's defection - BBC.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/08/health/ultraprocessed-foods-death-study-wellness/index.html", 
            "description": "Studies have shown that ultraprocessed foods can have a detrimental impact on health. But 30 years of research show they don’t all have the same impact.", 
            "title": "Ultraprocessed foods linked with early death, according to 30 years of research - CNN"
        }, 
        {
            "url": "https://www.npr.org/2024/05/08/1198911436/rafah-border-crossing-humanitarian-crisis-israel-offensive-what-comes-next", 
            "description": "The Biden administration has put a hold on an arms shipment to Israel.  A senior administration official speaking on the condition of anonymity told NPR it was due to concerns the bombs could be used in Rafah.<br><br>Rafah is the site of Israel's latest campa…", 
            "title": "Israel seized control of Rafah border crossing. The impact could be devastating : Consider This from NPR - NPR"
        }, 
        {
            "url": "https://www.nbcnews.com/politics/congress/rep-marjorie-taylor-greene-forcing-vote-oust-speaker-johnson-ukraine-a-rcna148389", 
            "description": "Far-right Rep. Majorie Taylor Greene made good on her threat Wednesday and filed a motion to oust Republican Speaker Mike Johnson from power over his decision to pass billions of dollars in military aid for Ukraine.", 
            "title": "House votes overwhelmingly to save Speaker Johnson from Marjorie Taylor Greene's push to oust him - NBC News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/08/politics/joe-biden-interview-cnntv/index.html", 
            "description": "President Joe Biden said for the first time Wednesday he would halt shipments of American weapons to Israel – which he acknowledged have been used to kill civilians in Gaza – if Prime Minister Benjamin Netanyahu orders a major invasion of the city of Rafah.", 
            "title": "Biden says he will stop sending bombs and artillery shells to Israel if they launch major invasion of Rafah - CNN"
        }, 
        {
            "url": "https://www.npr.org/2024/05/08/1249994099/schools-antisemitism-k-12", 
            "description": "Republicans tried for the kind of headline moments they've scored in similar hearings with elite college presidents. But the testimony from K-12 public school leaders offered few surprises.", 
            "title": "Republicans and K-12 school leaders clash over handling of antisemitism - NPR"
        }, 
        {
            "url": "https://www.nbcnews.com/news/us-news/southlake-texas-carroll-isd-civil-rights-investigation-rcna151009", 
            "description": "The Education Department wants to negotiate with the Carroll school district in Southlake, Texas, over four students' civil rights complaints, lawyers say.", 
            "title": "Feds find civil rights violations in Southlake, Texas, schools, students' lawyers say - NBC News"
        }, 
        {
            "url": "https://www.wesh.com/article/boeing-starliner-launch-new-date/60724546", 
            "description": "Before the next launch attempt, ULA officials say they will replace the pressure regulation valve that was causing concern.", 
            "title": "Boeing Starliner launch moved to new date after scrub - WESH 2 Orlando"
        }, 
        {
            "url": "https://www.wfaa.com/article/news/local/dallas-county/dallas-texas-police-chief-eddie-garcia-houston-austin-police-department-chief/287-09ef8051-5428-462a-8520-1d21629eec7e", 
            "description": "Garcia, who was hired as chief in Dallas in 2021, works in an at-will capacity under the city manager – meaning he can leave at any time.", 
            "title": "Could Dallas Police Chief Eddie Garcia be headed for the same role in Austin or Houston? Both cities are interested in Dallas' top cop, sources say - WFAA.com"
        }, 
        {
            "url": "https://www.managingmadrid.com/2024/5/8/24151928/three-questions-answers-real-madrid-2-1-4-3-agg-bayern-munich-champions-league-semi-final", 
            "description": "Joselu’s heroics booked a Champions League final place", 
            "title": "Three questions and three answers from Real Madrid 2-1 (4-3 agg.) Bayern Munich - Managing Madrid"
        }, 
        {
            "url": "https://spaceflightnow.com/2024/05/08/live-coverage-spacex-to-launch-23-starlink-satellites-on-falcon-9-rocket-from-florida/", 
            "description": null, 
            "title": "SpaceX breaks Space Shuttle pad record with Falcon 9 Starlink mission – Spaceflight Now - Spaceflight Now"
        }, 
        {
            "url": "https://www.huffpost.com/entry/prince-harry-princess-diana-siblings_n_66396555e4b0f72991a74651", 
            "description": "The Duke of Sussex received a warm welcome from the public during his engagement in London on Wednesday.", 
            "title": "2 Of Prince Harry's Family Members Showed Up To Support Him At UK Service - HuffPost"
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-08/arm-shares-slip-after-chip-designer-gives-tepid-annual-forecast", 
            "description": "Arm Holdings Plc shares tumbled after the chip designer gave a lukewarm revenue forecast for the fiscal year, raising concerns that the tech industry’s artificial intelligence spending spree is slowing.", 
            "title": "Arm Shares Slip After Chip Designer Gives Tepid Annual Forecast - Bloomberg"
        }, 
        {
            "url": "https://arstechnica.com/science/2024/05/deepmind-adds-a-diffusion-engine-to-latest-protein-folding-software/", 
            "description": "Major under-the-hood changes let AlphaFold handle protein-DNA complexes and more.", 
            "title": "DeepMind adds a diffusion engine to latest protein-folding software - Ars Technica"
        }, 
        {
            "url": "https://www.livescience.com/space/venus/molecule-responsible-for-robbing-venus-of-its-water-may-finally-have-been-identified", 
            "description": "A new water loss mechanism on Venus explains how the planet lost all its water, turning the planet from a potentially habitable world into the parched hellscape we know today.", 
            "title": "Molecule responsible for robbing Venus of its water may finally have been identified - Livescience.com"
        }, 
        {
            "url": "https://www.cbsnews.com/news/immigration-us-asylum-migrants-new-regulation/", 
            "description": "The Biden administration is planning to announce a new regulation designed to allow immigration officials to deport migrants ineligible for U.S. asylum earlier in the process.", 
            "title": "U.S. to empower asylum officials to reject more migrants earlier in process - CBS News"
        }
    ], 
    "last_updated": "2024-05-10 02:38:58"
}