{
    "news": [
        {
            "url": "https://www.wlky.com/article/scottie-scheffler-charges-dropped-louisville/60937750", 
            "description": "Charges against professional golfer Scottie Scheffler are expected to be dropped on Wednesday.", 
            "title": "Scottie Scheffler's charges dropped in Louisville courtroom - WLKY Louisville"
        }, 
        {
            "url": "https://www.foxnews.com/politics/rafah-offensive-israel-didnt-cross-bidens-red-line-white-house", 
            "description": "White House officials said the attacks on Rafah by Israel have not constituted a major ground operation, nor have they crossed Biden's 'red line.'", 
            "title": "Rafah offensive by Israel didn't cross Biden's 'red line,' White House says - Fox News"
        }, 
        {
            "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-29-2024-7952f779552f41ef6fb44c3b662f5c48", 
            "description": "Israel’s military says it's seized control of a strategic corridor that runs along the length of Gaza’s border with Egypt. The capture on Wednesday gives Israel control over a strip of land that it says is awash in smuggling tunnels that have bolstered the mi…", 
            "title": "Israel says it's taken control of key area of Gaza's border with Egypt awash in smuggling tunnels - The Associated Press"
        }, 
        {
            "url": "https://www.nba.com/wizards/news/wizards-name-brian-keefe-head-coach", 
            "description": "The Washington Wizards announced today that the team has named Brian Keefe as head coach. Keefe becomes the 26th head coach in the organization’s history.", 
            "title": "Wizards Name Brian Keefe Head Coach - NBA.com"
        }, 
        {
            "url": "https://thehill.com/policy/international/4692532-north-korea-sends-fleet-of-balloons-carrying-excrement-to-south-korea/", 
            "description": null, 
            "title": "North Korea sends fleet of balloons carrying excrement to South Korea - The Hill"
        }, 
        {
            "url": "https://www.gamespot.com/articles/playstation-days-of-play-2024-ps5-deals/1100-6523751/", 
            "description": "The event runs through June 12, giving you a chance to save on games, accessories, consoles, and more.", 
            "title": "Tons Of PS5-Exclusive Games Are On Sale For Low Prices For PlayStation's Days Of Play - GameSpot"
        }, 
        {
            "url": "https://www.npr.org/2024/05/29/nx-s1-4984840/american-airlines-8-black-men-body-odor-discrimination-lawsuit", 
            "description": "Neither passenger knew each other, nor were they seated together on the Jan. 5 flight from Phoenix to New York. A lawsuit alleges they were removed from the flight after a complaint about body odor.", 
            "title": "American Airlines faces a discrimination suit after removing 8 Black men from flight - NPR"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/29/salesforce-crm-q1-earnings-report-2025.html", 
            "description": "Salesforce issued a disappointing forecast in its quarterly earnings report on Wednesday.", 
            "title": "Salesforce shares plunge 17% on revenue miss, weak forecast - CNBC"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=DuUH2sdTL_4", 
            "description": "A joint European-Japanese satellite has launched to measure how clouds influence the climate. Some low-level clouds are known to cool the planet, others at h...", 
            "title": "European-Japanese satellite blasts off to space | BBC News - BBC News"
        }, 
        {
            "url": "https://apnews.com/article/harvey-weinstein-me-too-retrial-nyc-courthouse-1d1182cdcf20b26fa9f1f72f3d085ee4", 
            "description": "Manhattan prosecutors have told a judge they are evaluating new claims of sexual misconduct made against Harvey Weinstein. Assistant District Attorney Nicole Blumberg has said during a court hearing Wednesday that additional people have come forward with assa…", 
            "title": "Harvey Weinstein may face new charges as more accusers come forward, New York prosecutors say - The Associated Press"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cjll8nr6962o", 
            "description": "Votes are being counted after the most closely fought election since the ANC came to power 30 years ago.", 
            "title": "South Africa election results: Counting under way after pivotal poll - BBC.com"
        }, 
        {
            "url": "https://www.washingtonpost.com/sports/2024/05/29/bronny-james-nba-draft/", 
            "description": "James’s decision will inevitably lead to intrigue about whether he could team up with his father, LeBron, next season.", 
            "title": "Bronny James will stay in the NBA draft. Is a pairing with LeBron James next? - The Washington Post"
        }, 
        {
            "url": "https://apnews.com/article/biden-black-voters-election-2024-pennsylvania-0c4a7343c017f57a38c847bfc9b1316f", 
            "description": "President Joe Biden is renewing his election-year pitch to Black voters. At an appearance in Philadelphia with Vice President Kamala Harris on Wednesday, he lashed out at what he called Donald Trump’s “MAGA lies” and said the winner of this year’s White House…", 
            "title": "Biden and Harris will launch a Black voter outreach effort as they see signs of diminished support - The Associated Press"
        }, 
        {
            "url": "https://www.cbsnews.com/news/supreme-court-justice-alito-wont-recuse-over-flags/", 
            "description": "Justice Samuel Alito has come under pressure from congressional Democrats to recuse himself from cases involving the Jan. 6, 2021, Capitol attack and former President Donald Trump.", 
            "title": "Alito tells congressional Democrats he won't recuse over flags - CBS News"
        }, 
        {
            "url": "https://arstechnica.com/science/2024/05/h5n1-bird-flu-has-come-for-the-alpacas-too-the-usda-reports/", 
            "description": "The alpacas were known to be in close contact with infected birds.", 
            "title": "Alpacas in Idaho test positive for H5N1 bird flu in another world first - Ars Technica"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.androidauthority.com/resize-live-captions-on-android-3447092/", 
            "description": "Android’s Live Captions feature will soon add a grab bar that users can drag to change the number of lines shown for captions.", 
            "title": "Google will soon let you resize Android's Live Captions feature - Android Authority"
        }, 
        {
            "url": "https://abcnews.go.com/Politics/rep-tony-gonzales-projected-winner-closely-watched-texas/story?id=110643975", 
            "description": "The runoff pitted a moderate-leaning Republican against a political newcomer.", 
            "title": "Rep. Tony Gonzales projected winner of closely watched Texas primary runoff - ABC News"
        }, 
        {
            "url": "https://www.space.com/x-flare-eruption-may-27-returning-sunspot", 
            "description": "The hyperactive sunspot region doesn't seem to be slowing down anytime soon.", 
            "title": "Massive sunspot responsible for May's epic auroras unleashes major X-class solar flare (video) - Space.com"
        }, 
        {
            "url": "https://arstechnica.com/space/2024/05/ars-live-caleb-henry-joins-us-to-discuss-the-profitability-of-starlink/", 
            "description": "How has Starlink has gone from zero to profitability in five years?", 
            "title": "Ars Live: How profitable is Starlink? We dig into the details of satellite Internet. - Ars Technica"
        }
    ], 
    "last_updated": "2024-05-31 01:14:03"
}