{
    "news": [
        {
            "url": "https://www.cnbc.com/2024/05/21/lowes-low-q1-2024-earnings.html", 
            "description": "The home improvement retailer Lowe's said sales fell again year over year, and it reiterated its full-year earnings forecast.", 
            "title": "Lowe's beats on earnings and revenue, even as consumers spend less on DIY projects - CNBC"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/crgg821ezz8o", 
            "description": "The French Pacific territory's airport has been closed since deadly unrest erupted last week.", 
            "title": "New Caledonia: Australia and New Zealand send evacuation flights amid unrest - BBC.com"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c3ggplvn5pzo", 
            "description": "Critics broadly praise The Apprentice, but the former president threatens to sue over its content.", 
            "title": "The Apprentice: Donald Trump film biopic causes a stir at Cannes - BBC.com"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3Lm5iY25ld3MuY29tL25ld3Mvd29ybGQvbmV0YW55YWh1LWFycmVzdC13YXJyYW50LWlzcmFlbC1oYW1hcy13YXItaWNjLXJjbmExNDk3NDPSAStodHRwczovL3d3dy5uYmNuZXdzLmNvbS9uZXdzL2FtcC9yY25hMTQ5NzQz?oc=5", 
            "description": null, 
            "title": "ICC prosecutor applies for arrest warrants for Netanyahu and Hamas leader Sinwar - NBC News"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-hush-money-robert-costello-b1beb56a666c398ae5393ede16c326da", 
            "description": "A defense witness in Donald Trump’s New York hush money case whom the judge threatened to remove over his behavior will return to the stand as the trial nears its end. Trump’s lawyers are hoping Robert Costello’s testimony Tuesday will help undermine the cred…", 
            "title": "Hush money trial: Trump witness Costello back on the stand after admonishment - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/travel/fujikawaguchiko-japan-photo-blocking-barrier-intl-hnk/index.html", 
            "description": "The Japanese town of Fujikawaguchiko has erected a giant black net to block views of Mount Fuji, a reaction to the town’s huge popularity on Instagram and other social media platforms.", 
            "title": "Japanese town overrun with tourists puts up view-blocking barrier near Mount Fuji - CNN"
        }, 
        {
            "url": "https://www.nhl.com/news/edmonton-oilers-vancouver-canucks-game-7-recap-may-20", 
            "description": "Nugent-Hopkins has goal, assist for Edmonton; Boeser misses game with injury for Vancouver", 
            "title": "Oilers hold off Canucks in Game 7, advance to Western Final - NHL.com"
        }, 
        {
            "url": "https://scitechdaily.com/webb-space-telescope-cracks-case-of-puffy-microwaved-marshmallow-exoplanet/", 
            "description": "A surprising deficiency of methane suggests that tidal heating has puffed up the atmosphere of the warm gas giant WASP-107 b. Why is the warm gas-giant exoplanet WASP-107 b so, so puffy? With a moderate temperature and an ultra-low density on par with a micro…", 
            "title": "Webb Space Telescope Cracks Case of Puffy “Microwaved Marshmallow” Exoplanet - SciTechDaily"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://abcnews.go.com/US/35-year-man-survives-grizzly-bear-attack-after/story?id=110424633", 
            "description": "Officials believe this was a “surprise encounter\" with two grizzly bears.", 
            "title": "35-year-old man survives grizzly bear attack after encountering 2 of them at national park - ABC News"
        }, 
        {
            "url": "https://abcnews.go.com/US/climber-found-dead-after-falling-off-highest-peak/story?id=110424974", 
            "description": "Since 1980, at least 14 climbers have died in falls on the West Buttress route.", 
            "title": "Climber found dead after falling off highest peak in North America - ABC News"
        }, 
        {
            "url": "https://finance.yahoo.com/news/asml-tsmc-disable-chip-machines-072621845.html", 
            "description": "(Bloomberg) -- ASML Holding NV and Taiwan Semiconductor Manufacturing Co. have ways to disable the world’s most sophisticated chipmaking machines in the...", 
            "title": "ASML and TSMC Can Disable Chip Machines If China Invades Taiwan - Yahoo Finance"
        }, 
        {
            "url": "https://www.foxnews.com/world/british-court-rules-julian-assange-may-make-full-appeal-against-us-extradition-first-amendement-grounds", 
            "description": "WikiLeaks founder Julian Assange may appeal an extradition order to the U.S. on espionage charges after a ruling in his favor was handed down Monday by the British High Court.", 
            "title": "British court rules Julian Assange may make full appeal against US extradition on First Amendment grounds - Fox News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/21/world/iran-begins-days-of-funeral-ceremonies-for-president-raisi-as-investigators-probe-helicopter-crash/index.html", 
            "description": "Iran will kick off funeral ceremonies for the late Iranian president Ebrahim Raisi on Tuesday following his death in a helicopter crash as authorities probe what caused the aircraft to smash into the side of a remote mountainside.", 
            "title": "Iran begins days of funeral ceremonies for President Raisi as investigators probe helicopter crash - CNN"
        }, 
        {
            "url": "https://www.npr.org/2024/05/21/1252616600/target-price-reductions-milk-butter", 
            "description": "Target said it is trying to help customers save money as well as stay competitive in its markets. Price reductions have already been reflected in about 1,500 products.", 
            "title": "Target is reducing prices on 5000 common goods, including milk, butter and pet food - NPR"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL255cG9zdC5jb20vMjAyNC8wNS8yMS93b3JsZC1uZXdzL3NsYWluLWxlYWRlci1vZi1mYWlsZWQtZHItY29uZ28tY291cC1jaHJpc3RpYW4tbWFsYW5nYS1zb2xkLWNhcnMtaW4tdXRhaC13aGVuLWhlLWxpdmVkLWluLXRoZS11cy_SAQA?oc=5", 
            "description": null, 
            "title": "Christian Malanga, slain leader of failed DR Congo coup, sold cars in Utah when he lived in the US - New York Post "
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cv2237rplg8o", 
            "description": "The car makers used parts made by a supplier banned over alleged links to Chinese forced labour.", 
            "title": "BMW, Jaguar and VW imported banned Xinjiang parts - Senate probe - BBC.com"
        }, 
        {
            "url": "https://apnews.com/article/uk-infected-blood-inquiry-report-cc37acdc60798c7af82131efce63b6f1", 
            "description": "An inquiry has found that British authorities and the public health service knowingly exposed tens of thousands of patients to deadly infections through contaminated blood and blood products and hid the truth about the disaster for decades. An estimated 3,000…", 
            "title": "Britain slammed in inquiry for infecting thousands with tainted blood and covering up the scandal - The Associated Press"
        }, 
        {
            "url": "https://www.eonline.com/news/1402026/jennifer-lopez-puts-her-wedding-ring-on-display-on-red-carpet-amid-ben-affleck-breakup-rumors", 
            "description": "Jennifer Lopez was spotted with her wedding ring from husband Ben Affleck amid rumors that the couple are experiencing marital troubles. See her on the red carpet at the Atlas premiere.", 
            "title": "Jennifer Lopez Puts Her Wedding Ring on Display on Red Carpet Amid Ben Affleck Breakup Rumors - E! Online - E! NEWS"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/20/biden-trump-campaign-finance-reports-00159060", 
            "description": null, 
            "title": "Warning signs for Biden and Trump in latest campaign finance reports - POLITICO"
        }
    ], 
    "last_updated": "2024-05-22 12:29:50"
}