{
    "news": [
        {
            "url": "https://www.macrumors.com/2024/05/16/imessage-down-for-some/", 
            "description": "The iMessage service that Apple users to send messages to one another appears to be down for some users, and messages are failing to go out or are...", 
            "title": "iMessage Down for Some Users - MacRumors"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-hush-money-michael-cohen-ec08be1219703deb3cd10604844deacb", 
            "description": "Donald Trump’s lawyers have sought to portray the star prosecution witness in his hush money trial as a serial fabulist who is bent on seeing the presumptive Republican presidential nominee behind bars. During hours of cross-examination on Thursday, defense a…", 
            "title": "Michael Cohen pressed on his crimes and lies as defense attacks key Trump hush money trial witness - The Associated Press"
        }, 
        {
            "url": "https://scitechdaily.com/alarming-virus-evolution-scientists-identify-first-ever-mammal-to-human-bird-flu-case/", 
            "description": "The Biological Threat Research Laboratory (BTRL) at Texas Tech University was instrumental in identifying the first case of highly pathogenic avian influenza (HPAI) A (H5N1) being transmitted from a mammal (dairy cow) to a human. The case was made public in a…", 
            "title": "Alarming Virus Evolution – Scientists Identify First-Ever Mammal-to-Human Bird Flu Case - SciTechDaily"
        }, 
        {
            "url": "https://nypost.com/2024/05/16/us-news/house-passes-bill-forcing-us-supplied-weapons-to-israel-despite-bidens-veto-threat/", 
            "description": "The House approved legislation Thursday that would force President Biden to swiftly send US weapons to Israel amid its war with Hamas terrorists in the Gaza Strip — in the face of a pause on at lea…", 
            "title": "House passes bill forcing US-supplied weapons to Israel — despite Biden veto threat - New York Post "
        }, 
        {
            "url": "https://www.cnn.com/2024/05/16/us/daniel-perry-texas-pardon-recommendation/index.html", 
            "description": "The Texas Board of Pardons has recommended a full pardon to Daniel Perry, a US Army sergeant who was sentenced to 25 years in prison after being convicted of murdering a protester at a Black Lives Matter rally in 2020.", 
            "title": "Gov. Abbott pardons Daniel Perry for 2020 fatal Black Lives Matter protest shooting after recommendation from pardons board - CNN"
        }, 
        {
            "url": "https://www.cbsnews.com/detroit/news/detroit-population-increases-first-time-since-1957/", 
            "description": "After decades of decline, Detroit's population population is finally growing once again, according to new estimates from the U.S. Census Bureau.", 
            "title": "Detroit sees population growth for first time since 1957 - CBS News"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/francis-ford-coppola-megalopolis-1235900890/", 
            "description": "The legendary filmmaker, 85, last had a film in competition at the fest 45 years ago — 'Apocalypse Now,' for which he was awarded the Palme d'Or for the second time, five years after 'The Conversation' won it.", 
            "title": "Cannes: Francis Ford Coppola's Much-Discussed 'Megalopolis' Receives 10-Minute Standing Ovation - Hollywood Reporter"
        }, 
        {
            "url": "https://variety.com/2024/tv/news/shogun-season-2-development-fx-hulu-1235999171/", 
            "description": "FX, Hulu, and the James Clavell estate are working to develop potentially two more seasons of the critically acclaimed series \"Shogun\"", 
            "title": "‘Shogun’: FX Developing Two New Seasons With Estate of Original Author James Clavell - Variety"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c3g9g63jl17o", 
            "description": "The ICJ ruling has come under intense scrutiny, centring on the word \"plausible\". What did the court mean?", 
            "title": "Israel-Gaza: What did the ICJ ruling really say? - BBC.com"
        }, 
        {
            "url": "https://www.cbssports.com/golf/news/2024-pga-championship-leaderboard-live-coverage-tiger-woods-score-golf-scores-today-in-round-1-at-valhalla/live/", 
            "description": "Live scores, updates and highlights from the first round of action at the 106th PGA Championship", 
            "title": "2024 PGA Championship leaderboard: Live coverage, Tiger Woods score, golf scores today in Round 1 at Valhalla - CBS Sports"
        }, 
        {
            "url": "https://www.washingtonpost.com/climate-environment/2024/05/16/coal-leasing-powder-river-basin-climate/", 
            "description": "The Biden administration’s decision ends new leasing in the Powder River Basin in Wyoming and Montana, the nation’s biggest coal-producing region.", 
            "title": "U.S. to end coal leasing in nation's largest coal-producing region - The Washington Post"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=29FLBgPGmfU", 
            "description": "Rory McIlroy's press conference following his strong start in the opening round of the 2024 PGA Championship at Valhalla. Subscribe now: https://bit.ly/PGACh...", 
            "title": "Rory McIlroy Press Confererence | PGA Championship 2024 Round 1 - PGA Championship"
        }, 
        {
            "url": "https://sports.yahoo.com/2024-nfl-schedule-everything-fantasy-football-managers-need-to-know-171434109.html", 
            "description": "Scott Pianowski breaks down the recent NFL schedule release from a fantasy football perspective.", 
            "title": "2024 NFL Schedule: Everything fantasy football managers need to know - Yahoo Sports"
        }, 
        {
            "url": "https://www.ksn.com/news/local/spirit-aerosystems-to-lay-off-up-to-450/", 
            "description": "In a message to workers, the company said it has “made the difficult decision” to reduce the hourly production workforce by approximately 400-450 employees.", 
            "title": "Spirit AeroSystems to lay off up to 450 - KSN-TV"
        }, 
        {
            "url": "https://finance.yahoo.com/news/israeli-cabinet-rifts-over-gaza-171533335.html", 
            "description": "Israeli government splits over the war in Gaza broke open this week, after the Defence Minister publicly demanded a clear strategy from Prime Minister...", 
            "title": "Israeli cabinet rifts over Gaza break out into the open - Yahoo Finance"
        }, 
        {
            "url": "https://www.washingtonpost.com/politics/2024/05/16/supreme-court-cfpb-funding/", 
            "description": "The Biden administration urged the Supreme Court to reject an appeals court decision that cast doubt on Congress’s authority to decide how to fund an agency.", 
            "title": "Supreme Court upholds CFPB funding mechanism, rejecting conservative challenge - The Washington Post"
        }, 
        {
            "url": "https://www.wmur.com/article/hollis-new-hampshire-fox-attack-rabies/60814704", 
            "description": "Hollis police said a fox that attacked a 4-year-old child has tested positive for rabies.", 
            "title": "Fox that attacked New Hampshire child tests positive for rabies - WMUR Manchester"
        }, 
        {
            "url": "https://www.foxnews.com/media/jen-psaki-thinks-biden-trump-debate-could-collapse-im-still-skeptic", 
            "description": "MSNBC host Jen Psaki said the debates between President Biden and former President Trump may not go forward as planned, despite enthusiasm from both candidates.", 
            "title": "Jen Psaki thinks Biden-Trump debate could collapse: 'I'm still a skeptic' - Fox News"
        }, 
        {
            "url": "https://www.reuters.com/markets/us/futures-edge-higher-softer-inflation-report-lifts-rate-cut-hopes-2024-05-16/", 
            "description": null, 
            "title": "Dow breaches 40000 mark as rate-cut hopes fuel fresh record high - Reuters"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/andrea-arnold-bird-cannes-film-festival-standing-ovation-1235900944/", 
            "description": "The new feature from the 'American Honey' director stars Barry Keoghan, Franz Rogowski, Nykiya Adams, and Jason Buda.", 
            "title": "Andrea Arnold’s ‘Bird’ Takes Flight at Cannes Film Festival With 7-Minute Standing Ovation - Hollywood Reporter"
        }
    ], 
    "last_updated": "2024-05-18 01:48:49"
}