{
    "news": [
        {
            "url": "https://www.bbc.com/news/articles/cm54pp11x3go", 
            "description": "Serbia has been deepening its relationship with China while continuing talks to join the EU.", 
            "title": "China's Xi Jinping gets red-carpet welcome in Serbia - BBC.com"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.reuters.com/technology/us-revoked-some-export-licenses-chinas-huawei-2024-05-07/", 
            "description": null, 
            "title": "US revokes Intel, Qualcomm's export licenses to sell to China's Huawei, sources say - Reuters"
        }, 
        {
            "url": "https://sports.yahoo.com/nba-playoffs-thunder-roll-past-mavericks-in-game-1-as-youth-prevails-again-040321170.html", 
            "description": "Playoff inexperience hasn't been an issue for the Thunder in a 5-0 postseason start", 
            "title": "NBA playoffs: Thunder roll past Mavericks in Game 1 as youth prevails again - Yahoo Sports"
        }, 
        {
            "url": "https://www.bbc.com/news/world-middle-east-68974624", 
            "description": "A bomb shipment was halted last week over concerns Israel was going ahead with a Rafah offensive.", 
            "title": "US reveals it paused shipment of bombs for Israel over Rafah concerns - BBC.com"
        }, 
        {
            "url": "https://www.freep.com/story/news/local/michigan/2024/05/07/tornado-confirmed-in-michigan/73605562007/", 
            "description": "Multiple tornadoes touch down in West Michigan, significantly damaging a FedEx facility in Portage and leaving thousands of power outages.", 
            "title": "Tornadoes reported in west Michigan; multiple buildings in Portage damaged: Live updates - Detroit Free Press"
        }, 
        {
            "url": "https://www.cbsnews.com/news/deadly-oklahoma-tornado-trail-of-damage-barnsdall-bartlesville-portage-michigan/", 
            "description": "A tornado destroyed homes and toppled trees and power lines when it roared through a small northeast Oklahoma city, one of several twisters that erupted in the central U.S.​ amid a series of powerful storms.", 
            "title": "Storms batter Midwest one day after tornado leaves at least 1 dead in Oklahoma - CBS News"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/tv/tv-news/travis-kelce-ryan-murphy-fx-series-grotesquerie-1235893302/", 
            "description": "The Super Bowl champion continues his push into Hollywood with his first dramatic role.", 
            "title": "Travis Kelce Joins Ryan Murphy’s FX Series ‘Grotesquerie’ - Hollywood Reporter"
        }, 
        {
            "url": "https://www.reuters.com/world/europe/tsar-putin-tells-west-russia-will-talk-only-equal-terms-2024-05-07/", 
            "description": "Vladimir Putin, honoured like a Russian tsar at his swearing-in for a new six-year presidential term, had a double-edged message for the West: the Kremlin is ready to talk but Russia is girding for victory in Ukraine.", 
            "title": "'Tsar' Putin tells the West: Russia will talk only on equal terms - Reuters"
        }, 
        {
            "url": "https://www.washingtonpost.com/dc-md-va/2024/05/07/last-body-found-key-bridge-collapse-baltimore/", 
            "description": "Officials identified the person as José Mynor López, 37, of Baltimore", 
            "title": "Sixth body found after Key Bridge collapse - The Washington Post"
        }, 
        {
            "url": "https://apnews.com/article/panera-charged-lemonade-drinks-caffeine-3d0f74907be3b755b71b7c47d2dfc85d", 
            "description": "Panera Bread said it’s discontinuing its Charged Sips drinks that were tied to at least two wrongful death lawsuits due to their high caffeine content. Panera didn’t say Tuesday whether the drinks were being discontinued because of the lawsuits or health conc…", 
            "title": "Panera to stop serving 'Charged Sips' drinks after wrongful death lawsuits over caffeine content - The Associated Press"
        }, 
        {
            "url": "https://www.eonline.com/news/1401108/you-missed-kim-kardashians-bizarre-shoe-detail-at-2024-met-gala", 
            "description": "Kim Kardashian made a very interesting shoe choice for the 2024 Met Gala May 6, wearing a pair of heels with no heel so they wouldn't get caught in her dress as she walked.", 
            "title": "You Missed Kim Kardashian's Bizarre Shoe Detail at 2024 Met Gala - E! NEWS"
        }, 
        {
            "url": "http://deadline.com/2024/05/reba-mcentire-happys-place-nbc-1235908257/", 
            "description": "Reba McEntire is back on network television. NBC has handed her sitcom Happy’s Place a series order. It comes after the network handed season three renewals to Lopez vs. Lopez and Night Court and canceled Extended Family after one season. The comedy sees McEn…", 
            "title": "Reba McEntire Comedy ‘Happy’s Place’ Lands Series Order At NBC - Deadline"
        }, 
        {
            "url": "https://www.cbssports.com/nfl/news/2024-nfl-schedule-release-sneak-peek-here-are-seven-things-we-already-know-about-this-years-slate-of-games/", 
            "description": "The 2024 schedule isn't out yet, but we already know quite a few things about this year's slate of games", 
            "title": "2024 NFL schedule release sneak peek: Here are seven things we already know about this year's slate of games - CBS Sports"
        }, 
        {
            "url": "https://www.nbcnews.com/news/us-news/explosives-used-help-free-dali-baltimore-bridge-wreckage-rcna151135", 
            "description": "Crews in Baltimore are preparing to use precision explosive charges to free the Dali container ship from underneath wreckage of the Francis Scott Key Bridge.", 
            "title": "Explosives to be used to help free the Dali from Baltimore bridge wreckage - NBC News"
        }, 
        {
            "url": "https://www.usatoday.com/story/sports/nfl/chiefs/2024/05/07/rashee-ricechiefs-suspect-nightclub-assault/73606021007/", 
            "description": "Rashee Rice, who faces eight felony counts for causing a hit-and-run in March, is suspected in an alleged assault at a Dallas nightclub, reports say.", 
            "title": "Embattled Kansas City Chiefs WR Rashee Rice suspected in a nightclub assault, per reports - USA TODAY"
        }, 
        {
            "url": "https://www.denverpost.com/2024/05/07/jamal-murray-fined-nuggets-timberwolves/", 
            "description": "Murray avoided a suspension after the league reviewed the incident, sources told The Denver Post.", 
            "title": "Jamal Murray fined $100,000, avoids suspension for throwing objects at official during playoff game - The Denver Post"
        }, 
        {
            "url": "https://apnews.com/article/boy-scouts-new-name-scouting-america-d583f5712680f155b4f6b762128734d3", 
            "description": "The Boy Scouts of America is changing its name for the first time in its 114-year history. The Texas-based organization announced Tuesday that it will become Scouting America. It's a significant shift for an organization that is seeking to move past the turmo…", 
            "title": "Boy Scouts is changing its name to Scouting America - The Associated Press"
        }, 
        {
            "url": "https://www.npr.org/2024/05/07/1249715215/toxic-culture-workplace-fdic-goverment-employees-investigation-harassment", 
            "description": "A law firm investigation of the FDIC documents a toxic workplace culture where hundreds of employees complained of sexual harassment, discrimination and other misconduct.", 
            "title": "Toxic culture is the norm at the FDIC, leadership cited in report - NPR"
        }, 
        {
            "url": "https://www.axios.com/2024/05/07/white-house-israel-hamas-positions-allow-hostage-deal", 
            "description": null, 
            "title": "White House says Israel and Hamas put a hostage deal within reach - Axios"
        }
    ], 
    "last_updated": "2024-05-09 11:07:48"
}