{
    "news": [
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.yahoo.com/gma/panda-dog-zoo-exhibit-china-221651237.html", 
            "description": null, 
            "title": "'Panda dog' zoo exhibit in China features black-and-white painted chows, controversy - Yahoo! Voices"
        }, 
        {
            "url": "https://www.washingtonpost.com/politics/2024/05/10/barron-trump-republican-convention/", 
            "description": "The 18-year-old son of former president Donald Trump had been set to make his political debut at the Republican National Convention this summer.", 
            "title": "Barron Trump won’t serve as delegate at the Republican National Convention, Melania Trump says - The Washington Post"
        }, 
        {
            "url": "https://nypost.com/2024/05/10/world-news/israeli-war-cabinet-green-lights-military-push-into-rafah-over-bidens-objections-report/", 
            "description": "Israel’s war cabinet has approved expanding its Hamas battle plan to include Rafah, a move that could soon see Israel Defense Forces enter the densely populated city, which the Jewish state c…", 
            "title": "Israeli war cabinet green-lights military push into Rafah over Biden's objections: report - New York Post "
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-68984999", 
            "description": "State department says it is \"reasonable to assess\" that Israel used US-made weapons in ways inconsistent with its legal obligations.", 
            "title": "US says Israel may have breached international law with American weapons in Gaza - BBC.com"
        }, 
        {
            "url": "https://www.espn.com/mlb/story/_/id/40121064/former-mlb-infielder-llws-star-sean-burroughs-dies-43", 
            "description": "Sean Burroughs, a winner of the Little League World Series, a 2000 Olympic gold medalist and a first-round pick in the MLB draft, has died at the age of 43.", 
            "title": "Former MLB infielder, LLWS star Sean Burroughs dies at 43 - ESPN"
        }, 
        {
            "url": "https://www.cbsnews.com/news/maps-northern-lights-forecast-us-aurora-borealis/?ftag=YHF4eb9d17", 
            "description": "Americans could be treated to a show of the northern lights this weekend from a powerful geomagnetic storm heading toward Earth.", 
            "title": "Maps show where millions in U.S. could see northern lights this weekend - Yahoo! Voices"
        }, 
        {
            "url": "https://people.com/how-justin-bieber-pregnant-wife-hailey-kept-their-baby-news-secret-exclusive-8646800", 
            "description": "On Thursday, May 9, Justin Bieber and wife Hailey Bieber announced that they are expecting their first baby together.", 
            "title": "How Justin Bieber, Pregnant Wife Hailey Kept Baby News Secret (Exclusive) - PEOPLE"
        }, 
        {
            "url": "https://apnews.com/article/california-budget-deficit-gov-gavin-newsom-8f502d57d00d551c0b6b6331367f7a25", 
            "description": "California Gov. Gavin Newsom says the state’s budget deficit is $27.6 billion. The figure Newsom announced Friday is smaller than the deficit he anticipated in January. That’s because it doesn’t take into account $17.3 billion worth of budget actions he and l…", 
            "title": "California governor would slash 10000 vacant state jobs to help close $27.6 billion deficit - The Associated Press"
        }, 
        {
            "url": "https://variety.com/2024/tv/news/sam-rubin-dead-ktla-entertainment-reporter-1235998979/", 
            "description": "Sam Rubin, a popular entertainment reporter on KTLA since 1991, died Friday, a source close to the station confirmed. He was 64.", 
            "title": "Sam Rubin, Longtime KTLA Entertainment Reporter, Dies at 64 - Variety"
        }, 
        {
            "url": "https://www.ksl.com/article/51009324/us-approves-200m-to-curtail-spread-of-bird-flu-in-cows-what-usu-scientists-want-you-to-know", 
            "description": "Avian influenza, or bird flu, has been spreading from birds to dairy cows in nine U.S. states. Utah State University scientists want to make sure the public has the facts.", 
            "title": "What USU scientists want the public to know about bird flu and cows - KSL.com"
        }, 
        {
            "url": "https://arizonasports.com/story/3547450/suns-do-right-by-firing-frank-vogel-bringing-in-mike-budenholzer/", 
            "description": "If Mike Budenholzer somehow steers this pricey, finicky team to a championship, he will become a fairy tale, a legitimate hometown hero.", 
            "title": "Bickley: Suns do right by firing Vogel, bringing in Mike Budenholzer - Arizona Sports"
        }, 
        {
            "url": "https://www.nola.com/entertainment_life/ticket-prices-skyrocket-for-new-orleans-eras-tour-concert-after-taylor-swift-releases-ttpd/article_1e280f2c-0ee3-11ef-95b3-7f2811cf880e.html", 
            "description": "Taylor Swift's Paris concert proved the 2024 Eras Tour will be a new experience with the addition of songs from \"The Tortured Poet's Department.\" \n\nAnd if you want to see her in NOLA and don't have tickets yet, expect to drop a load of cash. Here's how much.", 
            "title": "Ticket prices skyrocket for New Orleans Eras Tour concert after Taylor Swift releases TTPD - NOLA.com"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/10/24153767/sam-altman-openai-google-io-search-engine-launch", 
            "description": "Sam Altman, CEO of OpenAI, denied recent reports that an upcoming event would be related to ChatGPT-5 or a new search engine.", 
            "title": "Sam Altman shoots down reports of search engine launch ahead of Google I/O - The Verge"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/10/europe/russia-ukraine-cross-border-kharkiv-intl/index.html", 
            "description": "Russian forces have made two cross border assaults inside northern Ukraine, according to information from Ukrainian sources and officials – in what President Volodymyr Zelensky is calling a ‘new wave of counteroffensive actions” by Russia.", 
            "title": "Russia mounts surprise assault on northern Ukraine in most serious cross-border offensive in two years - CNN"
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-68985412", 
            "description": "In a first for the US, two Virginia schools will have their original Confederate names reinstated.", 
            "title": "Virginia school board votes to restore Confederate names - BBC.com"
        }, 
        {
            "url": "https://finance.yahoo.com/news/novavax-stock-doubles-after-sanofi-deal-marks-new-chapter-for-company-172419830.html", 
            "description": "Novavax stock popped Friday on news of a licensing deal and minority stake from Big Pharma player Sanofi.", 
            "title": "Novavax stock doubles after Sanofi deal marks 'new chapter' for company - Yahoo Finance"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cv2j0v237vko", 
            "description": "Protesters opposed to the expansion of the site have clashed with police.", 
            "title": "Grünheide: Tesla factory protesters clash with police in Germany - BBC.com"
        }, 
        {
            "url": "https://www.cbsnews.com/news/magna-carta-british-library-environmental-activists-smash-arrest/", 
            "description": "Video posted online shows the Rev. Sue Parfitt and Judy Bruce —protesters from Just Stop Oil — gluing themselves to the display.", 
            "title": "Priest, 82, and retired teacher, 85, smash case holding copy of Magna Carta in environmental protest - CBS News"
        }, 
        {
            "url": "https://www.teslarati.com/spacex-launches-more-direct-to-cell-starlink-satellites/", 
            "description": "SpaceX launched 20 more Starlink satellites last night from Space Launch Complex 4 East at Vandenberg Space Force Base in California.", 
            "title": "SpaceX launches more direct to cell capable Starlink satellites - TESLARATI"
        }
    ], 
    "last_updated": "2024-05-12 03:10:07"
}