{
    "news": [
        {
            "url": "https://thehill.com/homenews/media/4665537-gayle-king-sports-illustrated-swimsuit-cover/", 
            "description": "“CBS Mornings” co-host Gayle King revealed her shock when asked to pose for the Sports Illustrated Swimsuit’s 60th anniversary edition, telling the magazine she thought was being pranked at the time. “I honest to God thought I had been ‘Punk’d,’” King, 69, to…", 
            "title": "Gayle King on Sports Illustrated Swimsuit cover: ‘I … thought I had been Punk’d’ - The Hill"
        }, 
        {
            "url": "https://www.cbsnews.com/news/biden-willing-debate-trump-twice/", 
            "description": "President Biden and former President Donald Trump will go head-to-head in presidential debates on June 27 and Sept. 10, their campaigns said Wednesday.", 
            "title": "Biden and Trump agree to presidential debates on June 27 and Sept. 10 - CBS News"
        }, 
        {
            "url": "https://bleacherreport.com/articles/10121164-nfl-schedule-release-2024-travel-mileage-totals-for-all-32-teams-ahead-of-reveal", 
            "description": "The Los Angeles Chargers will need to find a way to beat jet lag in 2024. The Chargers are set to undergo an NFL-high 36 time zone changes while traveling for…", 
            "title": "NFL Schedule Release 2024: Travel Mileage Totals for All 32 Teams Ahead of Reveal - Bleacher Report"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/15/europe/slovakia-prime-minister-fico-shooting-intl/index.html", 
            "description": "Slovakia’s Prime Minister Robert Fico was shot multiple times after a government meeting and is in a life-threatening condition, according to a statement posted on his official Facebook page.", 
            "title": "Slovakia’s Prime Minister Fico in life-threatening condition after being shot multiple times - CNN"
        }, 
        {
            "url": "https://www.reuters.com/world/asia-pacific/new-caledonia-riots-rage-after-paris-approves-voting-change-2024-05-15/", 
            "description": null, 
            "title": "Four dead in New Caledonia riots, France to declare state of emergency - Reuters"
        }, 
        {
            "url": "https://www.npr.org/2024/05/15/1251265727/un-gaza-death-toll-women-children", 
            "description": "Here's a closer look at the United Nations' breakdown of casualties. The overall total of more than 35,000 Palestinians killed since Oct. 7, based on Gaza Health Ministry figures, has not declined.", 
            "title": "Why U.N. lowered Gaza death toll for women and children - NPR"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://apnews.com/article/us-israel-arms-gaza-ebe971ca8878ff430ce6458c04151585", 
            "description": "The Biden administration has told key lawmakers it plans to move ahead on a more than $1 billion arms sales to Israel. That's according to three congressional aides who spoke of condition of anonymity to discuss an arms transfer that has not yet been made pub…", 
            "title": "Biden administration is moving ahead on new $1 billion arms sale to Israel, congressional aides say - The Associated Press"
        }, 
        {
            "url": "https://www.eonline.com/news/1401646/sophie-turner-breaks-silence-on-shocking-aftermath-of-joe-jonas-divorce", 
            "description": "Eight months after Sophie Turner and Joe Jonas' breakup, the Game of Thrones alum detailed the \"shocking\" aftermath that played out online and how Taylor Swift provided her a \"safe space.\"", 
            "title": "Sophie Turner Breaks Silence on \"Shocking\" Aftermath of Joe Jonas Divorce - E! Online - E! NEWS"
        }, 
        {
            "url": "https://www.nbcnews.com/nbc-out/out-news/united-methodists-scrap-anti-gay-bans-pastor-defied-seeks-reinstatemen-rcna152359", 
            "description": "Earlier this month, delegates at a United Methodist Church conference struck down the UMC’s longstanding anti-LGBTQ policies and created a path for clergy ousted because of them to seek reinstatement.", 
            "title": "United Methodists scrap their anti-gay bans. A pastor who defied them seeks reinstatement. - NBC News"
        }, 
        {
            "url": "https://www.reuters.com/markets/us/us-consumer-prices-rise-less-than-expected-april-core-cpi-slows-2024-05-15/", 
            "description": null, 
            "title": "US consumer inflation cools in April; retail sales flat - Reuters.com"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=BqFtou3vcVk", 
            "description": "On The Hoop Collective, Brian Windhorst and company talk through the “reliable connection” between the huge impact from the duo of Jalen Brunson and Miles “D...", 
            "title": "Jalen Brunson & Deuce McBride’s HUGE pick & roll impact for Knicks in Game 5 💪 | The Hoop Collective - ESPN"
        }, 
        {
            "url": "https://9to5mac.com/2024/05/15/as-m4-ipad-pro-arrives-joz-sets-the-record-straight-tablets-suck-and-ipads-dont/", 
            "description": "Happy M4 iPad Pro launch day! Whether you’re picking one up for yourself or dreaming about which configuration you’d order,...", 
            "title": "As M4 iPad Pro arrives, Joz sets the record straight: ‘tablets suck, and iPads don’t’ - 9to5Mac"
        }, 
        {
            "url": "https://www.apple.com/newsroom/2024/05/apple-announces-new-accessibility-features-including-eye-tracking/", 
            "description": "Apple today announced new accessibility features coming later this year, including Eye Tracking, Music Haptics, and Vocal Shortcuts.", 
            "title": "Apple announces new accessibility features, including Eye Tracking - Apple"
        }, 
        {
            "url": "https://www.washingtonpost.com/health/2024/05/15/cervical-cancer-hpv-screening-test/", 
            "description": "Women’s health advocates view the move as crucial to stamping out the preventable disease.", 
            "title": "FDA approves self-collection screening for virus that causes cervical cancer - The Washington Post"
        }, 
        {
            "url": "https://www.washingtonpost.com/politics/2024/05/15/michael-cohen-trump-trial-transcript/", 
            "description": "Cohen, a key witness in Donald Trump’s hush money trial, was grilled during cross-examination on past lies and his colorful insults of the former president.", 
            "title": "The lies and insults of Michael Cohen, from the Trump trial transcript - The Washington Post"
        }, 
        {
            "url": "https://sports.yahoo.com/welcome-to-the-wnba-caitlin-clarks-regular-season-debut-anything-but-easy-044525295.html", 
            "description": "Clark set the Indiana Fever’s franchise record for turnovers (10), shot 5-of-15 from the floor and struggled with the Connecticut Sun’s physical defense.", 
            "title": "Welcome to the WNBA: Caitlin Clark's regular-season debut is anything but easy - Yahoo Sports"
        }, 
        {
            "url": "https://www.oregonlive.com/shopping-deals/2024/05/restock-your-n95-kn95-face-masks-as-new-covid-19-variant-flirt-rises.html", 
            "description": "Whether you want to try and protect yourself against the new variant, or want to mask up in groups during summer events, there’s no time like the present to re-up your home supply of face masks.", 
            "title": "Restock your N95, KN95 face masks as new COVID-19 variant 'FLiRT' rises - The Seattle Times"
        }, 
        {
            "url": "https://nypost.com/2024/05/15/us-news/sun-shoots-out-biggest-solar-flare-in-almost-2-decades/", 
            "description": "The sun produced its biggest flare in nearly two decades Tuesday, just days after severe solar storms pummeled Earth and created dazzling northern lights in unaccustomed places.", 
            "title": "Sun shoots out biggest solar flare in almost 2 decades -- just days after solar storms pummeled Earth - New York Post "
        }, 
        {
            "url": "https://gizmodo.com/project-astra-hands-on-google-io-ai-assistant-1851477898", 
            "description": "Why bother pawing at your device when you can just talk to it and show it things?", 
            "title": "Google I/O: Hands-on With Project Astra, the AI Assistant of the Future - Gizmodo"
        }
    ], 
    "last_updated": "2024-05-16 19:30:14"
}