{
    "news": [
        {
            "url": "https://www.bbc.com/news/articles/c6pyv8q94g1o", 
            "description": "The attempt came during an attack on a town in the northeastern Kharkiv region, says the military.", 
            "title": "Ukraine says it repulsed Russian bid to cross border - BBC.com"
        }, 
        {
            "url": "https://finance.yahoo.com/news/sanofi-inks-1-2-billion-082615895.html", 
            "description": "(Bloomberg) -- Novavax Inc. shares surged after the company signed a $1.2 billion licensing agreement with Sanofi that includes commercializing a combined...", 
            "title": "Novavax Soars on $1.2 Billion Sanofi Vaccine Licensing Deal - Yahoo Finance"
        }, 
        {
            "url": "https://www.cbsnews.com/news/severe-geomagnetic-storm-watch-issued-unusual-solar-event/", 
            "description": "The sunspot responsible for the odd series of strong solar flares is so big you can see it with your own eyes from Earth.", 
            "title": "Rare severe geomagnetic storm watch issued for first time in nearly 20 years amid \"unusual\" solar event - CBS News"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/10/moderna-says-rsv-vaccine-fda-approval-delayed-to-end-of-may.html", 
            "description": "The FDA has not informed Moderna of any issues related to the vaccine's safety, efficacy or quality that would prevent its approval, the biotech company said.", 
            "title": "Moderna says FDA delayed RSV vaccine approval to end of May - CNBC"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-hush-money-stormy-daniels-cohen-ddef05884265e4d6217b55a89304b878", 
            "description": "The third week of testimony in Donald Trump’s hush money trial is drawing to a close. It comes after jurors heard the dramatic, if not downright seamy, account of Stormy Daniels’ alleged sexual encounter with the former president. Meanwhile, prosecutors are g…", 
            "title": "Trump hush money trial: Michael Cohen awaits turn after graphic Stormy Daniels account - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/10/sport/caitlin-clark-home-debut-indiana-fever-spt-intl/index.html", 
            "description": "More than 13,000 fans were in attendance as Caitlin Clark made her home preseason debut on Thursday in an 83-80 victory for the Indiana Fever over the Atlanta Dream.", 
            "title": "‘Pretty unheard of’: Caitlin Clark draws 13,000 in home preseason debut as Indiana Fever win 83-80 - CNN"
        }, 
        {
            "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/netflix-closes-is-on-stealing-christmas-games", 
            "description": "Negotiations for December 25 reportedly delayed schedule release.", 
            "title": "Netflix closes is on stealing Christmas games - NBC Sports"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy9hcnRpY2xlcy9jcDRnOXp6ZXFsMW_SATJodHRwczovL3d3dy5iYmMuY29tL25ld3MvYXJ0aWNsZXMvY3A0Zzl6emVxbDFvLmFtcA?oc=5", 
            "description": null, 
            "title": "Harry and Meghan: Duke and duchess arrive in Nigeria - BBC.com"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LnRoZWRwLmNvbS9hcnRpY2xlLzIwMjQvMDUvcGVubi1wYWxlc3RpbmUtZ2F6YS1wcm90ZXN0cy1hcnJlc3Rz0gEA?oc=5", 
            "description": null, 
            "title": "Police in riot gear arrest over one dozen protesters, including Penn students, at Gaza Solidarity Encampment - The Daily Pennsylvanian"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDI0LzUvMTAvMjQxNTM0MjEvb3BlbmFpLWNoYXRncHQtZ29vZ2xlLXNlYXJjaC1jb21wZXRpdG9yLXNlcnZpY2UtaW_SAQA?oc=5", 
            "description": null, 
            "title": "OpenAI could unveil its Google search competitor on Monday - The Verge"
        }, 
        {
            "url": "https://www.reuters.com/world/us/trump-prosecutors-prepare-call-final-witnesses-hush-money-trial-2024-05-10/", 
            "description": null, 
            "title": "Trump prosecutors prepare to call final witnesses in hush money trial - Reuters"
        }, 
        {
            "url": "https://abcnews.go.com/International/wireStory/caramelo-brazilian-horse-stranded-roof-floods-rescued-after-110086383", 
            "description": "A horse that was perilously stranded on a rooftop by Brazil's deadly floods has been rescued", 
            "title": "Caramelo, the Brazilian horse stranded on a roof by floods, is rescued after stirring the nation - ABC News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/10/middleeast/israel-sde-teiman-detention-whistleblowers-intl-cmd/index.html", 
            "description": "At a military base that now doubles as a detention center in Israel’s Negev desert, an Israeli working at the facility snapped two photographs of a scene that he says continues to haunt him.", 
            "title": "Israeli whistleblowers detail horror of shadowy detention facility for Palestinians - CNN"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3Lm5iY25ld3MuY29tL25vdy92aWRlby9qdXN0aW4tYW5kLWhhaWxleS1iaWViZXItYW5ub3VuY2UtcHJlZ25hbmN5LW9uLWluc3RhZ3JhbS0yMTA2MTc0MTM1NjHSATdodHRwczovL3d3dy5uYmNuZXdzLmNvbS9uZXdzL2FtcC12aWRlby9tbXZvMjEwNjE3NDEzNTYx?oc=5", 
            "description": null, 
            "title": "Justin and Hailey Bieber announce pregnancy on Instagram - NBC News"
        }, 
        {
            "url": "https://goodmorningamerica.com/culture/story/miss-usa-names-new-2023-titleholder-after-former-110085706", 
            "description": "The Miss USA pageant has named a successor to the Miss USA title after Noelia Voigt resigned on Monday.", 
            "title": "Miss USA names new 2023 titleholder after former winner resigned title - Good Morning America"
        }, 
        {
            "url": "https://www.indiatoday.in/health/story/a-30-year-long-harvard-study-reveals-ultra-processed-foods-linked-to-early-death-2537507-2024-05-10", 
            "description": "A 30-year study found that people who regularly consumed ultra-processed meats faced a 13 higher likelihood of premature death", 
            "title": "A 30-year-long Harvard study reveals ultra-processed foods linked to early death - India Today"
        }, 
        {
            "url": "https://www.reuters.com/world/uk/uk-economy-grows-by-06-first-quarter-ons-data-shows-2024-05-10/", 
            "description": "Britain's economy grew by the most in nearly three years in the first quarter of 2024, ending the shallow recession it entered in the second half of last year and delivering a boost to Prime Minister Rishi Sunak ahead of an election.", 
            "title": "UK exits recession with fastest growth in nearly three years - Reuters UK"
        }, 
        {
            "url": "https://www.thecrimson.com/article/2024/5/10/protesters-reject-proposal-encampment/", 
            "description": "Members of the pro-Palestine encampment rejected a proposal from interim University President Alan M. Garber ’76 to end their two-week occupation of Harvard Yard and avoid receiving involuntary leave of absence notices.", 
            "title": "Pro-Palestine Students Reject Harvard President's Proposal to End Encampment | News - Harvard Crimson"
        }, 
        {
            "url": "https://www.reuters.com/markets/deals/chinese-ev-maker-zeekr-prices-us-ipo-top-range-raise-441-million-source-says-2024-05-09/", 
            "description": null, 
            "title": "Exclusive: China's Zeekr prices US IPO at top of range to raise $441 million, source says - Reuters"
        }, 
        {
            "url": "https://www.bbc.com/news/world-middle-east-68980826", 
            "description": "Israeli leader says his country will \"stand alone\" and \"fight with fingernails\" if shipments are halted.", 
            "title": "Gaza war: Netanyahu says Israel can 'stand alone' if US halts arms shipments - BBC.com"
        }
    ], 
    "last_updated": "2024-05-11 16:39:17"
}