{
    "news": [
        {
            "url": "https://ew.com/nicki-minaj-arrested-amsterdam-airport-alleged-drug-possession-8654055", 
            "description": "Nicki Minaj recorded Dutch police officers arresting her for alleged drug possession at an Amsterdam airport.", 
            "title": "Nicki Minaj arrested at Amsterdam airport for alleged drug possession - Entertainment Weekly News"
        }, 
        {
            "url": "https://www.eonline.com/news/1402429/kourtney-kardashian-reacts-to-son-mason-disick-officially-joining-instagram", 
            "description": "Mason Disick, 14, officially joined Instagram and his mom Kourtney Kardashian and aunts Kim Kardashian and Khloe Kardashian had some thoughts. Find out what they said and see the teen's first posts.", 
            "title": "Kourtney Kardashian Reacts to Son Mason Officially Joining Instagram - E! NEWS"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c722qy5dzlgo", 
            "description": "The presumptive Republican nominee was loudly jeered while addressing the Libertarian convention.", 
            "title": "Donald Trump heckled and booed at Libertarian convention - BBC.com"
        }, 
        {
            "url": "https://www.bbc.com/sport/football/articles/crgg3l3563eo", 
            "description": "The future of manager Erik ten Hag will be discussed when senior figures at Manchester United begin conducting an end of season review this week.", 
            "title": "Manchester United: Erik ten Hag's future under discussion at club - BBC.com"
        }, 
        {
            "url": "https://abcnews.go.com/US/4-stabbed-massachusetts-movie-theater-suspect-arrested-police/story?id=110568595", 
            "description": "Four girls sustained non-life-threatening injuries, police said.", 
            "title": "4 stabbed in Massachusetts movie theater, suspect arrested, police say - ABC News"
        }, 
        {
            "url": "https://variety.com/2024/film/box-office/global-box-office-furiosa-stalls-garfield-movie-nears-100-million-1236016790/", 
            "description": "\"Furiosa\" stalls at the global box office while \"The Garfield Movie\" nears the $100 million mark.", 
            "title": "Global Box Office: ‘Furiosa’ Stalls With $58 Million, ‘The Garfield Movie’ Nears $100 Million - Variety"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/26/world/qatar-airways-turbulence-dublin-injured-intl/index.html", 
            "description": "Six passengers and six cabin crew were injured after a Qatar Airways flight from Doha to Dublin was hit with turbulence on Sunday.", 
            "title": "12 people injured during turbulence on Qatar Airways flight - CNN"
        }, 
        {
            "url": "https://apnews.com/article/tornadoes-weather-texas-oklahoma-93001e1d81f120d0d55c8dfa24938250", 
            "description": "Powerful storms have killed at least 11 people and left a wide trail of destruction across Texas, Oklahoma and Arkansas. The weather obliterated homes and destroyed a truck stop where drivers took shelter during the latest deadly weather to strike the central…", 
            "title": "Severe weather: More than 10 dead across Texas, Oklahoma, Arkansas - The Associated Press"
        }, 
        {
            "url": "http://9to5google.com/2024/05/26/google-search-ai-overviews-helpful/", 
            "description": "Google Search has AI now, but it's not helpful in its current form. That said, Google already knows how to make it helpful.", 
            "title": "Google Search AI can be helpful, just not with Overviews - 9to5Google"
        }, 
        {
            "url": "https://www.espn.com/golf/story/_/id/40222743/family-reveals-pga-tour-golfer-grayson-murray-died-suicide", 
            "description": "PGA Tour golfer Grayson Murray died by suicide, his family said Sunday. \"Life wasn't always easy for Grayson,\" his parents said. \"... We know he rests peacefully now.\"", 
            "title": "Family says PGA Tour golfer Grayson Murray died by suicide - ESPN"
        }, 
        {
            "url": "https://thehill.com/homenews/house/4686828-pennsylvania-democrat-madeleine-dean-samuel-alito-flag-controversy-wife/", 
            "description": "Rep. Madeleine Dean (D-Pa.) in a Sunday interview blasted Supreme Court Justice Samuel Alito for blaming his wife for displaying the upside-down flag outside his home in the days following the Jan. 6, 2021, attack on the Capitol. In an interview on NewsNation…", 
            "title": "Pennsylvania Democrat blasts Alito for blaming flag controversy on his wife - The Hill"
        }, 
        {
            "url": "https://www.nbcnews.com/news/sports/ferraris-charles-leclerc-wins-home-f1-race-monaco-breaking-curse-rcna154113", 
            "description": "Ferrari's Charles Leclerc won the Monaco Grand Prix on Sunday with a flawless lights-to-flag victory, securing one of the most coveted trophies in Formula 1 for the first time in his career.", 
            "title": "Ferrari's Charles Leclerc wins home F1 race in Monaco, breaking the 'curse' - NBC News"
        }, 
        {
            "url": "https://www.wlwt.com/article/cincinnati-severe-weather-sunday-tornadoes-forecast/60906366", 
            "description": "A WLWT Weather Alert Day is in place due to severe storms that could produce tornadoes, damaging wind and hail.", 
            "title": "Severe weather threat brings chance for hail, strong winds, tornadoes - WLWT Cincinnati"
        }, 
        {
            "url": "https://www.ky3.com/2024/05/26/viewer-pictures-storms-damage-homes-trees-power-lines-throughout-ozarks-sunday/", 
            "description": "Strong storms rolled through the Ozarks on Sunday morning.", 
            "title": "VIEWER PICTURES: Storms damage homes, trees, & power lines throughout the Ozarks on Sunday - KY3"
        }, 
        {
            "url": "https://www.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-05-26-24/index.html", 
            "description": "Rockets were fired at Tel Aviv on Sunday for the first time in months, according to the Israeli military. It comes as Israel faces unprecedented diplomatic pressure over its war in Gaza. Follow for live updates.", 
            "title": "Rockets fired at Tel Aviv as Israel's war in Gaza rages: Live updates - CNN"
        }, 
        {
            "url": "https://www.thestreet.com/investing/stocks/veteran-fund-manager-reboots-nvidia-stock-price-target-after-earning", 
            "description": "Here's what could happen next to Nvidia shares.", 
            "title": "Veteran fund manager revises Nvidia stock price target after earnings - TheStreet"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=jkW2OJm_E5E", 
            "description": "Debris likely linked to a SpaceX Dragon spacecraft fell on a Saskatchewan farmer's field earlier this year and after being discovered last month, it left peo...", 
            "title": "Space junk fell on a Canadian farm and SpaceX wants it back, but who's liable? - Global News"
        }, 
        {
            "url": "https://www.nj.com/weather/2024/05/nj-weather-rain-and-thunderstorms-expected-for-memorial-day.html", 
            "description": "Forecasters are calling for two rounds of rainy weather for the holiday, with thunderstorms possible.", 
            "title": "N.J. weather: Rain and thunderstorms expected for Memorial Day - NJ.com"
        }, 
        {
            "url": "https://decrypt.co/232386/ethereum-etf-approval-shifts-power-politics-joseph-lubin-consensys", 
            "description": "The Consensys CEO believes the week’s seismic events have proven that politics is guiding crypto regulation now—and that’s good news for the industry.", 
            "title": "ETF Approval Changes Everything, Says Ethereum Co-Founder Joe Lubin - Decrypt"
        }, 
        {
            "url": "https://www.digitaltrends.com/mobile/it-took-me-8-months-to-try-out-this-fantastic-ios-17-feature/", 
            "description": "I had forgotten about iOS 17's StandBy feature, then the right piece of hardware came along and reminded me how fantastic it is.", 
            "title": "It took me 8 months to try out this fantastic iOS 17 feature - Digital Trends"
        }
    ], 
    "last_updated": "2024-05-27 21:08:07"
}