{
    "news": [
        {
            "url": "https://www.eonline.com/news/1402049/jennifer-lopez-briefly-brings-up-ben-affleck-amid-split-rumors", 
            "description": "While neither Jennifer Lopez nor Ben Affleck have publicly commented on where their marriage stands, the singer did quickly mention the Oscar winner during her recent interview with Jimmy Kimmel.", 
            "title": "Jennifer Lopez Briefly Brings Up Ben Affleck Amid Split Rumors - E! NEWS"
        }, 
        {
            "url": "https://www.washingtonpost.com/weather/2024/05/21/tornado-thunderstorm-midwest-severe-weather/", 
            "description": "Widespread damaging winds and tornadoes are possible across Midwest regions from Kansas City to Milwaukee today, with moderate risk across much of Iowa.", 
            "title": "Tornadoes, severe storms possible across Midwest: See maps of risk areas - The Washington Post"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/21/24161688/microsoft-windows-copilot-runtime-build-2024", 
            "description": "Microsoft wants developers to build Windows AI apps. A new Copilot Runtime is designed to make the process of building AI-powered apps a lot easier.", 
            "title": "Microsoft's new Windows Copilot Runtime aims to win over AI developers - The Verge"
        }, 
        {
            "url": "https://www.nbcnews.com/politics/2024-election/primary-elections-today-what-know-rcna152830", 
            "description": "Four states are holding primaries Tuesday, while California voters will select a replacement for former Speaker Kevin McCarthy, giving Republicans a little more breathing room in the House.", 
            "title": "Kevin McCarthy's replacement and down-ballot drama: What to watch for in Tuesday's elections - NBC News"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/21/biden-takes-credit-for-target-grocery-price-cuts.html", 
            "description": "Target announced price cuts on roughly 5,000 items, which Biden says is because of his administration's pressure campaign.", 
            "title": "Biden takes credit for Target grocery price cuts: 'They're answering the call' - CNBC"
        }, 
        {
            "url": "https://www.cbsnews.com/boston/news/karen-read-live-stream-today-murder-trial-day-15/", 
            "description": "Testimony at the Karen Read murder trial was entirely focused on the cross-examination of Jennifer McCabe Tuesday.", 
            "title": "Karen Read murder trial testimony features contentious cross-examination of Jennifer McCabe - CBS Boston"
        }, 
        {
            "url": "https://apnews.com/article/arizona-fake-electors-charges-2020-presidential-election-4987d0774412d95a3dac007e81d5c157", 
            "description": "Former New York City Mayor Rudy Giuliani pleaded not guilty Tuesday to nine felony charges stemming from his role in an effort to overturn Donald Trump’s 2020 election loss in Arizona to Joe Biden. Giuliani appeared remotely for the arraignment that was held …", 
            "title": "Ex-NYC Mayor Rudy Giuliani pleads not guilty to felony charges in Arizona election interference case - The Associated Press"
        }, 
        {
            "url": "https://apnews.com/article/graceland-auction-elvis-presley-359098fd64877f2e826b7309dba2bbb3", 
            "description": "The granddaughter of Elvis Presley is fighting an attempt to publicly auction his Graceland estate in Memphis. A lawsuit from Presley's granddaughter Riley Keough alleges that a company’s claims that the king of rock ’n’ roll’s former home was used as collate…", 
            "title": "Elvis' granddaughter Riley Keough fights Graceland estate auction - The Associated Press"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/21/24161650/pixar-layoffs-disney-cost-cutting", 
            "description": "Disney’s layoffs have now impacted Inside Out studio Pixar, which has cut 14 percent of its workforce as it shifts its focus back to feature films and away from streaming series.", 
            "title": "Pixar cuts 14 percent of workforce, shifts focus back to feature films - The Verge"
        }, 
        {
            "url": "https://www.reuters.com/technology/cryptocurrencies-gain-investors-turn-optimistic-ether-etfs-2024-05-21/", 
            "description": "Ether was set for its largest two-day gain in nearly two years on Tuesday amid speculation about the outcome of applications for U.S. spot exchange-traded funds that track the world's second-biggest cryptocurrency, while bitcoin also approached a record high.", 
            "title": "Cryptocurrencies gain as investors turn optimistic on ether ETFs - Reuters"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/21/world/singapore-airlines-turbulence-bangkok/index.html", 
            "description": "One person has died on board a Singapore Airlines flight that the airline said Tuesday encountered severe turbulence on a flight from London to Singapore.", 
            "title": "One dead after severe turbulence hits Singapore Airlines flight - CNN"
        }, 
        {
            "url": "https://www.ign.com/articles/microplastics-found-in-every-human-testicle-examined-in-new-study", 
            "description": "Scientists have discovered significant quantities of microplastics present in human and canine testicles, raising concerns around the potential impact of the pollutant on the human reproductive system.", 
            "title": "Microplastics Found in Every Human Testicle Examined in New Study - IGN"
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-69041617", 
            "description": "On Monday, witness Robert Costello appeared frustrated on the stand, glaring at the judge.", 
            "title": "Trump trial: Judge reprimands Trump witness Robert Costello over groans - BBC.com"
        }, 
        {
            "url": "https://finance.yahoo.com/news/microsoft-unveils-gpt-4o-for-azure-new-ai-apps-in-fight-against-google-amazon-153044478.html", 
            "description": "Microsoft debuted a litany of new AI offerings as part of its Build developer conference as its fight with Google and Amazon continues to heat up.", 
            "title": "Microsoft unveils GPT-4o for Azure, new AI apps in fight against Google, Amazon - Yahoo Finance"
        }, 
        {
            "url": "https://www.espn.com/nfl/story/_/id/40190812/police-man-want-rashee-rice-charged-alleged-assault", 
            "description": "The injured person in an alleged May 6 assault at a Dallas nightclub in which Kansas City Chiefs wide receiver Rashee Rice is reportedly a suspect has asked police not to file charges, according to police.", 
            "title": "Cops: Man doesn't want Rice charged for assault - ESPN"
        }, 
        {
            "url": "https://apnews.com/article/trump-election-2024-rhetoric-germany-antisemitism-31002afb91b642c0314223d19e51f427", 
            "description": "It’s now been taken down, but a video posted to Donald Trump’s account on his social media network included references to a “unified Reich.” The headline appears among messages flashing across the screen such as “Trump wins!!” Other headlines appear to be ref…", 
            "title": "Trump campaign video includes references to a 'unified Reich' - The Associated Press"
        }, 
        {
            "url": "https://wccftech.com/senuas-saga-hellblade-ii-performance-analysis-xbox-series-x-can-not-maintain-30fps/", 
            "description": "Senua's Saga: Hellblade II is only 30fps on Xbox Series X/S, but at least it's a consistent 30fps, right? Well, about that...", 
            "title": "Senua’s Saga: Hellblade II Can’t Consistently Maintain its 30fps Target on Xbox Series X/S - Wccftech"
        }, 
        {
            "url": "https://www.nbcnews.com/tech/sag-aftra-applauds-scarlett-johansson-rebuking-openai-voice-sounded-rcna153256", 
            "description": "SAG-AFTRA, the union that represents Hollywood actors, commended Scarlett Johansson for calling out OpenAI for using a voice that sounded \"eerily similar\" to hers.", 
            "title": "SAG-AFTRA applauds Scarlett Johansson for rebuking OpenAI over voice that sounded like her - NBC News"
        }, 
        {
            "url": "https://kdvr.com/news/colorado/us-news-2-colorado-cities-make-top-10-best-places-to-live/", 
            "description": "A new report found 150 of the best cities to live in, and two Colorado cities were named among the top 10.", 
            "title": "US News: 2 Colorado cities make top 10 best places to live - FOX 31 Denver"
        }, 
        {
            "url": "https://www.nbcnews.com/politics/2024-election/trump-shares-video-unified-reich-social-media-rcna153214", 
            "description": "Former President Donald Trump's account shared a video on social media Monday that referred to a \"unified Reich\" among possible developments if he were to win re-election in November, drawing criticism from the Biden campaign.", 
            "title": "Trump shares video referencing 'unified Reich' to social media - NBC News"
        }
    ], 
    "last_updated": "2024-05-22 22:30:27"
}