{
    "news": [
        {
            "url": "https://sports.yahoo.com/live/pga-championship-round-3-live-updates-leaderboard-will-anyone-catch-xander-schauffele-on-moving-day-125427340.html", 
            "description": "Xander Schauffele holds a one-shot lead entering play on Saturday at Valhalla.", 
            "title": "PGA Championship Round 3 live updates, leaderboard: Will anyone catch Xander Schauffele on Moving Day? - Yahoo Sports"
        }, 
        {
            "url": "https://www.washingtonpost.com/dc-md-va/2024/05/18/virginia-youngkin-vetoes-skill-games-confederate-contraception/", 
            "description": "Many of the vetoes were related to culture-war issues that could play into this fall’s presidential and congressional contests.", 
            "title": "Va. Gov. Youngkin vetoes bills on birth control, Confederate tax loopholes - The Washington Post"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/17/europe/hostages-recovered-gaza-idf-intl/index.html", 
            "description": "The Israeli military announced Saturday that it had recovered the body of a hostage from the Gaza Strip, one day after saying it had retrieved the remains of three others in the besieged territory.", 
            "title": "IDF recovers hostage’s body from Gaza one day after retrieving three others - CNN"
        }, 
        {
            "url": "https://www.cbsnews.com/news/american-majd-kamalmaz-syria-texas-disappeared-presumed-dead/", 
            "description": "Maryam Kamalmaz told the Associated Press that eight senior U.S. officials revealed earlier this month that they have specific and highly credible intelligence about the presumed death of her father, Majd.", 
            "title": "American who disappeared in Syria in 2017 presumed dead, daughter says - CBS News"
        }, 
        {
            "url": "https://www.usatoday.com/story/sports/horseracing/2024/05/18/preakness-stakes-2024-live-updates/73712613007/", 
            "description": "Mystik Dan has an opportunity to secure the second leg of the Triple Crown with a win on Saturday night. Here's what to know about the 2024 Preakness.", 
            "title": "Preakness Stakes 2024 live updates: Time, TV, odds, results and more from Triple Crown race - USA TODAY"
        }, 
        {
            "url": "https://www.cbssports.com/boxing/news/tyson-fury-vs-oleksandr-usyk-fight-predictions-odds-undercard-preview-start-time-expert-picks/", 
            "description": "The undisputed heavyweight title is on the line in Saudi Arabia when these two behemoths meet", 
            "title": "Tyson Fury vs. Oleksandr Usyk fight predictions, odds, undercard, preview, start time, expert picks - CBS Sports"
        }, 
        {
            "url": "https://www.courier-journal.com/story/news/local/2024/05/18/scottie-scheffler-arrest-louisville-mayor-says-no-body-cam-of-incident/73748175007/", 
            "description": null, 
            "title": "Scottie Scheffler arrest: Louisville mayor says no body cam of incident - Courier Journal"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/18/upside-down-flag-at-justice-alitos-home-another-blow-for-supreme-court-under-fire-00158772", 
            "description": null, 
            "title": "Controversy over upside-down flag at Justice Alito's home another blow for Supreme Court under fire - POLITICO"
        }, 
        {
            "url": "http://9to5google.com/2024/05/18/google-pixel-9-wallpapers-leak/", 
            "description": "Ahead of their expected launch later this year, the wallpapers for the entire Google Pixel 9 series have leaked with...", 
            "title": "Pixel 9 series wallpapers leak with 'Swirling Petals' design - 9to5Google"
        }, 
        {
            "url": "https://variety.com/2024/film/box-office/if-opening-day-ryan-reynolds-strangers-chapter-1-1236008141/", 
            "description": "Ryan Reynolds and John Krasinski's imaginary friends comedy \"IF\" will open atop domestic charts, while \"The Strangers: Chapter 1\" also debuts.", 
            "title": "Box Office: ‘IF’ Stumbles on Opening Day With $10.3 Million, ‘The Strangers: Chapter 1’ Unmasking Third Place - Variety"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.politico.eu/article/fico-shot-slovak-pm-positive-prognosis/", 
            "description": "Fico underwent a second surgery on Friday to save his life after he was shot 4 times on Wednesday.", 
            "title": "Slovak PM Fico has 'positive prognosis' as his attacker appears in court for first time - POLITICO Europe"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/17/entertainment/sean-combs-cassie-ventura/index.html", 
            "description": "A 2016 surveillance video obtained exclusively by CNN shows Sean “Diddy” Combs grab, shove, drag and kick his then-girlfriend Cassie Ventura during an altercation that matches allegations in a now-settled federal lawsuit filed by Ventura in November.", 
            "title": "Exclusive: Sean ‘Diddy’ Combs seen physically assaulting Cassie Ventura in 2016 surveillance video obtained by CNN - CNN"
        }, 
        {
            "url": "https://www.space.com/nasa-prefire-polar-climate-cubesats", 
            "description": "Heat emissions from Earth's poles are something we know surprisingly little about.", 
            "title": "NASA's PREFIRE mission is ready to unlock the mysteries of Earth's poles - Space.com"
        }, 
        {
            "url": "https://apnews.com/article/houston-texas-storms-power-outages-86643a6d7decd28e971774e03b52e51d", 
            "description": "As the Houston area works to clean up and restore power to hundreds of thousands after deadly storms left at least seven people dead, it will do so amid a smog warning and rising Texas heat. The National Weather Service in Houston warned people to know the sy…", 
            "title": "Houston weather: 7 dead as storm power outages raise heat risk - The Associated Press"
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-16/boeing-chairman-mollenkopf-seeking-next-ceo-steps-into-spotlight", 
            "description": "As Boeing's board searches for a CEO to steer it out of its worst crisis in years, directors are intent on finding a leader who can make a fresh start. Deep aerospace experience isn't necessarily required.", 
            "title": "Boeing's low-key board chair steps into the spotlight with CEO hunt - The Seattle Times"
        }, 
        {
            "url": "https://www.thestreet.com/investing/stocks/nvidia-earnings-are-key-to-market-zeitgeist", 
            "description": "The S&P 500 has powered to an all-time high and faces a key test.", 
            "title": "Nvidia earnings will be crucial to stock market zeitgeist this week - TheStreet"
        }, 
        {
            "url": "https://www.reuters.com/world/australians-stranded-new-caledonia-running-out-food-amid-civil-unrest-2024-05-18/", 
            "description": null, 
            "title": "Australians stranded in New Caledonia 'running out of food' amid civil unrest - Reuters"
        }, 
        {
            "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/18/aoc-john-fetterman-jerry-springer/73747073007/", 
            "description": "Rep. Alexandria Ocasio-Cortez, D-N.Y., knocked Sen. John Fetterman, D-Pa., for comparing a House Oversight Committee to The Jerry Springer Show.", 
            "title": "AOC knocks Fetterman after fight with MTG: 'I stand up to bullies, instead of becoming one.' - USA TODAY"
        }, 
        {
            "url": "https://www.ft.com/content/ab18441b-f302-41e6-b825-4b7ffc778f28", 
            "description": "President has shed support among Black voters who helped him defeat Trump in battleground state in 2020", 
            "title": "'The house is on fire': Democrats fear Biden is losing pivotal Georgia - Financial Times"
        }
    ], 
    "last_updated": "2024-05-19 21:30:24"
}