{
    "news": [
        {
            "url": "https://www.washingtonpost.com/technology/2024/05/14/tiktok-creators-lawsuit-ban/", 
            "description": "The lawsuit is the second major legal challenge to a new law that could lead to the video app’s nationwide ban.", 
            "title": "TikTok creators sue to block law that could lead to a ban - The Washington Post"
        }, 
        {
            "url": "https://www.yahoo.com/news/live/trump-trial-updates-michael-cohen-faces-cross-examination-on-2nd-day-of-testimony-134850119.html", 
            "description": "The former president’s criminal hush money trial resumes Tuesday in Manhattan, where his former lawyer and so-called fixer is expected to take the stand for ...", 
            "title": "Trump trial updates: Michael Cohen faces cross-examination on 2nd day of testimony - Yahoo! Voices"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/14/amc-news-roaring-kitty-meme-stock-rally-may-help-with-debt-payments.html", 
            "description": "The last time these retail investors rallied around AMC, it avoided bankruptcy. Now, it has a chance to put a dent in its substantial debt load.", 
            "title": "AMC's meme stock windfall may help it pay down a massive debt load - CNBC"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/14/24156630/google-ai-io-musician-marc-rebillet-musicfx-dj", 
            "description": "Improvisational artist Marc Rebillet kicked off Google’s I/O event this year by crawling out of a giant coffee mug and hosting a live mini-gig using the MusicFX DJ tool.", 
            "title": "Watch this screaming, rainbow-clad musician demo Google's AI DJ - The Verge"
        }, 
        {
            "url": "https://spaceflightnow.com/2024/05/14/live-coverage-spacex-to-launch-starlink-satellites-on-falcon-9-flight-from-vandenberg-space-force-base/", 
            "description": null, 
            "title": "SpaceX launches 50th Falcon 9 rocket of 2024 on Starlink mission – Spaceflight Now - Spaceflight Now"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://finance.yahoo.com/news/live/stock-market-today-meme-rally-roars-as-stocks-stay-muted-in-inflation-countdown-145427785.html", 
            "description": "Meme stocks soared again as US equities more broadly stayed muted in the countdown to fresh inflation data and a Jerome Powell speech.", 
            "title": "Stock market today: Meme rally roars as stocks stay muted in inflation countdown - Yahoo Finance"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.bbc.com/news/av/world-us-canada-69012607", 
            "description": "A new top dog will be crowned Tuesday night after more than 2,500 contestants vied for the spot.", 
            "title": "See the furry finalists at the Westminster Dog Show - BBC.com"
        }, 
        {
            "url": "https://gizmodo.com/google-io-gemini-ai-android-circle-to-search-1851474146", 
            "description": "From homework help to scam detection, Google introduced new features to Gemini AI on the first day of Google I/O 2024.", 
            "title": "Google I/O: Here Are the Big Features Coming to Gemini AI for Android - Gizmodo"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/14/style/alice-munro-dies-92-author-obituary/index.html", 
            "description": "The Nobel Literature Prize winner was best known for her mastery of short stories and depictions of womanhood in rural settings.", 
            "title": "Alice Munro, Nobel Prize winner and ‘master of the short story,’ dies at 92 - CNN"
        }, 
        {
            "url": "https://searchengineland.com/new-google-search-ai-features-to-help-you-plan-research-and-learn-440468", 
            "description": "New features include AI Overviews, multistep reasoning capabilities, planning capabilities, AI-organized search results, and a new Google Lens ask with video feature.", 
            "title": "New Google Search AI features to help you plan, research and learn - Search Engine Land"
        }, 
        {
            "url": "https://www.washingtonpost.com/weather/2024/05/14/kansas-city-air-quality-canada-wildfire-smoke/", 
            "description": "The flow of Canadian wildfire smoke into the Midwest means that Kansas City, Kan., has the distinction of having the worst air quality in the United States.", 
            "title": "Canada wildfire smoke puts Kansas City, Kansas air quality among U.S. worst - The Washington Post"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=5p6ki2YUc7o", 
            "description": "Brian Windhorst joins The Pat McAfee Show to discuss LeBron James' appearance at the Cleveland Cavaliers game, potential of playing with Bronny and the Dalla...", 
            "title": "Windy breaks down LeBron in Cleveland, Bronny at the Draft Combine & more! | The Pat McAfee Show - ESPN"
        }, 
        {
            "url": "https://www.aljazeera.com/program/newsfeed/2024/5/14/israelis-tearful-plea-decrying-gaza-aid-convoy-attacks", 
            "description": "An Israeli human rights lawyer interrupts interview with tearful plea condemning Israel’s war on Gaza.", 
            "title": "Israeli’s tearful plea decrying Gaza aid convoy attacks - Al Jazeera English"
        }, 
        {
            "url": "https://www.miamiherald.com/news/local/crime/article288488471.html", 
            "description": "A boat docked behind a Coral Gables home was seized by the FWC Tuesday. Investigators say the boat was involved in crash that killed Ella Adler, 15, a Ransom Everglades freshman, off Key Biscayne.", 
            "title": "Boat involved in crash that killed 15-year-old near Key Biscayne has been located, FWC says - Miami Herald"
        }, 
        {
            "url": "https://www.space.com/boeing-starliner-cft-launch-delay-helium-leak", 
            "description": "Starliner's crewed debut had been targeted for Friday (May 17).", 
            "title": "Helium leak delays 1st astronaut launch of Boeing's Starliner to May 21 - Space.com"
        }, 
        {
            "url": "https://www.cbsnews.com/news/orcas-sink-yacht-again-strait-of-gibraltar-orcas-spain-morocco/", 
            "description": "An unknown number of orcas managed to sink another sailing yacht near coastal Morocco in the Strait of Gibraltar.", 
            "title": "Killer whales attack and sink sailing yacht in the Strait of Gibraltar — again - CBS News"
        }, 
        {
            "url": "https://apnews.com/article/bus-accident-florida-fatalities-e9693eb05f1f920cb20b166413d91d79", 
            "description": "The Florida Highway Patrol says a bus carrying farmworkers in central Florida has overturned, killing eight people and injuring another 40 passengers. Authorities say the bus was transporting 53 farmworkers early Tuesday morning when it collided with a truck …", 
            "title": "8 dead, dozens injured in farmworkers bus crash in central Florida - The Associated Press"
        }, 
        {
            "url": "https://www.axios.com/2024/05/14/mike-johnson-new-york-trump-criminal-trial", 
            "description": null, 
            "title": "Mike Johnson defends Trump outside N.Y. criminal trial - Axios"
        }
    ], 
    "last_updated": "2024-05-15 23:38:32"
}