{
    "news": [
        {
            "url": "https://www.cnn.com/2024/05/27/us/va-tech-company-doj-penalty-reaj/index.html", 
            "description": "A Virginia company, Arthur Grand Technologies Inc., will pay a $7,500 civil penalty after being fined by the Department of Justice over a discriminatory job posting.", 
            "title": "Virginia technology company to pay civil penalty over discriminatory ‘Whites only’ job posting, according to DOJ - CNN"
        }, 
        {
            "url": "https://www.cbsnews.com/boston/news/amc-massachusetts-stabbing-security-review/", 
            "description": "A spokesperson for movie theater chain AMC said the company is reviewing security policies and will have extra measures in place after four girls were stabbed in Braintree.", 
            "title": "AMC conducting review after 4 girls randomly stabbed inside Massachusetts movie theater - CBS Boston"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/27/north-korea-rocket-explosion-00160061", 
            "description": null, 
            "title": "North Korean rocket carrying its 2nd spy satellite explodes in mid-air - POLITICO"
        }, 
        {
            "url": "https://local12.com/news/nation-world/black-bear-kebabs-gives-family-parasitic-worms-3-people-hospitalized-infected-meat-wild-game-cdc-parasites-worm-disease-control-prevention-saskatchewan-hunted-frozen-thawed-cooked-roundworm-infections-mild-severe-symptoms-life-threatening-cooked-properly", 
            "description": "The meat was originally harvested in the Canadian province of Saskatchewan and frozen for 45 days before it was thawed.", 
            "title": "Black bear 'kebabs' gives family parasitic worms, 3 people hospitalized - WKRC TV Cincinnati"
        }, 
        {
            "url": "https://www.cbssports.com/nba/news/bill-walton-dies-at-71-julius-erving-kareem-abdul-jabbar-sports-world-react-to-hall-of-famers-passing/", 
            "description": "Walton, a two-time NBA champion, died Monday following a battle with cancer", 
            "title": "Bill Walton dies at 71: Julius Erving, Kareem Abdul-Jabbar, sports world react to Hall of Famer's passing - CBS Sports"
        }, 
        {
            "url": "https://www.espn.com/mlb/story/_/id/40230155/cubs-craig-counsell-booed-brewers-fans-milwaukee-return", 
            "description": "Craig Counsell, who is in his first year managing the Cubs after 18 seasons with the Brewers as a player and manager, was booed in his first return to Milwaukee.", 
            "title": "Cubs' Craig Counsell booed by Brewers fans in Milwaukee return - ESPN"
        }, 
        {
            "url": "https://pagesix.com/2024/05/27/parents/paris-hilton-and-daughter-london-match-in-pink-during-family-vacation-to-hawaii/", 
            "description": "Hilton rocked a light pink T-shirt that read “PARIS” in rhinestones with matching shorts, while London wore a pink onesie emblazoned with rainbows, hearts and stars.", 
            "title": "Paris Hilton and daughter London match in pink during family vacation to Hawaii - Page Six"
        }, 
        {
            "url": "https://www.yahoo.com/news/pope-used-vulgar-italian-word-192422008.html", 
            "description": null, 
            "title": "Pope used vulgar Italian word to refer to LGBT people, Italian newspapers report - Yahoo! Voices"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/26/entertainment/johnny-wactor-shot/index.html", 
            "description": "Former “General Hospital” actor Johnny Wactor was fatally shot in downtown Los Angeles while interrupting thieves Saturday, according to his agent and CNN affiliate KABC.", 
            "title": "Johnny Wactor: Former ‘General Hospital’ actor fatally shot in Los Angeles - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/27/sport/mike-tyson-medical-episode-flight/index.html", 
            "description": "Hall of Fame boxer Mike Tyson is “doing great” after a medical episode Sunday on a flight from Miami to Los Angeles, his representative told to CNN.", 
            "title": "Boxer Mike Tyson is ‘doing great’ after medical episode during a cross-country flight, rep says - CNN"
        }, 
        {
            "url": "https://www.4029tv.com/article/sanders-womack-boozman-touring-storm-damage/60915941", 
            "description": "Arkansas' elected officials are meeting with local officials and cleanup crews", 
            "title": "Gov. Sanders, Rep. Womack, Sen. Boozman in Rogers touring storm damage - 4029tv"
        }, 
        {
            "url": "https://www.usatoday.com/story/news/nation/2024/05/27/19-dead-tornadoes-memorial-day-storms-texas-arkansas-oklahoma/73868079007/", 
            "description": "Texas, Oklahoma, Arkansas and Kentucky were hit with a wave of tornadoes and severe weather that left at least 22 people dead on Memorial Day weekend.", 
            "title": "Tornadoes, bad weather as severe storms move east on Memorial Day - USA TODAY"
        }, 
        {
            "url": "https://www.teslarati.com/spacex-announces-next-starship-test-flight-date/", 
            "description": "SpaceX's Starship will one day transport human life to other planets.", 
            "title": "SpaceX announces next Starship test flight date - TESLARATI"
        }, 
        {
            "url": "https://abc30.com/post/passenger-united-flight-fresno-measles-officials-confirm/14878374/", 
            "description": "A passenger on a flight to Fresno was confirmed to be traveling with measles, according to LA County health officials.", 
            "title": "Passenger on United flight to Fresno had measles, officials confirm - KFSN-TV"
        }, 
        {
            "url": "https://www.foxnews.com/politics/biden-visits-daughter-law-home-her-expected-testimony-hunter-biden-trial", 
            "description": "President Biden visits the home of the wife of his late son Beau Biden on Sunday. Hallie Biden is expected to testify in Hunter Biden's gun trial.", 
            "title": "Biden visits daughter-in-law's home ahead of her expected testimony in Hunter Biden trial - Fox News"
        }, 
        {
            "url": "https://abcnews.go.com/US/memorial-day-weather-rain-east-coast-scorching-heat/story?id=110582356", 
            "description": "Temperatures are expected to climb in parts of Texas, Louisiana and Florida.", 
            "title": "Memorial Day weather: Rain along the East Coast and scorching heat in the Gulf - ABC News"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/richard-dreyfuss-slammed-jaws-screening-comments-1235909509/", 
            "description": "The Massachusetts theater that hosted the actor has apologized for his remarks, writing in a statement, \"We deeply regret the distress that this has caused to many of our patrons.“", 
            "title": "Richard Dreyfuss Slammed for Alleged Sexist and Homophobic Comments at ‘Jaws’ Screening - Hollywood Reporter"
        }, 
        {
            "url": "https://www.washingtonpost.com/world/2024/05/27/taiwan-meeting-congress-china/", 
            "description": "The meeting by a bipartisan delegation from Washington occurred as China heightens demands for the United States to back away from support for the island democracy.", 
            "title": "U.S. lawmakers ignore China warning, meet with Taiwan's new leader - The Washington Post"
        }, 
        {
            "url": "https://nypost.com/2024/05/27/us-news/libertarians-nominate-chase-oliver-for-president/", 
            "description": "Libertarians have crowned former Georgia Senate hopeful Chase Oliver as their 2024 presidential standard bearer after a grueling eight hours of voting at their convention over the weekend.", 
            "title": "Libertarians nominate Chase Oliver for president -- rejecting Trump, RFK Jr. - New York Post "
        }, 
        {
            "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-27-2024-7b743a848ef8bfbe69a9659a4a5dd047", 
            "description": "Israeli Prime Minister Benjamin Netanyahu acknowledged that a “tragic mistake” was made after an Israeli strike in the southern Gaza city of Rafah set fire to a tent camp housing displaced Palestinians. Local officials say at least 45 people were killed in Su…", 
            "title": "Israel-Hamas war: Netanyahu acknowledges ‘tragic mistake’ in strike on Rafah that killed dozens - The Associated Press"
        }
    ], 
    "last_updated": "2024-05-29 00:49:25"
}