{
    "news": [
        {
            "url": "https://apnews.com/article/trump-trial-hush-money-michael-cohen-ec08be1219703deb3cd10604844deacb", 
            "description": "Donald Trump's lawyers are pressing former attorney Michael Cohen on his criminal history and past lies as they work to convince jurors not to believe the star witness’ pivotal testimony in the hush money trial. Cohen was back in the hot seat Thursday a third…", 
            "title": "Trump hush money trial: Defense lawyers question Michael Cohen's credibility - The Associated Press"
        }, 
        {
            "url": "https://sports.yahoo.com/live/pga-championship-round-1-live-updates-xander-schauffele-is-on-fire-as-tiger-woods-makes-the-turn-110955596.html", 
            "description": "Scottie Scheffler is the favorite to win the 106th PGA Championship.", 
            "title": "PGA Championship Round 1 live updates: Xander Schauffele is on fire as Tiger Woods makes the turn - Yahoo Sports"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vZnV0dXJpc20uY29tL25hc2EtY29uY2VybmVkLWJpbGxpb25haXJlLXNwYWNlLWh1YmJsZdIBAA?oc=5", 
            "description": null, 
            "title": "NASA Experts Concerned Billionaire Space Tourist Will Accidentally Break Hubble Space Telescope While Trying to Fix It - Futurism"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNubi5jb20vMjAyNC8wNS8xNi9ldXJvcGUvc2xvdmFraWEtcHJpbWUtbWluaXN0ZXItZmljby1vdXQtb2YtZGFuZ2VyLWludGwtaG5rL2luZGV4Lmh0bWzSAV1odHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDI0LzA1LzE2L2V1cm9wZS9zbG92YWtpYS1wcmltZS1taW5pc3Rlci1maWNvLW91dC1vZi1kYW5nZXItaW50bC1obms?oc=5", 
            "description": null, 
            "title": "Suspect charged in attempted assassination of Slovakia leader - CNN"
        }, 
        {
            "url": "https://apnews.com/article/israel-hamas-war-gaza-aid-us-pier-9414c4148285917f1c858b9590117a84", 
            "description": "The U.S. military has finished installing a floating pier in the Gaza Strip. Officials said Thursday that they're poised to begin ferrying badly needed humanitarian aid into the enclave besieged over seven months of intense fighting in the Israel-Hamas war. T…", 
            "title": "Israel-Hamas war: US military finishes construction of floating pier for Gaza Strip - The Associated Press"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/16/biden-moves-to-block-house-from-getting-his-classified-docs-interview-tapes-00158323", 
            "description": null, 
            "title": "White House to Republicans: You're not getting audio of Biden's interview with Hur - POLITICO"
        }, 
        {
            "url": "https://www.espn.com/college-football/story/_/id/40156723/travis-hunter-quinn-ewers-donovan-edwards-share-ea-sports-cover", 
            "description": "Colorado two-way star Travis Hunter, Texas quarterback Quinn Ewers and Michigan running back Donovan Edwards are sharing the cover of EA Sports College Football 25, set to be released July 19.", 
            "title": "Travis Hunter, Quinn Ewers, Donovan Edwards share EA Sports cover - ESPN"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy9hcnRpY2xlcy9jNG4xbnFydjJlOG_SATJodHRwczovL3d3dy5iYmMuY29tL25ld3MvYXJ0aWNsZXMvYzRuMW5xcnYyZThvLmFtcA?oc=5", 
            "description": null, 
            "title": "Ukraine war: Kharkiv fighting difficult but under control - Zelensky - BBC.com"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/16/investing-in-space-boeing-inches-closer-to-starliner-launch.html", 
            "description": "Boeing's Starliner spacecraft is finally at the pad and on the eve of carrying astronauts. It's a debut that is imminent, yet feels bizarrely inconsequential.", 
            "title": "Investing in Space: Boeing inches closer to Starliner launch - CNBC"
        }, 
        {
            "url": "https://www.ign.com/articles/activision-opens-new-studio-tasked-with-creating-narrative-based-aaa-franchise", 
            "description": "Activision has announced the formation of Elsewhere Entertainment, a studio dedicated to creating a new AAA narrative franchise. The studio is based in Poland is now hiring.", 
            "title": "Activision Opens New Studio Tasked With Creating Narrative-Based AAA Franchise - IGN"
        }, 
        {
            "url": "https://www.cbssports.com/golf/news/2024-pga-championship-tv-schedule-coverage-live-stream-where-to-watch-online-channel-golf-tee-times/", 
            "description": "How to watch every memorable moment of the 2024 PGA Championship on TV or streaming live online", 
            "title": "2024 PGA Championship TV schedule, coverage, live stream, where to watch online, channel, golf tee times - CBS Sports"
        }, 
        {
            "url": "https://apnews.com/article/new-caledonia-france-pacific-unrest-8c05588d36cdafebaa7df9392c20f175", 
            "description": "Violence is raging across New Caledonia for the third consecutive day. France has imposed a state of emergency in the French Pacific territory. Authorities boosted security forces’ powers to quell deadly unrest in the archipelago, where some residents have lo…", 
            "title": "Violence rages in New Caledonia as France rushes emergency reinforcements to its Pacific territory - The Associated Press"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.foxbusiness.com/markets/gamestop-amc-short-sellers-double-down-even-with-stock-swings", 
            "description": "Swings in GameStop and AMC shares revived meme trading while stinging short sellers in the process. Still, these investors betting the shares will fall are not changing their tune.", 
            "title": "GameStop, AMC short sellers double down even with stock swings - Fox Business"
        }, 
        {
            "url": "https://variety.com/2024/biz/news/venu-sports-streaming-disney-fox-warner-bros-discovery-1236006111/", 
            "description": "The joint venture of Disney, Fox and Warner Bros. Discovery to create a sports streaming bundle has an official name -- Venu Sports.", 
            "title": "Disney, Fox and WBD Unveil Name of Sports-Streaming Venture: Venu Sports - Variety"
        }, 
        {
            "url": "https://www.cbsnews.com/news/baobab-tree-of-life-origin/", 
            "description": "The trees have been called both \"grotesque\" and \"one of the most charismatic species on our planet\" – and now we know where they came from.", 
            "title": "Mysterious origin of the \"tree of life\" revealed as some of the species is just decades from extinction - CBS News"
        }, 
        {
            "url": "https://finance.yahoo.com/news/walmart-stock-pops-after-earnings-beat-retailer-surpasses-500-billion-in-market-cap-133920047.html", 
            "description": "The retail giant posted strong numbers as Americans look to stretch their dollars.", 
            "title": "Walmart stock pops after earnings beat, retailer surpasses $500 billion in market cap - Yahoo Finance"
        }, 
        {
            "url": "http://deadline.com/2024/05/megalopolis-imax-global-release-1235918813/", 
            "description": "Will Francis Coppola's self-financed passion project Megalopolis still see the light of day stateside even without a U.S. distributor?", 
            "title": "‘Megalopolis’ Imax Global Release Will Be Limited; Release Date Contingent On U.S. Distribution But Late September Eyed For IMAX In 20 US Cities; Coppola Live Event Planned – Cannes - Deadline"
        }, 
        {
            "url": "https://www.cbsnews.com/boston/news/karen-read-live-stream-today-murder-trial-day-12/", 
            "description": "The high-profile Karen Read murder trial resumed on Wednesday inside a Dedham, Massachusetts courtroom.", 
            "title": "Karen Read murder trial witness Allie McCabe breaks down in tears describing harassment in case - CBS Boston"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/16/health/skin-cancer-screening-wellness/index.html", 
            "description": "Skin cancer is the most common form of cancer in the United States. Here’s what you need to know to reduce your risk.", 
            "title": "The sun’s out, so you need to think about prevention of this type of cancer - CNN"
        }
    ], 
    "last_updated": "2024-05-17 20:30:20"
}