{
    "news": [
        {
            "url": "https://sports.yahoo.com/live/pga-championship-round-4-live-updates-leaderboard-who-will-emerge-from-the-logjam-atop-the-leaderboard-144601738.html", 
            "description": "Fifteen players are within five shots of the lead entering the final round of the 2024 PGA Championship.", 
            "title": "PGA Championship Round 4 live: Who will emerge from the logjam atop the leaderboard? - Yahoo Sports"
        }, 
        {
            "url": "https://cleantechnica.com/2024/05/18/how-will-new-china-tariffs-affect-tesla-other-ev-makers/", 
            "description": "New tariffs on Chinese electric vehicles aim to protect the US EV industry and its automotive labor force.", 
            "title": "How Will New China Tariffs Affect Tesla & Other EV Makers? - CleanTechnica"
        }, 
        {
            "url": "https://www.wsbtv.com/news/local/cobb-county/suspect-identified-after-student-shot-killed-kennesaw-state-universitys-campus/3BISD2BIN5AHPLQWI664AZGLIM/", 
            "description": "A suspect wanted in connection with a shooting at Kennesaw State University has been arrested.", 
            "title": "Suspect identified after student shot, killed on Kennesaw State University’s campus - WSB Atlanta"
        }, 
        {
            "url": "https://www.espn.com/soccer/report/_/gameId/671405", 
            "description": "Expert recap and game analysis of the Manchester City vs. West Ham United English Premier League game from May 19, 2024 on ESPN.", 
            "title": "Man City 3-1 West Ham (May 19, 2024) Game Analysis - ESPN"
        }, 
        {
            "url": "https://www.cnn.com/politics/live-news/morehouse-college-graduation-biden-05-19-24/index.html", 
            "description": "President Joe Biden gave a commencement speech at Morehouse, one of the country's preeminent historically Black colleges, as pro-Palestinian protests continue on campuses across the US.", 
            "title": "Live updates: Biden speaks at Morehouse College commencement - CNN"
        }, 
        {
            "url": "https://www.motorsport.com/f1/news/mclaren-unsure-norris-could-have-passed-verstappen-to-win-f1-imola-gp/10612986/", 
            "description": "McLaren Formula 1 team principal Andrea Stella says he's unsure if he agrees that with a few more laps Lando Norris would have passed Max Verstappen to win in Imola.", 
            "title": "McLaren unsure Norris could have passed Verstappen to win F1 Imola GP - Motorsport.com"
        }, 
        {
            "url": "https://finance.yahoo.com/news/dow-at-40000-why-stocks-still-have-plenty-of-room-to-run-160152850.html", 
            "description": "Wall Street pros say there's more room to grow with stock markets around record highs.", 
            "title": "Dow at 40,000: Why stocks still have 'plenty of room to run' - Yahoo Finance"
        }, 
        {
            "url": "https://www.usatoday.com/story/news/nation/2024/05/19/power-outage-heat-houston-kansas-florida-storms/73760179007/", 
            "description": "More than 349,000 customers were without electricity in Houston as the heat index rises. Kansas and Florida also face a severe weather risk.", 
            "title": "Power outage continues in Houston, storms threaten Kansas and Florida - USA TODAY"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/19/world/blue-origin-rocket-ns-25-mission-scn/index.html", 
            "description": "The NS-25 mission lifted off on Sunday, ending a lengthy hiatus from crewed launches prompted by a failed uncrewed test flight in 2022.", 
            "title": "Blue Origin launches six tourists to the edge of space after nearly two-year hiatus - CNN"
        }, 
        {
            "url": "https://variety.com/2024/film/box-office/box-office-if-film-opening-weekend-underperform-john-krasinski-1236009476/", 
            "description": "John Krasinski's \"IF\" fell slightly short of box office expectations but still topped the North American charts.", 
            "title": "Box Office: John Krasinski’s ‘IF’ Debuts at No. 1 With Soft $35 Million - Variety"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/19/jasmine-crockett-backs-claim-calling-mtg-racist-00158792", 
            "description": null, 
            "title": "Jasmine Crockett backs claim calling Marjorie Taylor Greene 'racist' - POLITICO"
        }, 
        {
            "url": "https://apnews.com/article/iran-helicopter-raisi-b483ba75e4339cfb0fe00c7349d023b8", 
            "description": "Iranian officials say a rescue operation is underway after a helicopter carrying Iranian President Ebrahim Raisi suffered a “hard landing.\" Raisi was traveling Sunday in Iran’s East Azerbaijan province. State TV said the incident happening near Jolfa, a city …", 
            "title": "Helicopter carrying Iran's president suffers a 'hard landing,' state TV says, and rescue is underway - The Associated Press"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.foxnews.com/world/netanyahu-rival-threatens-quit-war-cabinet-gaza-strategy", 
            "description": "Israeli Prime Minister Benjamin Netanyahu is facing a revolt from members of his war cabinet, with Benny Gantz demanding a new strategy by June 8.", 
            "title": "Netanyahu rival threatens to quit war cabinet over Gaza strategy - Fox News"
        }, 
        {
            "url": "https://www.usatoday.com/story/entertainment/tv/2024/05/19/jake-gyllenhaal-hosts-snl-michael-che-colin-jost-joke-swap/73759691007/", 
            "description": "Jake Gyllenhaal sang Boyz II Men to bid farewell to Season 49 as Michael Che and Colin Jost made each other read offensive jokes in the \"SNL\" finale.", 
            "title": "'SNL': Jake Gyllenhaal sings Boyz II Men as Colin Jost, Michael Che swap offensive jokes - USA TODAY"
        }, 
        {
            "url": "https://thehill.com/policy/international/4672790-gop-lawmaker-sanctions-georgia-russian-inspired-law/", 
            "description": null, 
            "title": "GOP lawmaker proposes sanctions against Georgian officials over Russian-inspired law - The Hill"
        }, 
        {
            "url": "https://www.businessinsider.com/ukraine-bombs-port-where-russias-navy-took-refuge-crimea-attacks-2024-5", 
            "description": "Ukraine missiles and drones hit the  Novorossiysk where Russia's Black Sea fleet took refuge after repeated attacks on its Crimea base, reports said.", 
            "title": "Ukraine bombs port where Russia's navy took refuge after Crimea attacks: report - Business Insider"
        }, 
        {
            "url": "https://www.space.com/meteor-green-fireball-spain-portugal-may-19-2024", 
            "description": "The bright green fireball has stunned the internet and social media users.", 
            "title": "Bright green fireball lights up the skies over Portugal and Spain (photos) - Space.com"
        }, 
        {
            "url": "https://www.mmafighting.com/2024/5/19/24159984/tyson-fury-vows-he-wouldve-chased-oleksandr-usyk-knockout-if-he-knew-he-was-down", 
            "description": "Tyson Fury might have gone for the finish against Oleksandr Usyk if he knew the judges had the fight for Usyk heading into the last round.", 
            "title": "Tyson Fury vows he would've chased Oleksandr Usyk knockout if he knew he was down - MMA Fighting"
        }, 
        {
            "url": "https://abcnews.go.com/Politics/rudy-giuliani-served-arizona-fake-electors-indictment-after/story?id=110365001", 
            "description": "Giuliani had bragged he couldn't be found to be served the papers.", 
            "title": "Rudy Giuliani served with Arizona fake electors indictment after 80th birthday party - ABC News"
        }
    ], 
    "last_updated": "2024-05-20 19:37:42"
}