{
    "news": [
        {
            "url": "https://www.vaticannews.va/en/pope/news/2024-05/pope-francis-saints-decrees-miracle-acutis-allamano.html", 
            "description": "Pope Francis recognizes a miracle attributed to Blessed Carlo Acutis and another to Blessed Giuseppe Allamano, and approves the canonization of 11 martyrs in Syria.", 
            "title": "Pope Francis clears path for canonization of Blessed Carlo Acutis - Vatican News - English"
        }, 
        {
            "url": "https://abcnews.go.com/US/memorial-day-weekend-forecast-bring-severe-weather-tornadoes/story?id=110528770", 
            "description": "The highest tornado threat on Friday will be in Wisconsin, Illinois and Iowa.", 
            "title": "Memorial Day weekend weather: Tornadoes and record-high temperatures - ABC News"
        }, 
        {
            "url": "https://www.cbsnews.com/boston/news/karen-read-trial-live-stream-today-brian-higgins/", 
            "description": "Brian Higgins took the stand today for Day 17 of testimony in the Karen Read case. You can watch a live stream of the trial here.", 
            "title": "Watch Live: \"Flirty\" texts between Karen Read, Brian Higgins revealed in murder trial testimony - CBS Boston"
        }, 
        {
            "url": "https://www.washingtonpost.com/technology/2024/05/24/kabosu-doge-meme-shiba-inu-dead/", 
            "description": "Rescued from a dog shelter, Kabosu was an enduring meme of the 2010s, her skeptical glance inspiring a new type of online lingo and a cryptocurrency.", 
            "title": "Kabosu, Shiba Inu dog who inspired ‘Doge’ meme, dies at 18 - The Washington Post"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cn00rj76xd4o", 
            "description": "Tens of thousands of people have been forced to flee from months of widespread gang violence in Haiti.", 
            "title": "US missionaries killed in Haiti gang violence - BBC.com"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/23/stock-market-today-live-updates.html", 
            "description": "Stocks were slightly higher on Friday, following the worst session in more than a year for the Dow Jones Industrial Average.", 
            "title": "Stocks rise slightly, but the Dow is set to snap a 5-week winning streak: Live updates - CNBC"
        }, 
        {
            "url": "https://www.eonline.com/news/1398331/sofia-richie-gives-birth-welcomes-first-baby-with-elliot-grainge", 
            "description": "After announcing her pregnancy back in January, Sofia Richie welcomed her first child—a baby girl—with husband Elliot Grainge. Find out her name.", 
            "title": "Sofia Richie Gives Birth, Welcomes First Baby With Elliot Grainge - E! NEWS"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/24/boeing-nasa-starliner-astronaut-launch-moving-forward.html", 
            "description": "Boeing and NASA are moving forward with a June 1 launch attempt of the first crewed Starliner mission despite a \"stable\" leak in its propulsion system.", 
            "title": "Boeing, NASA say Starliner astronaut launch will move forward despite spacecraft helium leak - CNBC"
        }, 
        {
            "url": "https://www.cbssports.com/nfl/news/travis-kelce-joins-andy-reid-patrick-mahomes-in-defending-harrison-butker-calls-chiefs-kicker-great-person/", 
            "description": "The NFL commissioner spoke about the matter Wednesday", 
            "title": "Travis Kelce joins Andy Reid, Patrick Mahomes in defending Harrison Butker, calls Chiefs kicker 'great person' - CBS Sports"
        }, 
        {
            "url": "https://www.nbcnews.com/news/us-news/us-tourist-facing-jail-turks-caicos-possessing-ammunition-released-rcna153874", 
            "description": "An American man who was facing up to 12 years in jail on this Caribbean island for bringing 20 rounds of ammunition on a vacation has been freed after a court ruling Friday.", 
            "title": "U.S. tourist facing jail in Turks and Caicos for possessing ammunition is released - NBC News"
        }, 
        {
            "url": "https://www.cbsnews.com/minnesota/news/brain-worms-bear-meat-south-dakota-family-gathering-minnesota-arizona/", 
            "description": "At least six family members who shared a meal of bear meat that one of the family members had harvested earlier were subsequently infected with brain worms, the CDC reports.", 
            "title": "Family members infected with brain worms after eating undercooked bear meat - CBS News"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/24/24163954/spacex-starship-fourth-test-flight-june", 
            "description": "The fourth test flight of SpaceX’s Starship rocket could occur on June 5th, as long as regulators sign off on it. The test will focus on returning and reusing the rocket.", 
            "title": "SpaceX's Starship is getting ready to take off again in June - The Verge"
        }, 
        {
            "url": "http://deadline.com/2024/05/box-office-furiosa-garfield-memorial-day-1235938017/", 
            "description": "Despite more movies in the marketplace, we’re still feeling the aftermath of the strikes. How is that? Many aren’t in the habit of moviegoing yet, and while content is king, neither of this weekend’s releases are expected to create a stampede: one is a preque…", 
            "title": "‘Furiosa’ Sees $3.5M, ‘Garfield The Movie’ $1.9M In Previews As Memorial Day Weekend Box Office Begins - Deadline"
        }, 
        {
            "url": "https://www.floridatoday.com/story/tech/science/space/spacex/2024/05/23/spacex-starlink-falcon-9-rocket-booster-night-launch-space-coast-cape-canaveral-florida/73769537007/", 
            "description": "On Wednesday night, SpaceX launched the first of a Starlink double-header.", 
            "title": "SpaceX Falcon 9 rocket lights up night sky over Space Coast, Florida - Florida Today"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/24/google-criticized-as-ai-overview-makes-errors-like-saying-president-obama-is-muslim.html", 
            "description": "Public criticism has mounted over Google's AI Overview feature in Search, which has returned inaccurate or nonsensical results, according to screenshots.", 
            "title": "Google criticized as AI Overview makes obvious errors, saying President Obama is Muslim and that it's safe to leave dogs in hot cars - CNBC"
        }, 
        {
            "url": "https://www.wthr.com/article/money/business/eli-lilly-manufacturing-site-lebanon-9-billion-dollars-zepbound-mounjaro-boost-production/531-0d350c2d-6045-4636-9288-a9180f0a0fef", 
            "description": "The site will bring 900 full-time jobs and more than 5,000 construction jobs.", 
            "title": "Lilly increases investment to Lebanon manufacturing site to $9B - WTHR"
        }, 
        {
            "url": "https://sports.yahoo.com/2024-nba-draft-big-board-ranking-the-top-40-players-142413978.html", 
            "description": "Yahoo Sports breaks down the best prospects in the 2024 NBA Draft after the combine and pre-draft testing.", 
            "title": "2024 NBA Draft Big Board: Ranking the top 40 players - Yahoo Sports"
        }, 
        {
            "url": "https://www.macrumors.com/2024/05/24/best-buys-memorial-day-sale/", 
            "description": "Best Buy today kicked off its Memorial Day weekend sale, and it has some of the best prices we've tracked in weeks on iPads and MacBooks....", 
            "title": "Best Buy's Memorial Day Sale Has Record Low Prices on iPads, MacBooks, and Much More - MacRumors"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/23/3-billion-secret-program-undermining-bidens-tech-policy-00158757", 
            "description": null, 
            "title": "'I don't know how this happened': A $3B secret program undermining Biden's tech policy - POLITICO"
        }, 
        {
            "url": "https://variety.com/2024/film/obituaries-people-news/morgan-spurlock-dead-super-size-me-1236015338/", 
            "description": "Morgan Spurlock, a documentary filmmaker whose McDonald's takedown \"Super Size Me\" captured the zeitgeist and an Oscar nomination, has died of cancer.", 
            "title": "Morgan Spurlock, ‘Super Size Me’ Director, Dies at 53 - Variety"
        }
    ], 
    "last_updated": "2024-05-25 23:00:31"
}