{
    "news": [
        {
            "url": "https://www.washingtonpost.com/world/2024/05/23/keir-starmer-rishi-sunak-what-to-know/", 
            "description": "With Britain’s elections coming on July 4, how different are Prime Minister Rishi Sunak and Labour Party leader Keir Starmer?", 
            "title": "Starmer vs. Sunak: What to know about the U.K. prime minister contenders - The Washington Post"
        }, 
        {
            "url": "https://finance.yahoo.com/news/nvidia-stock-pops-9-tops-1000-after-earnings-beat-forecasts-announces-stock-split-and-dividend-hike-202405060.html", 
            "description": "Nvidia reported its fiscal first quarter earnings after the bell on Wednesday, beating analysts' expectations on the top and bottom lines while raising its...", 
            "title": "Nvidia stock pops 9%, tops $1,000 after earnings beat forecasts, announces stock split and dividend hike - Yahoo Finance"
        }, 
        {
            "url": "https://apnews.com/article/supreme-court-redistricting-south-carolina-black-voters-864d1609b74ad74980604c26e9bfac52", 
            "description": "The Supreme Court has preserved a Republican-held South Carolina congressional district, rejecting a lower-court ruling that the district discriminated against Black voters. The justices said Thursday the Republican-controlled state legislature did nothing wr…", 
            "title": "Supreme Court finds no bias against Black voters in a South Carolina congressional district - The Associated Press"
        }, 
        {
            "url": "https://www.nbcnews.com/politics/congress/senate-republicans-block-border-security-bill-campaign-border-chaos-rcna153607", 
            "description": "Senate Democrats failed to advance a bipartisan border security bill Thursday, with nearly every Republican voting against it Donald Trump wields border chaos in the 2024 election.", 
            "title": "Senate Republicans block border security bill as they campaign on border chaos - NBC News"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.wdrb.com/in-depth/louisville-police-detective-disciplined-for-failing-to-turn-on-body-camera-during-scottie-schefflers-arrest/article_4bea068e-1912-11ef-8067-37ffc723ae29.html", 
            "description": "Louisville Metro Police Detective Bryan Gillis should have had his body camera turned on when he arrested pro golfer Scottie Scheffler last week and has been disciplined, Chief Jacquelyn Gwinn-Villaroel", 
            "title": "Louisville police detective disciplined for failing to turn on body camera during Scottie Scheffler's arrest - WDRB"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/22/asia/china-military-drills-taiwan-punishment-intl-hnk/index.html", 
            "description": "China has launched two days of military drills surrounding Taiwan in what it called “punishment” for “separatist acts,” days after the self-ruling island swore in a new democratically elected leader.", 
            "title": "China starts ‘punishment’ military drills around Taiwan days after island swears in new leader - CNN"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/23/24163225/daylight-dc1-tablet-livepaper", 
            "description": "Daylight Computer is claiming to have invented a new kind of display, which it calls LivePaper, and has built a new tablet that it says will help reset our relationship with tech.", 
            "title": "Daylight DC1: a new tablet with a better screen and no blue backlight - The Verge"
        }, 
        {
            "url": "https://www.npr.org/2024/05/23/1251003581/2024-atlantic-hurricane-season-noaa-forecast", 
            "description": "The National Hurricane Center is predicting the largest number of storms ever forecast for the Atlantic, putting tens of millions of Americans at risk.", 
            "title": "2024 will be the most active hurricane season in the Atlantic - NPR"
        }, 
        {
            "url": "https://apnews.com/article/iran-president-raisi-helicopter-crash-funerals-aa975288bab8a63af93c8c5f9a31a615", 
            "description": "Iran has interred late President Ebrahim Raisi at the holiest Shiite shrine in the nation, days after a fatal helicopter crash killed him, the country’s foreign minister and six others. Raisi was placed Thursday inside a tomb at the Imam Reza Shrine in Mashha…", 
            "title": "Ebrahim Raisi funeral: Iran prepares to bury late president killed in helicopter crash - The Associated Press"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c511mnxyj33o", 
            "description": "Michigan worker develops mild symptoms after exposure to infected cows, but wider public risk remains low.", 
            "title": "Bird flu: Second US worker catches infection on dairy farm - BBC.com"
        }, 
        {
            "url": "https://www.space.com/gliese-12-b-tess-exoplanet-hunt-for-life", 
            "description": "Gliese 12 b is tantalizingly close and moderately warm, situated just 40 light-years away around a red dwarf star.", 
            "title": "NASA's TESS exoplanet-hunter finds tantalizingly close Earth-size world with moderate temperature - Space.com"
        }, 
        {
            "url": "http://9to5google.com/2024/05/23/spotify-car-thing-dead/", 
            "description": "After discontinuing the device in 2022, Spotify has confirmed that it will kill any remaining Car Thing units by the end of the year.", 
            "title": "Spotify will kill Car Thing units later this year, tells owners to throw them away - 9to5Google"
        }, 
        {
            "url": "https://abcnews.go.com/US/nasa-announces-new-launch-date-boeings-starliner-astronaut/story?id=110496677", 
            "description": "The mission was most recently delayed due to a small helium leak.", 
            "title": "NASA announces new launch date for Boeing's Starliner astronaut-crewed mission after several delays - ABC News"
        }, 
        {
            "url": "https://fortune.com/2024/05/23/jamie-dimon-jerome-powell-base-rate-cut-could-raise/", 
            "description": "Wall Street may be holding out for Jerome Powell and the Fed to reduce the base rate, but JPMorgan Chase CEO Jamie Dimon isn’t convinced.", 
            "title": "JPMorgan CEO Jamie Dimon: Fed's Jerome Powell could hike rates - Fortune"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/22/stock-market-today-live-updates.html", 
            "description": "The S&P 500 declined Thursday as Wall Street assessed the latest quarterly results from market bellwether Nvidia.", 
            "title": "Nasdaq boosted to a record by Nvidia, but the rest of the market is struggling Thursday: Live updates - CNBC"
        }, 
        {
            "url": "https://www.cbsnews.com/news/ticketmaster-livenation-antitrust-action-justice-department/", 
            "description": "The Justice Department filed a federal lawsuit accusing Ticketmaster and its parent company Live Nation of illegally monopolizing the live entertainment industry.", 
            "title": "Justice Department sues Live Nation and Ticketmaster for monopolizing concert industry - CBS News"
        }, 
        {
            "url": "https://nypost.com/2024/05/23/lifestyle/1-in-9-us-children-diagnosed-with-adhd/", 
            "description": "The kids are not alright.", 
            "title": "1 in 9 US children diagnosed with ADHD - New York Post "
        }, 
        {
            "url": "https://www.youtube.com/watch?v=xJ0UYuNhfos", 
            "description": "Microsoft is leaning even more into AI after launching a new Copilot+ AI PC initiative earlier this year. It's a new set of standards for PCs with powerful n...", 
            "title": "Microsoft's Copilot+ Plans + Surface Pro and Laptop | Engadget Podcast - Engadget"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/23/politics/biden-kenya-president-state-visit-china/index.html", 
            "description": "When Kenyan President William Ruto touched down in Beijing seven months ago, he was welcomed on the tarmac with a red carpet and cordons of Chinese troops standing at attention. Among the goals of his three-day state visit in October: Securing another $1 bill…", 
            "title": "Biden looks to counter China’s influence as he rolls out red carpet for Kenya - CNN"
        }
    ], 
    "last_updated": "2024-05-25 00:30:38"
}