{
    "news": [
        {
            "url": "https://www.cnbc.com/2024/05/23/stock-market-today-live-updates.html", 
            "description": "All three major indexes ended Thursday's trading lower, even as Nvidia soared.", 
            "title": "Stock futures are little changed after Dow posts worst session since March 2023: Live updates - CNBC"
        }, 
        {
            "url": "https://www.yahoo.com/entertainment/riley-keoughs-battle-over-graceland-ends-company-drops-plans-for-foreclosure-sale-and-is-now-under-investigation-170228560.html", 
            "description": "The Memphis landmark won't be changing hands after all. Here are the latest twists and turns in the unusual legal battle.", 
            "title": "Riley Keough's battle over Graceland ends: Company drops plans for foreclosure sale and is now under investigation - Yahoo Entertainment"
        }, 
        {
            "url": "https://apnews.com/article/2024-election-ohio-ballot-biden-dbed6f0c5ec75d1aa7c7ef2ca81657fa", 
            "description": "Ohio’s Republican Gov. Mike DeWine is calling a rare special session of the General Assembly next Tuesday to pass legislation ensuring that President Joe Biden is on the state’s 2024 ballot. DeWine said Thursday that Ohio is “running out of time” to get Biden…", 
            "title": "Ohio governor calls special session to pass legislation ensuring President Biden is on 2024 ballot - The Associated Press"
        }, 
        {
            "url": "https://nypost.com/2024/05/23/world-news/us-service-member-critically-injured-2-other-troops-hurt-at-gaza-aid-pier-report/", 
            "description": "The troops had been working to deliver humanitarian aid in Gaza, US Vice Admiral Brad Cooper, deputy commander of US Central Command, told Reuters.", 
            "title": "US service member critically injured at Gaza aid pier: report - New York Post "
        }, 
        {
            "url": "https://www.washingtonpost.com/entertainment/2024/05/23/cassie-response-diddy-hotel-assault-video/", 
            "description": "Cassie Ventura posted a statement to Instagram on Thursday, days after the release of 2016 footage that showed her being brutally assaulted by Sean “Diddy” Combs.", 
            "title": "Cassie speaks out after Diddy assault video: ‘Domestic violence is THE issue’ - The Washington Post"
        }, 
        {
            "url": "https://www.sammobile.com/news/serious-leak-shows-samsung-made-repair-shops-report-customer-data-kill-devices/", 
            "description": "How Samsung handles repairs for its devices has come under the spotlight after iFixit announced today that it's ending its ...", 
            "title": "Serious leak shows Samsung made repair shops report customer data, kill devices - SamMobile - Samsung news"
        }, 
        {
            "url": "https://www.wsj.com/business/media/ticketmaster-live-nation-sued-justice-department-monopoly-d9442a75", 
            "description": null, 
            "title": "U.S. Says Live Nation and Ticketmaster Are Monopoly, Seeks Breakup - WSJ - The Wall Street Journal"
        }, 
        {
            "url": "https://sports.yahoo.com/mavericks-take-game-1-cavaliers-fire-jb-bickerstaff--76ers-plan-to-pursue-third-star--no-cap-room-204654624.html", 
            "description": "Dan Devine and Jake Fischer recap the action from Game 1 of the Western Conference Finals, the Cavaliers firing J.B. Bickerstaff and the 76ers plans to...", 
            "title": "Mavericks take Game 1, Cavaliers fire J.B. Bickerstaff & 76ers plan to pursue third star | No Cap Room - Yahoo Sports"
        }, 
        {
            "url": "https://www.cbsnews.com/news/flags-alitos-houses-political-backlash-supreme-court-nears-end-of-term/", 
            "description": "Justice Samuel Alito has come under scrutiny after the New York Times reported two instances of controversial flags flown outside his Virginia and New Jersey houses.", 
            "title": "Flags outside of Alito's houses spark political backlash as Supreme Court nears end of term - CBS News"
        }, 
        {
            "url": "https://apnews.com/article/supreme-court-redistricting-south-carolina-black-voters-864d1609b74ad74980604c26e9bfac52", 
            "description": "The Supreme Court has preserved a Republican-held South Carolina congressional district, rejecting a lower-court ruling that the district discriminated against Black voters. The justices said Thursday the Republican-controlled state legislature did nothing wr…", 
            "title": "Supreme Court finds no bias against Black voters in a South Carolina congressional district - The Associated Press"
        }, 
        {
            "url": "https://www.dw.com/en/biden-says-kenya-in-line-to-be-first-sub-saharan-nato-ally/a-69161316", 
            "description": "Kenyan President William Ruto is the first African leader to make a state visit to Washington since 2008. US President Joe Biden announced Kenya would be made a major non-NATO ally .", 
            "title": "Biden says Kenya in line to be first sub-Saharan NATO ally - DW (English)"
        }, 
        {
            "url": "https://techcrunch.com/2024/05/23/spotify-to-shut-off-car-thing-for-good-leading-users-to-demand-refunds/", 
            "description": "Spotify is notifying users of its Car Thing product that the devices will stop working after December 9, 2024.", 
            "title": "Spotify to shut off Car Thing for good, leading users to demand refunds - TechCrunch"
        }, 
        {
            "url": "https://apnews.com/article/ncaa-settlement-3e26c017980afe0ee1c6a28f77abcf5a", 
            "description": "The NCAA and Southeastern Conference leadership have approved a $2.8 billion settlement of antitrust claims, moving college athletics closer to some of the most sweeping changes in its history. The Big Ten, ACC and Big 12 have also backed the plan. Leadership…", 
            "title": "NCAA votes to accept $2.8 billion settlement that could usher in dramatic change for college sports - The Associated Press"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.wdrb.com/in-depth/louisville-police-detective-disciplined-for-failing-to-turn-on-body-camera-during-scottie-schefflers-arrest/article_4bea068e-1912-11ef-8067-37ffc723ae29.html", 
            "description": "Louisville Metro Police Detective Bryan Gillis should have had his body camera turned on when he arrested pro golfer Scottie Scheffler last week and has been disciplined, Chief Jacquelyn Gwinn-Villaroel", 
            "title": "Louisville police detective disciplined for failing to turn on body camera during Scottie Scheffler's arrest - WDRB"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c900qz4wll4o", 
            "description": "Russia's president seems to be acting on the late Wagner chief's warnings, but in his own time.", 
            "title": "Rosenberg: Russian President Putin's military purge echoes Prigozhin's call to act - BBC.com"
        }, 
        {
            "url": "https://www.sciencealert.com/crows-can-actually-count-out-loud-amazing-new-study-shows", 
            "description": "It's no secret that corvids are capable of some amazing feats of creative and intelligent thinking, but a newly discovered ability has us stunned.", 
            "title": "Crows Can Actually Count Out Loud, Amazing New Study Shows - ScienceAlert"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/23/24163225/daylight-dc1-tablet-livepaper", 
            "description": "Daylight Computer is claiming to have invented a new kind of display, which it calls LivePaper, and has built a new tablet that it says will help reset our relationship with tech.", 
            "title": "Daylight DC1: a new tablet with a better screen and no blue backlight - The Verge"
        }, 
        {
            "url": "https://www.reuters.com/markets/us/nasdaq-sp-500-futures-pop-nvidia-fuels-chip-stocks-rally-2024-05-23/", 
            "description": null, 
            "title": "Nasdaq jumps on Nvidia results cheer, inflation woes drag broader market - Reuters.com"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/23/24162627/euclid-space-telescope-images-dark-matter-rogue-planet", 
            "description": "The first science release from the Euclid space telescope showcases tens of thousands of galaxies and other celestial phenomenons.", 
            "title": "Euclid space telescope captures tens of thousands of glittering galaxies - The Verge"
        }
    ], 
    "last_updated": "2024-05-25 02:30:39"
}