{
    "news": [
        {
            "url": "https://www.wesh.com/article/ocala-bus-crash/60788231", 
            "description": "According to Marion County Public Schools, their school buses were used to transport victims to the hospital.", 
            "title": "Florida bus crash: 8 people dead, 45 hospitalized in Ocala - WESH 2 Orlando"
        }, 
        {
            "url": "https://sports.yahoo.com/live/2024-nfl-schedule-release-live-updates-ahead-of-wednesdays-full-announcement-222736159.html", 
            "description": "Before Wednesday arrives, football fans got some appetizers as some games were formally announced.", 
            "title": "2024 NFL schedule release: Live updates ahead of Wednesday's full announcement - Yahoo Sports"
        }, 
        {
            "url": "https://6abc.com/post/aldi-cream-cheese-recall-schreiber-foods-hy-vee/14814486/", 
            "description": "A total of four cream cheese spreads in 8-ounce cup containers sold under the Aldi brand name have been impacted by this recall: Regular cream cheese, Whipped cream cheese, Chive and onion, and Strawberry.", 
            "title": "Cream cheese sold at Aldi, Hy-Vee recalled in 29 states over salmonella concerns - WPVI-TV"
        }, 
        {
            "url": "https://www.ft.com/content/ca009a44-d115-4e6d-9c0f-b4ec2f006084", 
            "description": "Exit comes 6 months after Sutskever and others moved to oust CEO Sam Altman", 
            "title": "OpenAI co-founder and chief scientist Ilya Sutskever departs - Financial Times"
        }, 
        {
            "url": "https://www.jpost.com/israel-hamas-war/2024-05-15/live-updates-801199", 
            "description": "US denies it withheld information about Hamas leaders' whereabouts • Hostage families criticize inaction by government", 
            "title": "Israel-Hamas War Day 222: What is happening in Gaza, Lebanon? - The Jerusalem Post"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/15/asia/thailand-lese-majeste-activist-death-netiporn-intl-hnk/index.html", 
            "description": "Death of activist Netiporn “Bung” Sanesangkhom following her prolonged hunger strike prompts outpouring of grief and renewed calls for justice reform in Thailand.", 
            "title": "Young Thai activist’s death in detention after 65-day hunger strike sparks calls for justice reform - CNN"
        }, 
        {
            "url": "https://www.espn.com/nba/story/_/id/40149906/nikola-jokic-collects-mvp-trophy-scores-40-points-nuggets-game-5-win-vs-wolves", 
            "description": "Nikola Jokic celebrated his third MVP award by scoring 40 points and outdueling Defensive Player of the Year Rudy Gobert in the Nuggets' Game 5 win over the Timberwolves on Tuesday night.", 
            "title": "Nikola Jokic scores 40, lifts Nuggets to 3-2 lead vs. Wolves - ESPN"
        }, 
        {
            "url": "https://www.npr.org/2024/05/15/1251505500/walmart-lays-off-hundreds-of-employees-and-requires-others-to-relocate", 
            "description": "Walmart said it will require most remote workers in its Dallas, Atlanta and Toronto offices to relocate to its offices in Bentonville, Arkansas; Hoboken, New Jersey; and the San Francisco Bay Area.", 
            "title": "Walmart lays off hundreds of employees and requires others to relocate - NPR"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c1030vvy0mzo", 
            "description": "Ukraine says it has moved troops to \"advantageous positions\" as Russia intensifies its attacks on the region.", 
            "title": "Ukraine troops pull back in Kharkiv after Russia offensive - BBC.com"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/15/putin-xi-meeting-russia-wants-3-things-from-china-says-fpri.html", 
            "description": "Russian President Vladimir Putin's meeting with Chinese leader Xi Jinping in China this week is the latest sign of the deepening strategic ties between both sides.", 
            "title": "Putin wants 3 things from Xi as he seeks to deepen Russia-China ties, analyst says - CNBC"
        }, 
        {
            "url": "https://nypost.com/2024/05/15/sports/spike-lee-knicks-fans-go-wild-after-game-5-rout-of-pacers/", 
            "description": "Knicks fans couldn’t help but show pure jubilation after their team’s Game 5 win on Tuesday night.", 
            "title": "Spike Lee, Knicks fans go wild outside MSG after rout of Pacers: 'Knicks in six!' - New York Post "
        }, 
        {
            "url": "https://www.foxnews.com/sports/connecticut-sun-rout-indiana-fever-spoil-caitlin-clarks-wnba-debut", 
            "description": "The Indiana Fever suffered a double digit loss to the Connecticut Sun on Tuesday night, as Caitlin Clark scored 20 points in her WNBA debut.", 
            "title": "Connecticut Sun rout Indiana Fever to spoil Caitlin Clark’s WNBA debut - Fox News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/14/politics/maryland-senate-race-democratic-primary/index.html", 
            "description": "Angela Alsobrooks will win Maryland’s Democratic nomination for US Senate, CNN projects, advancing her potentially history-making candidacy to the competitive general election with implications for control of the chamber next year.", 
            "title": "Alsobrooks will win Maryland Democratic Senate nod, CNN projects, defeating a record-breaking self-funder - CNN"
        }, 
        {
            "url": "https://www.sciencealert.com/surprising-study-finds-men-with-low-testosterone-more-likely-to-die-early", 
            "description": "It has long been thought that testosterone shortens men's lives.", 
            "title": "Surprising Study Finds Men With Low Testosterone More Likely to Die Early - ScienceAlert"
        }, 
        {
            "url": "https://www.msnbc.com/alex-wagner-tonight/watch/-utterly-humiliating-trump-sycophants-in-matching-suits-audition-for-trump-outside-trial-210954309549", 
            "description": "Outside of the courthouse where Donald Trump's criminal trial is taking place, a gaggle of Republicans with aspirations of being Trump's new running mate dressed in curiously matching suits and parroted Trump's criticisms of the trial and the judge in a bizar…", 
            "title": "'Utterly humiliating': Trump sycophants in matching suits audition for Trump outside trial - MSNBC"
        }, 
        {
            "url": "https://www.thecrimson.com/article/2024/5/15/hoekstra-harvard-yard-encampment/", 
            "description": "Faculty of Arts and Sciences Dean Hopi E. Hoekstra praised interim University President Alan M. Garber ’76 for his handling of the pro-Palestine encampment and called for “true and meaningful dialogue” in her first public statement about the nearly three-week…", 
            "title": "FAS Dean Hopi Hoekstra Takes Victory Lap After Peaceful End to Harvard Yard Encampment | News - Harvard Crimson"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/14/alameda-da-pamela-price-recall-vote-00157997", 
            "description": null, 
            "title": "Alameda DA Pamela Price faces recall vote in November - POLITICO"
        }, 
        {
            "url": "https://apnews.com/article/us-israel-arms-gaza-ebe971ca8878ff430ce6458c04151585", 
            "description": "The Biden administration has told key lawmakers it is sending a more than $1 billion in additional arms and ammunition to Israel. That's according to three congressional aides who spoke of condition of anonymity to discuss an arms transfer that has not yet be…", 
            "title": "Biden administration is sending $1 billion more in weapons, ammo to Israel, congressional aides say - The Associated Press"
        }, 
        {
            "url": "https://abcnews.go.com/US/ship-struck-francis-scott-key-bridge-blackouts-10/story?id=110218718", 
            "description": "Two incidents took place while the ship was docked in Baltimore, the NTSB said.", 
            "title": "Ship that struck Francis Scott Key Bridge had blackouts 10 hours before crash, NTSB report finds - ABC News"
        }, 
        {
            "url": "https://abcnews.go.com/Health/kp2-now-dominant-covid-variant-experts-us-summer/story?id=110166187", 
            "description": "KP.2 currently makes up an estimated 28.2% of cases in the U.S., CDC data shows.", 
            "title": "KP.2 is now the dominant COVID variant. Experts say US may see a summer increase in cases - ABC News"
        }
    ], 
    "last_updated": "2024-05-16 12:16:20"
}