{
    "news": [
        {
            "url": "https://www.bbc.com/news/articles/cn037ry3r3zo", 
            "description": "The BBC's Jonathan Beale joins Ukrainian forces in Kharkiv as they try to shore up a weakened frontline.", 
            "title": "Ukraine's defence lines stretched as Russian troops advance - BBC.com"
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-17/china-removes-mortgage-rate-floor-for-individual-homebuyers-lwa88d1y", 
            "description": "China announced its most forceful attempt yet to shore up the beleaguered property market, easing mortgage rules and encouraging local governments to buy unsold homes from developers for conversion into affordable housing.", 
            "title": "China Unveils Broad Rescue Package to Prop Up Housing Market - Bloomberg"
        }, 
        {
            "url": "https://www.espn.com/wnba/story/_/id/40161747/caitlin-clark-scores-9-points-home-debut-fever-lose", 
            "description": "Caitlin Clark scored 9 points in the Fever's 102-66 loss at home to the Liberty. It was the first time Clark was held to single digits in scoring since January 2021.", 
            "title": "Caitlin Clark scores 9 points in home debut as Fever lose - ESPN"
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-69021543", 
            "description": "Harrison Butker also attacked \"degenerate cultural values\" and \"the tyranny of diversity, equity and inclusion\".", 
            "title": "Harrison Butker 'homemaker' speech sparks backlash - BBC.com"
        }, 
        {
            "url": "http://www.billboard.com/music/awards/2024-acm-awards-winners-list-1235685091/", 
            "description": "The 2024 ACM Awards were May 16. Here's the winners list.", 
            "title": "Here Are the 2024 ACM Awards Winners: Complete List - Billboard"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=7uEhL2_K-iI", 
            "description": "Never miss a moment with the latest news, trending stories and highlights to bring you closer to your favorite players and teams.Download now: https://link.n...", 
            "title": "Anthony Edwards PROPELS The Timberwolves Into Game 7! 👀| May 16, 2024 - NBA"
        }, 
        {
            "url": "https://www.reuters.com/world/putin-push-growing-moscow-beijing-trade-chinas-northeast-2024-05-17/", 
            "description": null, 
            "title": "Putin to push growing Moscow-Beijing trade in China's northeast - Reuters"
        }, 
        {
            "url": "https://abcnews.go.com/Politics/biden-asserts-executive-privilege-audio-interview-special-counsel/story?id=110298904", 
            "description": "Republicans are still moving ahead with trying to hold AG Garland in contempt.", 
            "title": "Biden asserts executive privilege over audio of interview with special counsel Hur - ABC News"
        }, 
        {
            "url": "https://apnews.com/article/pga-championship-valhalla-tiger-scheffler-mcilroy-koepka-d0421ebb2e61aeff9c95a1bb87ee1a72", 
            "description": "Xander Schauffele has set the PGA Championship record with a 62. He also ties a major championship record that he shared last year in the U.S. Open. Schauffele took advantage of rain-softened conditions at Valhalla. And he's been playing some good golf. Schau…", 
            "title": "PGA Championship: Schauffele breaks scoring record with a 62 - The Associated Press"
        }, 
        {
            "url": "https://www.reuters.com/markets/asia/chinas-april-industrial-output-rises-67-beats-expectations-2024-05-17/", 
            "description": null, 
            "title": "China's factories fire up but consumer, property weakness persists - Reuters"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://apnews.com/article/new-caledonia-france-pacific-unrest-8c05588d36cdafebaa7df9392c20f175", 
            "description": "Violence is raging across New Caledonia for the third consecutive day. France has imposed a state of emergency in the French Pacific territory. Authorities boosted security forces’ powers to quell deadly unrest in the archipelago, where some residents have lo…", 
            "title": "Violence rages in New Caledonia as France rushes emergency reinforcements to its Pacific territory - The Associated Press"
        }, 
        {
            "url": "https://www.eonline.com/news/1401827/ben-affleck-and-jennifer-lopez-step-out-with-wedding-rings-amid-breakup-rumors", 
            "description": "Ben Affleck and Jennifer Lopez were both seen wearing their wedding rings as they stepped out in Los Angeles May 16, amid rumors the couple was breaking up after two years of marriage.", 
            "title": "Ben Affleck and Jennifer Lopez Step Out With Wedding Rings Amid Breakup Rumors - E! Online - E! NEWS"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.axios.com/2024/05/16/biden-border-immigration-asylum-fast-track-docket", 
            "description": null, 
            "title": "Biden takes another step to fast-track asylum process for border crossers - Axios"
        }, 
        {
            "url": "https://www.foxnews.com/health/cdc-webmd-give-update-current-bird-flu-outbreak-alert-not-alarmed", 
            "description": "As bird flu continues to spread among cattle in the U.S., the CDC and WebMD joined forces on Thursday to present a live-streamed briefing on the status of the outbreak.", 
            "title": "CDC, WebMD give update on current bird flu outbreak: 'Be alert, not alarmed' - Fox News"
        }, 
        {
            "url": "https://techcrunch.com/2024/05/16/openai-inks-deal-to-train-ai-on-reddit-data/", 
            "description": "OpenAI has inked a deal with Reddit to train its models on Reddit data. In return, OpenAI will become a Reddit ad partner -- and provide AI-powered tools.", 
            "title": "OpenAI inks deal to train AI on Reddit data - TechCrunch"
        }, 
        {
            "url": "https://www.reuters.com/world/us/us-house-votes-force-weapons-shipments-israel-rebuking-biden-2024-05-16/", 
            "description": null, 
            "title": "US House votes to force weapons shipments to Israel, rebuking Biden - Reuters"
        }, 
        {
            "url": "https://apnews.com/article/detroit-us-census-population-1f1f2ef32a46d4310e95dfc5e9c5a2c4", 
            "description": "U.S. Census Bureau estimates show America's Northeast and Midwest cities are rebounding slightly from years of population drops, highlighted by modest growth in Detroit after decades of declines. Government figures released Thursday show Detroit saw its popul…", 
            "title": "Census Bureau estimates: Detroit population rises after decades of decline, South dominates growth - The Associated Press"
        }, 
        {
            "url": "https://finance.yahoo.com/video/walmart-market-cap-tops-500b-195303479.html", 
            "description": "Shares of Walmart (WMT) are trading higher Thursday, boosted by the company's first quarter earnings beat, which signaled consumer resilience on spending...", 
            "title": "Walmart market cap tops $500B post Q1 results - Yahoo Finance"
        }
    ], 
    "last_updated": "2024-05-18 09:27:56"
}