{
    "news": [
        {
            "url": "https://www.cnn.com/weather/live-news/oklahoma-texas-arkansas-tornado-storms-05-27-24-intl-hnk/index.html", 
            "description": "At least 21 people, including four children, are dead in Texas, Oklahoma, Arkansas and Kentucky after tornadoes and severe weather struck the central United States. Follow for live updates.", 
            "title": "At least 21 killed in tornado-spawning storms sweeping central US: Live updates - CNN"
        }, 
        {
            "url": "http://deadline.com/2024/05/johnny-wactor-general-hospital-1235941795/", 
            "description": "Actor Johnny Wactor had just finished a bartending shift and was walking an unidentified female co-worker to her car.", 
            "title": "‘General Hospital’ Actor Johnny Wactor Was Shielding Female Co-Worker When Fatally Shot – Report - Deadline"
        }, 
        {
            "url": "https://variety.com/2024/film/box-office/box-office-furiosa-just-barely-beats-garfield-disastrous-memorial-day-weekend-1236017039/", 
            "description": "In a box office nail biter, \"Furiosa: A Mad Max Saga\" emerged victorious over \"The Garfield Movie\" on North American charts.", 
            "title": "Box Office: ‘Furiosa’ Just Barely Beats ‘The Garfield Movie’ in Disastrous Memorial Day Weekend — the Worst in Decades - Variety"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.cbsnews.com/news/north-korea-second-military-spy-satellite/", 
            "description": "North Korea had earlier notified Japan's coast guard about its plans to launch \"a satellite rocket.\"", 
            "title": "North Korea apparently launches missile into sea after announcing plan to put rocket into orbit with spy satellite - CBS News"
        }, 
        {
            "url": "https://www.floridatoday.com/story/tech/science/space/spacex/2024/05/27/spacex-launch-falcon-9-rocket-memorial-day-starlink-florida-cape-canaveral/73836623007/", 
            "description": "Recap of FLORIDA TODAY Space Team live updates of scrubbed SpaceX Starlink Falcon 9 mission from Cape Canaveral Launch Complex 40.", 
            "title": "SpaceX is now targeting Tuesday morning for Starlink launch from Cape - Florida Today"
        }, 
        {
            "url": "https://www.axios.com/2024/05/27/elon-musk-xai-6-billion-funding-investors", 
            "description": null, 
            "title": "Elon Musk's xAI raises $6 billion to challenge OpenAI - Axios"
        }, 
        {
            "url": "https://www.knoxnews.com/story/sports/college/2024/05/27/ncaa-baseball-selection-show-2024-time-tv-channel-cws-bracket-reveal-tennessee-vols/73862258007/", 
            "description": "The bracket for the 2024 NCAA baseball tournament will be unveiled on Monday. Here's the TV channel, time and streaming info to tune in and watch:", 
            "title": "NCAA baseball selection show 2024: Time, TV channel for College World Series bracket reveal - Knoxville News Sentinel"
        }, 
        {
            "url": "https://apnews.com/article/papua-new-guinea-landslide-3e1444634d8859b1f2378b334c6a0d41", 
            "description": "A Papua New Guinea government official has told the United Nations that more than 2,000 people are believed to have been buried alive by a landslide Friday. The official formally asked for international help. The government figure is roughly triple a U.N. est…", 
            "title": "PNG landslide: More than 2,000 killed, government says - The Associated Press"
        }, 
        {
            "url": "https://www.newsweek.com/israel-egypt-shooting-rafah-gaza-today-latest-update-1904980", 
            "description": "There are reports of an incident between the Israeli and Egyptian militaries near the Rafah crossing.", 
            "title": "Israel-Egypt Border Shooting: What We Know - Newsweek"
        }, 
        {
            "url": "https://apnews.com/article/eu-palestinian-recognition-israel-gaza-c92c908ee11f8e4d37756aa44fa588ae", 
            "description": "Relations between the European Union and Israel took a nosedive on the eve of the diplomatic recognition of a Palestinian state by EU members Ireland and Spain. Spain has suggested sanctions should be considered against Israel for its continued attacks in the…", 
            "title": "EU, Israel in war of words as ties nosedive ahead of Spain, Ireland recognizing Palestinian state - The Associated Press"
        }, 
        {
            "url": "https://www.marketwatch.com/story/china-semiconductor-stocks-rally-on-reports-of-48-billion-chip-fund-bea929f5", 
            "description": "The third phase of the China Integrated Circuit Industry Investment Fund has reportedly doubled what was raised in 2014 and 2019,", 
            "title": "China semiconductor stocks rally on reports of $48 billion chip fund - MarketWatch"
        }, 
        {
            "url": "https://www.cbssports.com/mlb/news/ronald-acuna-jr-injury-five-trade-candidates-for-the-braves-after-losing-reigning-nl-mvp-for-season/", 
            "description": "The Braves currently sit in second place in the NL East", 
            "title": "Ronald Acuña Jr. injury: Five trade candidates for the Braves after losing reigning NL MVP for season - CBS Sports"
        }, 
        {
            "url": "https://sports.yahoo.com/the-timberwolves-have-harsh-lessons-to-learn-before-they-can-become-championship-caliber-062059359.html", 
            "description": "The Mavericks will advance to the NBA Finals, barring something historic or unforeseen, in the coming days. And the Timberwolves will soon start the process ...", 
            "title": "The Timberwolves have harsh lessons to learn before they can become championship caliber - Yahoo Sports"
        }, 
        {
            "url": "https://www.businessinsider.com/trump-election-biden-bad-news-bond-markets-bill-gross-deficit-2024-5", 
            "description": "A Trump presidency would worsen US fiscal deficits, the billionaire investor and PIMCO co-founder said.", 
            "title": "Billionaire 'Bond King' Bill Gross says a Trump win would be 'disruptive' for markets - Yahoo Finance"
        }, 
        {
            "url": "https://nypost.com/2024/05/27/entertainment/the-bachelorette-star-ryan-sutter-says-wife-tristas-absence-brought-questions-and-worry/", 
            "description": "“The Bachelorette” star Ryan Sutter is happy to have his wife, Season 1 lead Trista Sutter, home, after he shared some very cryptic posts about her whereabouts on social media.", 
            "title": "'The Bachelorette' star Ryan Sutter says wife Trista's absence brought 'questions' and 'worry' - New York Post "
        }, 
        {
            "url": "https://www.wave3.com/2024/05/27/gov-beshear-give-update-storm-damage-after-declaring-state-emergency/", 
            "description": "This is set for Monday at 11 a.m. Watch it here on the WAVE Now stream.", 
            "title": "Gov. Beshear to give update on storm damage after declaring State of Emergency - WAVE 3"
        }, 
        {
            "url": "https://www.axios.com/2024/05/26/rafah-tent-camp-israel-airstrike", 
            "description": null, 
            "title": "Israeli airstrike kills dozens in Rafah tent camp, Gaza authorities say - Axios"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/27/libertarians-pick-chase-oliver-for-us-president-as-trump-kennedy-rejected", 
            "description": "Antiwar activist supports a ceasefire between Israel and Hamas in Gaza, and end to the US military support for Ukraine.", 
            "title": "Libertarians pick Chase Oliver for US president as Trump, Kennedy rejected - Al Jazeera English"
        }, 
        {
            "url": "https://www.espn.com/mens-college-basketball/story/_/id/40227717/sources-kentucky-dj-wagner-joining-john-calipari-arkansas", 
            "description": "Kentucky transfer D.J. Wagner, a former top-five recruit, has committed to Arkansas, sources told ESPN.", 
            "title": "Sources - Kentucky's D.J. Wagner joining John Calipari at Arkansas - ESPN"
        }
    ], 
    "last_updated": "2024-05-28 19:19:00"
}