{
    "news": [
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.washingtonpost.com/nation/2024/05/25/george-floyd-anniversary-retrenchment/", 
            "description": "Four years after George Floyd’s murder, two Washington Post reporters reflect on the retrenchment of the racial-justice movement sparked by his death.", 
            "title": "Perspective | Four years later, has the racial-justice movement lost the fight? - The Washington Post"
        }, 
        {
            "url": "https://www.cbssports.com/mlb/news/bryce-harper-gets-ejected-in-the-middle-of-first-inning-insinuates-umpire-brian-walsh-isnt-a-professional/", 
            "description": "Harper had some thoughts to share postgame about Walsh", 
            "title": "Bryce Harper gets ejected in the middle of first inning, insinuates umpire Brian Walsh isn't a 'professional' - CBS Sports"
        }, 
        {
            "url": "https://www.washingtonpost.com/health/2024/05/25/fatigue-malaise-anemia-diagnosis-profile/", 
            "description": "When a 39-year-old woman complained of feeling “off,” her doctors mostly blamed stress. A key reason: She didn’t fit the profile for a devastating disease.", 
            "title": "A devastating diagnosis followed months of malaise, uncertainty - The Washington Post"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/25/sport/caitlin-clark-indiana-fever-la-sparks-2024-spt-intl/index.html", 
            "description": "Caitlin Clark hit what was a victory-sealing three-pointer to help lift the Indiana Fever to their first win of the season on Friday night against the LA Sparks.", 
            "title": "Caitlin Clark hits important late three-pointer to lift Indiana Fever to first victory of the season over LA Sparks - CNN"
        }, 
        {
            "url": "https://sports.yahoo.com/nba-playoffs-luka-doncic-drops-32-and-the-game-winner-as-mavericks-take-2-0-lead-030811472.html", 
            "description": "The Mavericks have a 2-0 lead. They made it hurt in Game 2.", 
            "title": "NBA playoffs: Luka Dončić drops 32 and the game-winner as Mavericks take 2-0 lead - Yahoo Sports"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/25/resort-day-passes.html", 
            "description": "ResortPass holds 95% of the day-guest market and has partnered with luxury hotels including the Waldorf-Astoria, JW Marriott and Fontainebleau.", 
            "title": "Rise of resort day passes offers travelers luxury on a budget - CNBC"
        }, 
        {
            "url": "https://www.ndtv.com/entertainment/stranger-things-star-millie-bobby-brown-is-now-married-to-fiance-jon-bon-jovi-details-inside-5743300", 
            "description": "The couple got engaged in April last year", 
            "title": "Stranger Things Star Millie Bobby Brown Is Now Married To Fiance Jon Bon Jovi. Details Inside - NDTV Movies"
        }, 
        {
            "url": "https://abcnews.go.com/US/severe-weather-onslaught-continues-big-storms-threaten-holiday/story?id=110557587", 
            "description": "Over 8 million people across seven states are facing dangerous weather.", 
            "title": "Severe weather onslaught continues as big storms threaten holiday travel - ABC News"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/25/trump-hush-money-gag-order-sentencing-00159995", 
            "description": null, 
            "title": "Trump is still pushing the limits of the gag order. It could come back to haunt him at sentencing. - POLITICO"
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-25/yellen-says-higher-path-for-rates-boosts-need-to-lift-revenue", 
            "description": "Treasury Secretary Janet Yellen said the outlook for higher interest rates over the long haul makes it tougher to contain US borrowing needs, heightening the importance of boosting revenue in negotiations with Republican lawmakers.", 
            "title": "Yellen Says Higher Path for Rates Boosts Need to Lift Revenue - Bloomberg"
        }, 
        {
            "url": "https://apnews.com/article/india-national-election-voting-closing-phases-540927f81662ec429a3957235a5635cd", 
            "description": "Millions of Indians are voting in the next-to-last round of a grueling national election in the searing summer heat. The combined opposition is trying to rattle Prime Minister Narendra Modi’s campaign for a third-consecutive term for himself and his Hindu nat…", 
            "title": "Lok Sabha elections 2024: Millions vote as Phase 6 polls get underway - The Associated Press"
        }, 
        {
            "url": "https://www.foxnews.com/media/five-most-eyebrow-raising-liberal-reactions-trumps-bronx-rally", 
            "description": "Far-left figures on MSNBC and Democratic politicians in New York lashed out at Donald Trump's campaign rally in the Bronx this week, claiming it was \"fake.\"", 
            "title": "Five of the most eyebrow-raising liberal reactions to Trump's Bronx rally - Fox News"
        }, 
        {
            "url": "https://nypost.com/2024/05/25/us-news/north-carolina-groundskeeper-justin-clontz-discovers-mysterious-space-debris-along-hiking-trail-near-glamping-collective/", 
            "description": "“It’s a one in a million chance that it lands, especially if it landed somewhere off the trail in the woods you’d have never found it but it just happened to land on the trail.”", 
            "title": "North Carolina groundskeeper discovers mysterious space debris along hiking trail: 'It's not from up here' - New York Post "
        }, 
        {
            "url": "https://www.businessinsider.com/what-is-going-on-with-economy-recession-unemployment-inflation-gdp-2024-5", 
            "description": "Hey, America, we are not in a recession, we haven't been in one for quite some time, and there isn't one coming soon.", 
            "title": "Hey, America, here's what's actually going on with the economy - Business Insider"
        }, 
        {
            "url": "https://www.wsj.com/us-news/law/doj-ticketmaster-live-nation-lawsuit-taylor-swift-1468add1", 
            "description": "The ‘Eras Tour’ singer’s presence looms over the antitrust lawsuit", 
            "title": "It's Taylor Swift's World. The Government Is Just Suing Ticketmaster in It. - The Wall Street Journal"
        }, 
        {
            "url": "https://www.bbc.com/future/article/20240524-how-googles-new-algorithm-will-shape-your-internet", 
            "description": "Over the last two years, a series of updates to Google Search amount to a dramatic upheaval to the Internet's most powerful tool, complete with an unprecedented AI feature.", 
            "title": "Google just updated its algorithm. The Internet will never be the same - BBC.com"
        }, 
        {
            "url": "https://www.dw.com/en/israel-hamas-war-israel-calls-icj-charges-morally-repugnant/live-69179825", 
            "description": "Genocide charges brought by South Africa were \"morally repugnant,\" Israel said in a statement issued after the International Court of Justice ordered Israel to \"immediately halt\" its military offensive. DW has more.", 
            "title": "Israel-Hamas war: ICJ charges 'morally repugnant' — Israel – DW – 05/25/2024 - DW (English)"
        }, 
        {
            "url": "https://nypost.com/2024/05/25/us-news/pennsylvania-man-bryan-hagerich-returns-home-after-arrest-in-turks-and-caicos/", 
            "description": "Hagerich said his detention was the “hardest time of my life” being separated from his family.", 
            "title": "Pennsylvania dad returns home after detainment in Turks and Caicos for ammo in his luggage - New York Post "
        }, 
        {
            "url": "https://cointelegraph.com/news/korea-under-pressure-to-approve-crypto-etfs-following-us-example", 
            "description": null, 
            "title": "US ETH ETF approval pressures Korean regulators - Cointelegraph"
        }
    ], 
    "last_updated": "2024-05-26 17:39:54"
}