{
    "news": [
        {
            "url": "https://www.washingtonpost.com/weather/2024/05/08/tornado-storm-outlook-tennessee-arkansas-missouri/", 
            "description": "Intense storms threaten large areas of the eastern United States, but the zone including St. Louis, Little Rock and Nashville is most at risk.", 
            "title": "Dangerous storm outbreak, tornadoes expected from Missouri to Tennessee - The Washington Post"
        }, 
        {
            "url": "https://apnews.com/article/israel-hamas-war-news-05-08-2024-495e6dabfdddc5587bd20e71b6ad421d", 
            "description": "The Israeli military says it has reopened the Kerem Shalom crossing into Gaza but a United Nations agency says no aid has yet entered. The key terminal for the entry of humanitarian aid was closed over the weekend after a Hamas rocket attack killed four Israe…", 
            "title": "Israel-Hamas war: Kerem Shalom crossing into Gaza reopens after rocket attack - The Associated Press"
        }, 
        {
            "url": "https://www.npr.org/2024/05/08/1249961060/swiss-army-knife-victorinox-bladeless", 
            "description": "Some governments have been cracking down on the knives people can carry in public as crime has increased. Victorinox said any bladeless offerings wouldn't replace its selection of Swiss Army Knives.", 
            "title": "Swiss Army Knife maker will offer bladeless products amid a rise in violence - NPR"
        }, 
        {
            "url": "https://arstechnica.com/gadgets/2024/05/m4-ipad-pro-cpu-cores-and-ram-amount-are-tied-to-storage-capacity/", 
            "description": "Apple has tied RAM to storage capacity in iPads, but it's a first for the CPU.", 
            "title": "M4 iPad Pro CPU cores and RAM amount are tied to storage capacity - Ars Technica"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/08/us/pro-palestinian-protests-arrests-colleges-dg/index.html", 
            "description": "Pro-Palestinian protesters continue to be arrested on college campuses. Explore the timeline of where protests erupted and who police have arrested on these campuses.", 
            "title": "How pro-Palestinian protest arrests have unfolded across college campuses - CNN"
        }, 
        {
            "url": "https://apnews.com/article/trump-fani-willis-georgia-election-indictment-31ca3234b244126cbe412dc279fd0562", 
            "description": "An attorney for Donald Trump says the former president looks forward to presenting arguments to a Georgia appeals court that will review a ruling letting Fani Willis keep prosecuting the election interference case against him. The Republican ex-president and …", 
            "title": "Georgia appeals court agrees to review ruling allowing Fani Willis to stay on Trump election case - The Associated Press"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://finance.yahoo.com/news/uber-forecasts-gross-bookings-second-105615535.html", 
            "description": "(Reuters) -Uber posted a surprise quarterly loss and forecast gross bookings below Wall Street expectations, sending its shares down 9% and putting the ride-...", 
            "title": "Uber shares tumble as weaker ride-share demand hurts Q2 forecast - Yahoo Finance"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/08/politics/rfk-jr-mercury-poisoning-brain-parasite/index.html", 
            "description": "Independent presidential candidate Robert F. Kennedy Jr. experienced a series of health issues in recent years, including an abnormality that he said was caused by a worm that entered his brain and then died, The New York Times reported on Wednesday.", 
            "title": "NYT: RFK Jr. says worm ‘got into my brain and ate a portion of it’ - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/08/world/boeing-starliner-new-launch-date-scn/index.html", 
            "description": "Engineers are replacing a valve on the rocket that will power the first crewed test flight of Boeing’s Starliner spacecraft. The launch is now expected no sooner than May 17.", 
            "title": "Boeing’s historic Starliner mission now expected to launch no sooner than May 17 after valve issue - CNN"
        }, 
        {
            "url": "https://pitchfork.com/news/steve-albini-storied-producer-and-icon-of-the-rock-underground-dies-at-61/", 
            "description": "The Shellac and Big Black frontman, who recorded classic albums by Nirvana, Pixies, PJ Harvey, and more, died of a heart attack", 
            "title": "Steve Albini, Storied Producer and Icon of the Rock Underground, Dies at 61 - Pitchfork"
        }, 
        {
            "url": "https://www.washingtonpost.com/world/2024/05/08/ukraine-electricity-rationing-russia-war/", 
            "description": "The Russian missile and drone strikes, which lasted more than three hours early Wednesday, targeted energy infrastructure in six Ukrainian regions.", 
            "title": "Ukraine orders nationwide electricity rationing after Russian airstrikes - The Washington Post"
        }, 
        {
            "url": "https://www.npr.org/sections/health-shots/2024/05/08/1249933035/medicaid-limits-wegovy-access", 
            "description": "New medications like Wegovy are changing the way people lose weight and manage obesity, but many Medicaid beneficiaries can't get them.", 
            "title": "Access to Wegovy limited in Medicaid programs : Shots - Health News - NPR"
        }, 
        {
            "url": "https://nypost.com/2024/05/08/world-news/boeing-cargo-plane-makes-emergency-belly-landing-after-landing-gear-fails-2/", 
            "description": "The aircraft, flying from Paris Charles de Gaulle Airport, informed the control tower in Istanbul that its landing gear had failed to open and touched down with guidance from the tower, managing to…", 
            "title": "Boeing cargo plane makes emergency 'belly' landing after landing gear fails - New York Post "
        }, 
        {
            "url": "https://www.npr.org/sections/health-shots/2024/05/08/1249622314/cdc-rules-dogs-import-travel-international-rabies", 
            "description": "The CDC announced stricter regulations for importing dogs from abroad — or traveling internationally with your furry companions.", 
            "title": "Traveling internationally with a dog just got a little harder : Shots - Health News - NPR"
        }, 
        {
            "url": "https://www.dallascowboys.com/news/zay-jones-cowboys-meet-to-discuss-possible-deal", 
            "description": "Looking to bolster the wide receivers depth chart even further following the 2024 NFL Draft, Dallas is hosting a visit with Zay Jones — son of a former Cowboys’ linebacker.", 
            "title": "Zay Jones, Cowboys meet to discuss possible deal - DallasCowboys.com"
        }, 
        {
            "url": "https://www.silverandblackpride.com/2024/5/8/24151636/nfl-schedule-release-2024-raiders-dates-opponents", 
            "description": "Let’s get ready for the NFL schedule release by looking at possible dates for the Las Vegas Raiders opponents in 2023", 
            "title": "2024 NFL schedule release : Preparing possible Las Vegas Raiders dates - Silver And Black Pride"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-reviews/kingdom-of-the-planet-of-the-apes-review-wes-ball-owen-teague-1235890518/", 
            "description": "Owen Teague, Freya Allan, Kevin Durand and William H. Macy lead the latest installment, depicting a future where humankind’s hubris has led to its downfall, making apes the dominant species.", 
            "title": "‘Kingdom of the Planet of the Apes’ Review: Wes Ball’s Exciting New Chapter Proves There’s Still Life in the Franchise - Hollywood Reporter"
        }, 
        {
            "url": "https://www.space.com/james-webb-space-telescope-diamond-super-earth-exoplanet-atmosphere", 
            "description": "\"We measured the thermal emissions from this rocky planet, and the measurement indicates that the planet has a substantial atmosphere. It is very exciting.\"", 
            "title": "This diamond exoplanet lost its atmosphere — then it grew another - Space.com"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/8/24151951/amazon-prime-video-pause-trivia-ads-announcement", 
            "description": "Amazon will roll out three new ad formats for Prime Video later this year to encourage subscribers to purchase promoted items while watching TV, movies, or live sports.", 
            "title": "Amazon Prime Video ads are about to get more intrusive - The Verge"
        }
    ], 
    "last_updated": "2024-05-09 20:08:29"
}