{
    "news": [
        {
            "url": "https://www.usatoday.com/story/news/world/2024/05/29/grindavik-volcano-eruption-iceland/73899542007/", 
            "description": null, 
            "title": "Video shows Iceland volcano erupt, blast lava into the sky - USA TODAY"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNic25ld3MuY29tL21pbm5lc290YS9uZXdzL3JlcG9ydGVkLWFjdGl2ZS1zaG9vdGluZy1zb3V0aC1taW5uZWFwb2xpcy13aGl0dGllci1ibGFpc2RlbGwv0gFpaHR0cHM6Ly93d3cuY2JzbmV3cy5jb20vYW1wL21pbm5lc290YS9uZXdzL3JlcG9ydGVkLWFjdGl2ZS1zaG9vdGluZy1zb3V0aC1taW5uZWFwb2xpcy13aGl0dGllci1ibGFpc2RlbGwv?oc=5", 
            "description": null, 
            "title": "Police officer among 2 killed in Minneapolis shooting; suspect also dead - CBS Minnesota"
        }, 
        {
            "url": "https://apnews.com/article/trump-conviction-what-to-know-a70941a7cd367f7b2aa3218ea91ad922", 
            "description": "Donald Trump’s conviction on 34 felony counts marks the end of his historic hush money trial but the fight over the case is far from over. Now comes the sentencing and the prospect of a prison sentence. A lengthy appellate process. And all the while, the pres…", 
            "title": "What's next for Donald Trump after hush money conviction - The Associated Press"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cjrr5ee5zv8o", 
            "description": "The New York Times, Wordle's owner, accuses similarly-named geography game of \"creating confusion.\"", 
            "title": "Wordle locked in legal row with geography spinoff, Worldle - BBC.com"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/31/euro-zone-inflation-may-2024.html", 
            "description": "The European Central Bank is widely expected to cut interest rates next week.", 
            "title": "Euro zone inflation rises to 2.6% in May, but bloc still seen heading for interest rate cut - CNBC"
        }, 
        {
            "url": "https://apnews.com/article/yemen-war-us-british-airstrikes-israel-hamas-12f99b7afc389a703f8dd333f2376b20", 
            "description": "Joint British-U.S. airstrikes targeting Yemen’s Houthi rebels killed at least 16 people and wounded 35 others. That's according to comments from the rebels Friday. That is the highest publicly acknowledged death toll strikes carried out over the rebels' attac…", 
            "title": "Houthi rebels say at least 16 killed, 35 others wounded in joint US-British airstrikes in Yemen - The Associated Press"
        }, 
        {
            "url": "https://www.reuters.com/markets/global-markets-wrapup-1-2024-05-31/", 
            "description": null, 
            "title": "Stocks and dollar idle ahead of Fed's favourite inflation figure - Reuters"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cy770l9llnzo", 
            "description": "The US president gives Ukraine permission to use US-supplied weapons to strike targets in Russia, but only near Kharkiv.", 
            "title": "Biden allows Ukraine to hit some targets in Russia with US weapons - BBC.com"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5kZWZlbnNlLmdvdi9OZXdzL1JlbGVhc2VzL1JlbGVhc2UvQXJ0aWNsZS8zNzkyMTE5L3JlYWRvdXQtb2Ytc2VjcmV0YXJ5LW9mLWRlZmVuc2UtbGxveWQtai1hdXN0aW4taWlpcy1tZWV0aW5nLXdpdGgtcGVvcGxlcy1yZXB1Ymwv0gEA?oc=5", 
            "description": null, 
            "title": "Readout of Secretary of Defense Lloyd J. Austin III's Meeting With People's Republic of Ch - Department of Defense"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/30/china/xi-jinping-arab-leaders-china-intl-hnk/index.html", 
            "description": "Chinese leader Xi Jinping decried “tremendous sufferings” in the Middle East and called for an international peace conference as leaders from Arab nations visit Beijing this week amid mounting global concern over Israel’s war in Gaza.", 
            "title": "China’s Xi Jinping calls for peace conference and ‘justice’ over war in Gaza as Arab leaders visit Beijing - CNN"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://nypost.com/2024/05/31/us-news/california-serial-slingshot-shooter-prince-raymond-king-who-terrorized-neighborhood-for-a-decade-is-found-dead-after-his-arrest/", 
            "description": "The senior was charged with five counts of felony vandalism and two counts of misdemeanor vandalism for allegedly targeting his neighbors’ property with the slingshot", 
            "title": "81-year-old 'serial slingshot shooter' found dead days after he's arrested for terrorizing neighborhood for a decade - New York Post "
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2FsYWJhbWEtZXhlY3V0aW9uLWVsZGVybHktY291cGxlLW11cmRlci1sZXRoYWwtaW5qZWN0aW9uLWM3Njc3YTVmZGY5MTMxMmI2ODYwYzk0ZGUyYWZhNTY10gEA?oc=5", 
            "description": null, 
            "title": "Months after nation's 1st nitrogen gas execution, Alabama gives man lethal injection for 2 killings - The Associated Press"
        }, 
        {
            "url": "https://www.cbssports.com/nba/gametracker/recap/NBA_20240530_DAL@MIN/", 
            "description": "Get real-time NBA basketball coverage and scores as Dallas Mavericks takes on Minnesota Timberwolves. We bring you the latest game previews, live stats, and recaps on CBSSports.com", 
            "title": "Dallas Mavericks vs. Minnesota Timberwolves Live Score and Stats - May 30, 2024 Gametracker - CBS Sports"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/31/biden-finalizing-plans-migrant-limits-us-mexico-border-00160944", 
            "description": null, 
            "title": "Biden said to be finalizing plans for migrant limits as part of a US-Mexico border clampdown - POLITICO"
        }, 
        {
            "url": "https://pagesix.com/2024/05/30/entertainment/will-smith-and-jada-pinkett-smith-cozy-up-on-the-red-carpet-after-separation-reveal/", 
            "description": "The couple was accompanied by their children, Willow Smith and Jaden Smith, as well as Will’s son Trey, whom he shares with ex-wife Sheree Zampino.", 
            "title": "Will Smith and Jada Pinkett Smith cozy up on red carpet in first joint appearance since separation reveal - Page Six"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c9xxpypr8d0o", 
            "description": "The party has been accused of putting jobs at risk by vowing not to issue any new oil and gas licences if it wins power.", 
            "title": "GB energy firm would secure future jobs, says Labour - BBC.com"
        }, 
        {
            "url": "https://www.eonline.com/news/1402737/angelina-jolie-and-brad-pitts-daughter-shiloh-officially-files-to-change-name", 
            "description": "Angelina Jolie and Brad Pitt’s daughter Shiloh Jolie-Pitt legally requested to drop the \"Pitt\" from her surname, according to paperwork filed on her 18th birthday.", 
            "title": "Angelina Jolie and Brad Pitt's Daughter Shiloh Files to Change Name - E! NEWS"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/30/health/bird-flu-michigan-third-human-case/index.html", 
            "description": "A third person in the US has tested positive for H5 bird flu in connection to an ongoing outbreak in dairy cattle, the Michigan Department of Health and Human Services said Thursday. This is the second human case reported in the state and the fourth ever in t…", 
            "title": "Third person in US tests positive for bird flu in connection to outbreak in dairy cattle - CNN"
        }
    ], 
    "last_updated": "2024-06-01 14:46:32"
}