{
    "news": [
        {
            "url": "https://www.politico.com/news/2024/05/25/menendez-trump-trials-00160022", 
            "description": null, 
            "title": "A porn star and gold bars: Menendez and Trump trials show split screen of alleged corruption - POLITICO"
        }, 
        {
            "url": "https://www.foxnews.com/world/mount-everest-climbing-duo-vanishes-notorious-area-worlds-tallest-peak", 
            "description": "A British climber and his Nepalese guide are feared dead after they went missing during an ice collapse near the summit of Mount Everest on Tuesday.", 
            "title": "Mount Everest climbing duo vanishes from notorious area of world's tallest peak - Fox News"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=iyWu957bV7A", 
            "description": "Hoop Streams is LIVE for Game 3 at Gainbridge Fieldhouse! The Boston Celtics lead the Indiana Pacers 2-0. Can the Indiana Pacers bounce back at their home co...", 
            "title": "Are the Celtics unstoppable? Boston Celtics vs Indiana Pacers Game 3 preview | Hoop Streams 🏀 - ESPN"
        }, 
        {
            "url": "https://www.cbsnews.com/news/tsa-memorial-day-travel-record/?ftag=YHF4eb9d17", 
            "description": "The Transportation Security Administration said more than 2.95 million individuals were screened at airport checkpoints on Friday.", 
            "title": "TSA sets new record for number of travelers screened in a single day - Yahoo! Voices"
        }, 
        {
            "url": "https://www.cbsnews.com/news/diplomatic-efforts-israel-hamas-hostage-talks-expected-resume-next-week-sources/", 
            "description": "U.S. diplomatic efforts to broker a deal to release hostages held in Gaza by Hamas and other allied groups are expected to continue in the coming week, two sources with knowledge told CBS News.", 
            "title": "Diplomatic efforts for Israel-Hamas hostage talks expected to resume next week, sources say - CBS News"
        }, 
        {
            "url": "https://www.reuters.com/world/us-rapper-nicki-minaj-held-by-police-amsterdam-airport-2024-05-25/", 
            "description": null, 
            "title": "Nicki Minaj cancels show in England after being held at Amsterdam airport - Reuters"
        }, 
        {
            "url": "https://nypost.com/2024/05/25/us-news/biden-repeats-naval-academy-appointment-story-at-west-point-commencement/", 
            "description": "Biden previously told the same story to graduating midshipmen in 2022.", 
            "title": "Biden repeats Naval Academy appointment story at West Point commencement - New York Post "
        }, 
        {
            "url": "https://www.espn.com/mlb/story/_/id/40218784/edwin-diaz-fourth-blown-save-leads-new-york-mets-loss", 
            "description": "Edwin Diaz, after a weeklong role demotion, was back closing a game for the New York Mets on Saturday, but he authored his fourth blown save in nine chances this season as the San Francisco Giants raced to a 7-2 victory at Citi Field.", 
            "title": "Edwin Diaz's fourth blown save leads to New York Mets' loss - ESPN"
        }, 
        {
            "url": "https://www.washingtonpost.com/world/2024/05/25/kharkiv-market-russian-strike-ukraine/", 
            "description": "The deadly attack on the home improvement and supplies chain in Ukraine’s second largest city comes amid a Russian offensive in eastern Ukraine.", 
            "title": "Russia bombs market in Kharkiv, killing at least 6 and wounding 40 - The Washington Post"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/2024-cannes-film-festival-winners-1235909044/", 
            "description": "Francis Ford Coppola presented old friend and colleague George Lucas with an honorary Palme d'Or at the awards ceremony for the 77th Cannes Film Festival Saturday night.", 
            "title": "Cannes: Sean Baker’s ‘Anora’ Wins Palme d’Or as ‘Emilia Pérez’ Takes Two Awards - Hollywood Reporter"
        }, 
        {
            "url": "http://deadline.com/2024/05/hidden-figures-glen-powell-worried-he-ruined-film-1235941318/", 
            "description": "Rough cuts of films can be scary, Glen Powell says.", 
            "title": "‘Hidden Figures’ Co-Star Glen Powell Worried He Ruined The Film - Deadline"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=VD58jlmtkE8", 
            "description": "For more info on Coach Paint Lite click here: https://bit.ly/coachpaintlite and use my code: bballbreakdown for 10% OFF! #mavericks #lukadoncic #timberwolves...", 
            "title": "Luka INSANE Game Winner Exposes Wolves Issues | Mavericks Timberwolves Gm 2 Western Conf Finals - BBALLBREAKDOWN"
        }, 
        {
            "url": "https://thehill.com/regulation/court-battles/4686183-cnns-kaitlan-collins-calls-out-trump-for-claim-about-trial-judge-thats-not-true/", 
            "description": "CNN anchor Kaitlan Collins called out former President Trump during the opening of her Friday show for a claim that Judge Juan Merchan, who is presiding over his hush-money trial, is blocking him from bringing in an election expert to testify.  “In one post, …", 
            "title": "CNN’s Kaitlan Collins calls out Trump for claim about trial judge: ‘That’s not true’ - The Hill"
        }, 
        {
            "url": "https://thewaltdisneycompany.com/remembering-disney-legend-richard-m-sherman/", 
            "description": "Disney Legend Richard M. Sherman, half of the Academy Award®-winning songwriting team of the Sherman Brothers (with his late brother, Disney Legend Robert B. …Read More", 
            "title": "Remembering Disney Legend Richard M. Sherman - The Walt Disney Company"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/25/politics/samuel-alito-wife-upside-down-flag/index.html", 
            "description": "Supreme Court Justice Samuel Alito’s wife previously said the inverted American flag flown at the couple’s house in January 2021 was “an international signal of distress,” The Washington Post reported Saturday, detailing an encounter during that time between …", 
            "title": "Washington Post: Justice Samuel Alito’s wife said upside-down American flag was ‘an international signal of distress’ in 2021 - CNN"
        }, 
        {
            "url": "https://www.npr.org/2024/05/25/nx-s1-4981449/u-s-army-vessels-beached-israel-gaza", 
            "description": "Rough seas drove two vessels to beach in Israel and two others to anchor on a Gaza beach. Israeli forces are assisting recovery operations near the pier, U.S. officials said. There were no injuries.", 
            "title": "U.S. Army aid vessels become unmoored near floating Gaza pier - NPR"
        }, 
        {
            "url": "http://www.nbcconnecticut.com/news/national-international/bear-meat-kebabs-at-a-family-reunion-lead-to-rare-outbreak-of-roundworm-disease/3298676/", 
            "description": "Six people developed trichinellosis, a disease linked to undercooked meat contaminated with roundworm larvae, a CDC report says.", 
            "title": "Bear meat kebabs at a family reunion lead to rare outbreak of roundworm disease - NBC Connecticut"
        }, 
        {
            "url": "https://apnews.com/article/trump-libertarian-convention-rfk-jr-biden-816e3209fdf993c2ba7f6caed0ebcdb7", 
            "description": "Donald Trump plans to use an address at the Libertarians’ national convention to court a segment of mostly conservative voters that has often been skeptical of the former president. He's also trying to ensure that party activists aren’t drawn to the campaign …", 
            "title": "Trump to go after RFK Jr. at Libertarian Party convention - The Associated Press"
        }, 
        {
            "url": "https://www.foxnews.com/world/israel-forced-work-jewish-sabbath-un-court-judge-calls-out-colleagues-scathing-dissent", 
            "description": "The U.N. International Court of Justice (ICJ) on Friday ordered Israel to end its military offensive in the southern city of Rafah in Gaza, responding to South Africa's claims of genocide.", 
            "title": "Israel forced to work on Jewish Sabbath as UN court judge calls out colleagues in scathing dissent - Fox News"
        }
    ], 
    "last_updated": "2024-05-27 04:10:44"
}