{
    "news": [
        {
            "url": "https://spaceflightnow.com/2024/05/12/live-coverage-spacex-to-reach-6000-starlink-satellites-on-orbit-following-falcon-9-launch-from-cape-canaveral/", 
            "description": null, 
            "title": "SpaceX reaches nearly 6000 Starlink satellites on orbit following Falcon 9 launch from Cape Canaveral – Spaceflight Now - Spaceflight Now"
        }, 
        {
            "url": "https://www.foxnews.com/sports/travis-kelce-spotted-dancing-star-studded-group-taylor-swifts-paris-show", 
            "description": "Kansas City Chiefs star Travis Kelce was back showing his support for girlfriend Taylor Swift, this time in Paris, where he was alongside some A-list celebrities.", 
            "title": "Travis Kelce spotted dancing in star-studded group at Taylor Swift's Paris show - Fox News"
        }, 
        {
            "url": "https://www.cbsnews.com/news/jerry-seinfeld-duke-university-commencement-address-graduates-walk-out/", 
            "description": "Jerry Seinfeld, who has supported Israel since the Oct. 7 attack by Hamas militants, delivered the commencement address at Duke University on Sunday.", 
            "title": "Duke University graduates walk out ahead of Jerry Seinfeld's commencement address - CBS News"
        }, 
        {
            "url": "https://www.eonline.com/news/1401439/kate-gosselin-shares-rare-photo-of-4-of-her-and-jons-sextuplets-at-their-20th-birthday-celebration", 
            "description": "Four of Kate Gosselin and ex Jon Gosselin's sextuplets, Alexis, Aaden, Leah and Joel, appear at their 20th birthday celebration at a pic their mom shared on Mother's Day 2024.", 
            "title": "Kate Gosselin Shares Rare Photo of 4 of Her and Jon's Sextuplets at Their 20th Birthday Celebration - E! Online - E! NEWS"
        }, 
        {
            "url": "https://www.jayski.com/2024/05/12/brad-keselowski-breaks-110-race-drought-with-dramatic-darlington-win/", 
            "description": null, 
            "title": "Brad Keselowski breaks 110-race drought with dramatic Darlington win - Jayski.com"
        }, 
        {
            "url": "https://www.cleveland.com/news/2024/05/suspect-in-fatal-euclid-police-officer-shooting-is-found-dead-after-police-standoff-in-shaker-heights.html", 
            "description": ".", 
            "title": "Suspect in fatal Euclid police officer shooting is found dead after standoff in Shaker Heights - cleveland.com"
        }, 
        {
            "url": "https://www.cbsnews.com/colorado/news/dozens-colorado-dairy-farm-workers-monitored-avian-bird-flu-symptoms/", 
            "description": "The Colorado Department of Public Health and Environment confirmed Friday that approximately 70 dairy farm workers are currently being monitored for possible symptoms of avian flu.", 
            "title": "Dozens of Colorado dairy farm workers monitored for bird flu symptoms - CBS News"
        }, 
        {
            "url": "https://www.cbssports.com/nba/news/2024-nba-draft-order-complete-list-of-picks-as-atlanta-hawks-win-no-1-selection-in-lottery/", 
            "description": "The full draft order was unveiled Sunday afternoon", 
            "title": "2024 NBA Draft order: Complete list of picks as Atlanta Hawks win No. 1 selection in Lottery - CBS Sports"
        }, 
        {
            "url": "https://www.startribune.com/timberwolves-nuggets-live-game-report-nikola-jokic-anthony-edwards-nba-playoffs/600365426/", 
            "description": "Denver's win in Game 3 enabled it to cut the Wolves' lead to 2-1 entering tonight's contest at Target Center.", 
            "title": "Live from Timberwolves-Nuggets Game 4 - Star Tribune"
        }, 
        {
            "url": "https://arstechnica.com/cars/2024/05/the-2025-aston-martin-vantage-gets-a-bold-new-body-and-big-power-boost/", 
            "description": "It features modern tech, a better interior, and an extra 150 hp on the old model.", 
            "title": "The 2025 Aston Martin Vantage gets a bold new body and big power boost - Ars Technica"
        }, 
        {
            "url": "https://www.cbsnews.com/news/israel-preparing-for-rafah-invasion-amid-increasing-tension-with-us-over-gaza-humanitarian-crisis-60-minutes-transcript/", 
            "description": "Israel, preparing for a possible Rafah invasion, faces increased tension with the U.S. over the Gaza humanitarian crisis. To the north, it's also confronting Hezbollah attacks coming in from Lebanon.", 
            "title": "Israel preparing for Rafah invasion amid increasing tension with U.S. over humanitarian crisis in Gaza - CBS News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/12/politics/michael-cohen-trump-hush-money/index.html", 
            "description": "Nobody has anything nice to say about Michael Cohen.", 
            "title": "Here are all the bad things witnesses have said about Michael Cohen, Trump’s former fixer who is set to testify Monday - CNN"
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-12/asian-stocks-eye-sluggish-start-after-china-data-markets-wrap", 
            "description": "Asian stocks clawed back earlier losses as reports China is planning to start selling the first batch of its 1 trillion yuan ($138 billion) issue of ultra-long bonds boosted optimism the funds will help bolster the economy.", 
            "title": "Stock Market Today: Dow, S&P Live Updates for May 13, 2024 - Bloomberg"
        }, 
        {
            "url": "https://www.espn.com/nba/story/_/id/40133896/indiana-pacers-cruise-new-york-knicks-tie-series", 
            "description": "The Indiana Pacers utilized a 69-point first half to control Game 4 against the New York Knicks on Sunday afternoon in Indianapolis, evening the series at 2-2 before the East Semifinals shift back to Madison Square Garden for a pivotal Game 5.", 
            "title": "Indiana Pacers cruise past New York Knicks, tie series - ESPN"
        }, 
        {
            "url": "https://apnews.com/article/russia-belgorod-shelling-building-collapse-259b543bb479bea475051850e0b8fd2a", 
            "description": "An apartment building has partially collapsed in the Russian border city of Belgorod, and officials say at least 13 people have been killed and 20 others injured. Authorities blamed Ukrainian shelling for the building’s destruction Sunday. Online footage show…", 
            "title": "Apartment building partially collapses in a Russian border city after shelling. At least 13 killed - The Associated Press"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/12/russias-putin-to-remove-shoigu-as-defence-minister", 
            "description": "President proposes Andrei Belousov as defence minister with Sergei Shoigu to become secretary of Security Council.", 
            "title": "Russia’s Putin to remove Shoigu as defence minister - Al Jazeera English"
        }, 
        {
            "url": "https://apnews.com/article/box-office-kingdom-planet-apes-fall-guy-68f5bc2b3a48851ad190652f6cc055f3", 
            "description": "“Kingdom of the Planet of the Apes” has reigned over the weekend box office. Studio estimates Sunday said the latest installment in the “Apes” franchise brought in $56.5 million in North American theaters. It was a much-needed surge for what could be an uncer…", 
            "title": "'Kingdom of the Planet of the Apes' reigns at the box office with $56.5 million opening - The Associated Press"
        }, 
        {
            "url": "https://www.ksl.com/article/51006239/astronomers-finally-detect-a-rocky-planet-with-an-atmosphere", 
            "description": "Astronomers have searched for years for rocky planets beyond our solar system with an atmosphere — a trait considered essential for any possibility of harboring life.", 
            "title": "Astronomers finally detect a rocky planet with an atmosphere - KSL.com"
        }, 
        {
            "url": "https://nypost.com/2024/05/12/us-news/boardwalk-empire-star-steve-buscemi-attacked-by-rock-wielding-maniac-in-nyc/", 
            "description": "Actor Steve Buscemi, a Brooklyn native and one-time FDNY firefighter, became the latest victim of random New York City street violence when he was slugged by a vagrant who ran off.", 
            "title": "'Boardwalk Empire' star Steve Buscemi punched by maniac in random NYC attack - New York Post "
        }
    ], 
    "last_updated": "2024-05-14 03:46:48"
}