{
    "news": [
        {
            "url": "https://sports.yahoo.com/how-to-watch-the-2024-preakness-stakes-race-today-start-time-channel-odds-where-to-stream-and-more-104549262.html", 
            "description": "It's almost time for the 149th annual Preakness Stakes!", 
            "title": "How to watch the 2024 Preakness Stakes race today: Start time, channel, odds, where to stream and more - Yahoo Sports"
        }, 
        {
            "url": "https://www.ft.com/content/27041f14-3700-4f1d-add4-ba2ea97ee063", 
            "description": "Ultimatum by member of Netanyahu’s war cabinet brings to a head months of internal tension over Gaza", 
            "title": "Gantz threatens to quit Israeli government if no new war plan by June 8 - Financial Times"
        }, 
        {
            "url": "http://deadline.com/2024/05/sean-combs-video-assault-charges-cassie-da-1235922508/", 
            "description": "The much accused ex-mogul may have slipped through the fingers of the law again, or not", 
            "title": "Sean Combs Won’t Face Charges For 2016 L.A. Beating Of Cassie, DA Says, Despite Video Evidence; “Cover-Up” Could Warrant Possible Probe - Deadline"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/emilia-perez-cannes-selena-gomez-zoe-saldana-1235903359/", 
            "description": "French auteur Jacques Audiard's film landed the biggest response of the fest so far, and left Saldaña in tears.", 
            "title": "Selena Gomez, Zoe Saldaña Deliver Cannes’ First Hit With Trans Gangster Musical ‘Emilia Perez’ - Hollywood Reporter"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cxwwlnrgw7go", 
            "description": "The Israeli military said Ron Benjamin was found alongside the bodies of three other hostages.", 
            "title": "Body of hostage recovered from Gaza, says IDF - BBC.com"
        }, 
        {
            "url": "https://www.cbsnews.com/news/3-people-killed-in-western-new-york-after-vehicle-hit-by-amtrak-train/", 
            "description": "Amtrak Train 281 was traveling from New York City to Niagara Falls.", 
            "title": "3 killed in western New York after vehicle hit by Amtrak train - CBS News"
        }, 
        {
            "url": "http://9to5google.com/2024/05/18/pixel-9-pro-fold-colors/", 
            "description": "Going hand-in-hand with the wallpapers today is a look at the colors for the Pixel 9, Pixel 9 Pro, Pixel 9 Pro XL, and Pixel 9 Pro Fold...", 
            "title": "Pixel 9, 9 Pro, 9 Pro XL, and 9 Pro Fold leak suggests muted colors - 9to5Google"
        }, 
        {
            "url": "https://www.foxbusiness.com/business-leaders/boeing-reelects-outgoing-ceo-search-replacement-continues-safety-culture-crisis", 
            "description": "Boeing's safety culture crisis has included multiple whistleblowers who have come forward after several incidents that have drawn public attention to potential issues with the company's planes.", 
            "title": "Boeing re-elects outgoing CEO as search for replacement continues amid safety culture crisis - Fox Business"
        }, 
        {
            "url": "https://www.nbcnews.com/politics/politics-news/two-hours-mocking-arizonas-attorney-general-rudy-giuliani-served-birth-rcna152905", 
            "description": "PHOENIX — Arizona’s Democratic Attorney General Kris Mayes on Friday announced that Rudy Giuliani had been served with the notice of his indictment on charges related to a conspiracy to overturn the 2020 election results in Arizona.", 
            "title": "Rudy Giuliani gets indictment papers at birthday party after mocking Arizona attorney general - NBC News"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c89z7ll532xo", 
            "description": null, 
            "title": "Slovakia at pivotal moment after Robert Fico shooting - BBC.com"
        }, 
        {
            "url": "https://www.courier-journal.com/story/news/local/2024/05/18/scottie-scheffler-arrest-louisville-mayor-says-no-body-cam-of-incident/73748175007/", 
            "description": "The mayor said other footage shot from another angle will be released in the coming days.", 
            "title": "Scottie Scheffler arrest: Louisville mayor says no body cam of incident - Courier Journal"
        }, 
        {
            "url": "https://www.etonline.com/john-stamos-shares-new-pic-of-mary-kate-and-ashley-olsen-reuniting-with-full-house-cast-225732", 
            "description": "John Stamos shared a new photo of the cast's reunion in honor of the late Bob Saget's birthday.", 
            "title": "John Stamos Shares New Pic of Mary-Kate and Ashley Olsen Reuniting With 'Full House' Cast - Entertainment Tonight"
        }, 
        {
            "url": "https://www.espn.com/boxing/story/_/id/40152003/tyson-fury-vs-oleksandr-usyk-live-boxing-results-analysis", 
            "description": "Fury and Usyk fight Saturday to crown the first undisputed heavyweight champ in the four-belt era. Follow live.", 
            "title": "Tyson Fury vs. Oleksandr Usyk live results and analysis - ESPN"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/18/upside-down-flag-at-justice-alitos-home-another-blow-for-supreme-court-under-fire-00158772", 
            "description": null, 
            "title": "Controversy over upside-down flag at Justice Alito's home another blow for Supreme Court under fire - POLITICO"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.npr.org/2024/05/18/1252311564/nasa-boeing-starliner-launch-delayed-international-space-station", 
            "description": "A helium leak pushed back a planned launch to May 25. Boeing's program that would shuttle astronauts to and from the International Space Station has been plagued with problems.", 
            "title": "Boeing's troubled Starliner spacecraft launch delayed to May 25 - NPR"
        }, 
        {
            "url": "https://variety.com/2024/film/box-office/if-opening-day-ryan-reynolds-strangers-chapter-1-1236008141/", 
            "description": "Ryan Reynolds and John Krasinski's imaginary friends comedy \"IF\" will open atop domestic charts, while \"The Strangers: Chapter 1\" also debuts.", 
            "title": "Box Office: ‘IF’ Stumbles on Opening Day With $10.3 Million, ‘The Strangers: Chapter 1’ Unmasking Third Place - Variety"
        }, 
        {
            "url": "https://thehill.com/homenews/house/4671937-jamie-raskin-calls-marjorie-taylor-greene-house-oversight-brawl-failure-leadership/", 
            "description": "House Oversight and Accountability Committee Ranking Member Jamie Raskin (R-Md.) called the recent verbal battle in his committee sparked by Rep. Marjorie Taylor Greene’s (R-Ga.) words “a failure of leadership.” “So, this was a failure of leadership,” Raskin …", 
            "title": "Raskin calls Greene House Oversight brawl ‘a failure of leadership’ - The Hill"
        }, 
        {
            "url": "https://www.space.com/nasa-prefire-polar-climate-cubesats", 
            "description": "Heat emissions from Earth's poles are something we know surprisingly little about.", 
            "title": "NASA's PREFIRE mission is ready to unlock the mysteries of Earth's poles - Space.com"
        }, 
        {
            "url": "https://apnews.com/article/houston-texas-storms-power-outages-86643a6d7decd28e971774e03b52e51d", 
            "description": "As the Houston area works to clean up and restore power to hundreds of thousands after deadly storms left at least seven people dead, it will do so amid a smog warning and rising Texas heat. The National Weather Service in Houston warned people to know the sy…", 
            "title": "Houston weather: 7 dead as storm power outages raise heat risk - The Associated Press"
        }
    ], 
    "last_updated": "2024-05-19 23:30:34"
}