{
    "news": [
        {
            "url": "https://www.cbsnews.com/news/marjorie-taylor-greene-oust-house-speaker-mike-johnson/", 
            "description": "Greene's move marked a reversal from a day earlier, when the Georgia Republican appeared to retreat from her threat to trigger a vote to remove Johnson as speaker.", 
            "title": "House votes to kill Marjorie Taylor Greene's effort to oust House Speaker Mike Johnson - CBS News"
        }, 
        {
            "url": "https://www.northjersey.com/story/sports/nba/knicks/2024/05/08/jalen-brunson-injury-knicks-pacers-updates-nba-playoffs/73621977007/", 
            "description": null, 
            "title": "Jalen Brunson leaves Knicks' playoff game vs. Pacers with foot injury - Latest updates - NorthJersey.com"
        }, 
        {
            "url": "https://nypost.com/2024/05/08/lifestyle/miss-usa-miss-teen-usa-quit-after-pageant-bullying-source/", 
            "description": "“This toxic atmosphere is a serious concern,” a source close to the situation told The Post of both Miss USA and Miss Teen USA resigning their titles this week.", 
            "title": "Miss USA, Miss Teen USA quit after being 'bullied' by organization's CEO: sources - New York Post "
        }, 
        {
            "url": "https://www.cbsnews.com/news/roger-fortson-airman-killed-deputy-wrong-apartment-florida/", 
            "description": "Florida sheriff deputies burst into the wrong apartment and fatally shot Senior Airman Roger Fortson, Civil rights attorney Ben Crump said.", 
            "title": "Florida sheriff deputies burst into wrong apartment and fatally shot U.S. airman, attorney says - CBS News"
        }, 
        {
            "url": "https://apnews.com/article/brazil-porto-alegre-floods-rio-grande-do-sul-6daa5788e5cf6ec9a94cb3ea30fa6b18", 
            "description": "Authorities in southern Brazil are rushing to rescue survivors of massive flooding that has killed at least 100 people, but some residents are refusing to leave belongings behind while others are returning to evacuated homes despite the risk of new storms. Au…", 
            "title": "Southern Brazil is still reeling from massive flooding as it faces risk from new storms - The Associated Press"
        }, 
        {
            "url": "https://www.espn.com/nba/story/_/id/40109006/nuggets-nikola-jokic-wins-nba-mvp-3rd-4-seasons", 
            "description": "Nuggets star Nikola Jokic became the NBA's ninth three-time MVP, easily beating out the Thunder's Shai Gilgeous-Alexander and the Mavs' Luka Doncic on Wednesday.", 
            "title": "Nuggets' Nikola Jokic wins NBA MVP for 3rd time in 4 seasons - ESPN"
        }, 
        {
            "url": "https://www.washingtonpost.com/entertainment/music/2024/05/08/steve-albini-death-nirvana/", 
            "description": "Steve Albini, the Chicago alt-rock producer who worked with some of the greatest American rock acts, has died, his studio confirmed.", 
            "title": "Steve Albini, Nirvana and The Pixies music producer, dies at 61 - The Washington Post"
        }, 
        {
            "url": "https://www.bbc.com/news/uk-politics-68980700", 
            "description": "Natalie Elphicke has previously attacked Labour over policies including migration and taxes.", 
            "title": "Natalie Elphicke: Starmer faces anger after Tory MP's defection - BBC.com"
        }, 
        {
            "url": "https://www.freep.com/story/news/local/michigan/2024/05/08/tornadoes-tear-through-midwest-with-at-least-2-ripping-west-michigan/73610750007/", 
            "description": "For the first time in Michigan, the National Weather Service issued a tornado emergency, as the storms hit the Kalamazoo area and state's west side.", 
            "title": "Michigan tornadoes damage areas in Portage, Branch and St. Joseph - Detroit Free Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/08/health/ultraprocessed-foods-death-study-wellness/index.html", 
            "description": "Studies have shown that ultraprocessed foods can have a detrimental impact on health. But 30 years of research show they don’t all have the same impact.", 
            "title": "Ultraprocessed foods linked with early death, according to 30 years of research - CNN"
        }, 
        {
            "url": "https://www.nbcsports.com/nba/news/if-trail-blazers-move-on-from-chauncey-billups-as-coach-other-teams-lined-up", 
            "description": "Billups was hired to coach a playoff team with Damian Lillard but the job has changed.", 
            "title": "If Trail Blazers move on from Chauncey Billups as coach, other teams lined up - Yahoo Sports"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/08/middleeast/rafah-israel-idf-ground-operation-intl-latam/index.html", 
            "description": "Images obtained by CNN from Planet Labs bear a striking resemblance to the early stages of Israel’s ground invasion of Gaza in October 2023.", 
            "title": "Israeli military operations in Rafah expand from airstrikes to ground operations, satellite images show - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/08/politics/joe-biden-interview-cnntv/index.html", 
            "description": "President Joe Biden said for the first time Wednesday he would halt shipments of American weapons to Israel – which he acknowledged have been used to kill civilians in Gaza – if Prime Minister Benjamin Netanyahu orders a major invasion of the city of Rafah.", 
            "title": "Biden says he will stop sending bombs and artillery shells to Israel if they launch major invasion of Rafah - CNN"
        }, 
        {
            "url": "https://www.npr.org/2024/05/08/1249994099/schools-antisemitism-k-12", 
            "description": "Republicans tried for the kind of headline moments they've scored in similar hearings with elite college presidents. But the testimony from K-12 public school leaders offered few surprises.", 
            "title": "Republicans and K-12 school leaders clash over handling of antisemitism - NPR"
        }, 
        {
            "url": "https://www.nbcnews.com/news/us-news/4-flight-attendants-arrested-accused-taking-millions-drug-money-domini-rcna151312", 
            "description": "Four flight attendants abused “their privileges as airline employees” and smuggled “millions of dollars of drug money” out of New York City to the Dominican Republic, federal authorities said Wednesday.", 
            "title": "4 flight attendants arrested, accused of taking millions in drug money to Dominican Republic - NBC News"
        }, 
        {
            "url": "https://thehill.com/regulation/court-battles/4652188-questions-about-trumps-hush-money-criminal-trial-answered/", 
            "description": "The Hill’s reporters covering former President Trump’s hush money criminal case answered questions about the ongoing trial in New York. Trump is standing trial on 34 counts of falsifying business records connected to hush money deals negotiated during his 201…", 
            "title": "Questions about Trump's hush money criminal trial, answered - The Hill"
        }, 
        {
            "url": "http://www.billboard.com/music/chart-beat/kendrick-lamars-catalog-up-streams-drake-down-beef-1235677562/", 
            "description": "Kendrick Lamar sees his back catalog up in streams by half after a weekend of beefing with Drake, whose catalog is down by comparison.", 
            "title": "Kendrick Lamar’s Back Catalog Up 49% Following Weekend of Beef, Drake’s Down 5% - Billboard"
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-08/arm-shares-slip-after-chip-designer-gives-tepid-annual-forecast", 
            "description": "Arm Holdings Plc shares tumbled after the chip designer gave a lukewarm revenue forecast for the fiscal year, raising concerns that the tech industry’s artificial intelligence spending spree is slowing.", 
            "title": "Arm Shares Slip After Chip Designer Gives Tepid Annual Forecast - Bloomberg"
        }, 
        {
            "url": "https://www.tennessean.com/story/weather/2024/05/08/nashville-severe-weather-updates-tornadoes-flooding/73597061007/", 
            "description": "The Middle Tennessee region will experience multiple rounds of thunderstorms on Wednesday. Severe weather will be possible with all rounds said the weather service.", 
            "title": "Nashville area weather updates: Tornado warnings issued; flash flooding a concern - Tennessean"
        }, 
        {
            "url": "https://www.statnews.com/2024/05/08/bird-flu-in-milk-h5n1-levels-suggest-asymptomatic-cows/", 
            "description": "How is it that so much bird flu virus is getting off of affected dairy farms and into the national milk supply?", 
            "title": "Bird flu in milk supply is likely coming from asymptomatic cows- STAT - STAT"
        }
    ], 
    "last_updated": "2024-05-10 03:39:08"
}