{
    "news": [
        {
            "url": "https://www.tmz.com/2024/05/27/diddy-sean-john-pull-america-best-contacts-eyeglasses-frames/", 
            "description": null, 
            "title": "Diddy's Sean John Frames Pulled From America's Best Contacts and Eyeglasses - TMZ"
        }, 
        {
            "url": "https://www.reuters.com/technology/elon-musks-xai-raises-6-bln-series-b-funding-round-2024-05-27/", 
            "description": null, 
            "title": "Elon Musk's xAI valued at $24 bln after fresh funding - Reuters"
        }, 
        {
            "url": "https://www.autosport.com/indycar/news/indy-500-newgarden/10616310/", 
            "description": "Team Penske’s Josef Newgarden fought off Pato O’Ward in a last-lap showdown to take back-to-back Indianapolis 500 victories.", 
            "title": "Indy 500: Newgarden beats O'Ward for back-to-back wins - Autosport"
        }, 
        {
            "url": "https://apnews.com/article/south-korea-china-japan-trilateral-6afe4c3e280995a7fc16696edbd0a345", 
            "description": "China’s premier has agreed to revive three-way cooperation with South Korea and Japan in the face of shared challenges but issued a veiled rebuke against the two countries’ expanding security cooperation with the United States. Chinese Premier Li Qiang met So…", 
            "title": "South Korea, China and Japan resume trilateral meeting to revive cooperation - The Associated Press"
        }, 
        {
            "url": "https://apnews.com/article/south-africa-election-anc-apartheid-9215778b4184e2fcb02a9008f3558975", 
            "description": "South Africans will vote Wednesday to decide whether their country takes its most significant political step since it brought down apartheid and achieved democracy 30 years ago. This national election will not be as momentous as the one South Africa held in 1…", 
            "title": "South Africa's election could bring the biggest political shift since it became a democracy in 1994 - The Associated Press"
        }, 
        {
            "url": "https://fox2now.com/news/missouri/severe-weather-brings-hail-tornado-warnings-to-st-louis-area/", 
            "description": "The St. Louis region was slammed by severe weather late afternoon and early Sunday evening. A storm system moved over the entire viewing area, leading to tornado warnings, heavy rain, and plenty of hail piling up quickly across the area in various sizes.", 
            "title": "Severe weather brings hail, tornado warnings to St. Louis area - KTVI Fox 2 St. Louis"
        }, 
        {
            "url": "https://apnews.com/article/new-caledonia-france-kanak-097b74f915c025c4a3fae8ca73f4e28a", 
            "description": "French President Emmanuel Macron has decided to lift the state of emergency in the French Pacific territory of New Caledonia. Macron's office said the move is meant to allow political dialogue following the unrest that left seven dead and a trail of destructi…", 
            "title": "France to lift state of emergency in efforts to allow political dialogue in riot-hit New Caledonia - The Associated Press"
        }, 
        {
            "url": "https://sports.yahoo.com/nba-playoffs-luka-doncic-mavericks-power-past-anthony-edwards-to-take-a-3-0-lead-over-timberwolves-024023251.html", 
            "description": "The Mavericks are now just one win away from their first NBA Finals trip since 2011.", 
            "title": "NBA playoffs: Luka Dončić, Mavericks power past Anthony Edwards to take a 3-0 lead over Timberwolves - Yahoo Sports"
        }, 
        {
            "url": "https://fox17.com/news/local/code-red-alert-upgraded-risk-for-severe-storms-tornadoes-in-middle-tennessee-tonight", 
            "description": "NASHVILLE, Tenn.--Parts of Middle Tennessee, including Nashville, have been upgraded to a 'Moderate' risk (Level 4 of 5) of severe weather Sunday night into Mon", 
            "title": "CODE RED ALERT: All of Middle Tennessee placed under Tornado Watch - WZTV"
        }, 
        {
            "url": "https://www.reuters.com/markets/deals/shares-china-evergrandes-ev-unit-soar-after-liquidators-stake-sale-deal-2024-05-27/", 
            "description": null, 
            "title": "Shares of China Evergrande's EV unit soar after liquidators' stake sale deal - Reuters.com"
        }, 
        {
            "url": "https://www.espn.com/mlb/story/_/id/40226101/atlanta-braves-ronald-acuna-jr-season-torn-acl", 
            "description": "Reigning NL MVP Ronald Acuña Jr. tore the ACL in his left knee Sunday and will miss the rest of the season, a significant blow to a Braves team that already lost ace Spencer Strider to Tommy John surgery.", 
            "title": "Braves' Ronald Acuña Jr. out for season with torn left ACL - ESPN"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cxxxp1w6e2ro", 
            "description": "Powerful storms devastate areas in Texas, Arkansas and Oklahoma and leave hundreds of thousands without power.", 
            "title": "Tornadoes and storms leave 15 dead across central US - BBC.com"
        }, 
        {
            "url": "https://www.bbc.com/news/av/world-europe-69064916", 
            "description": "People from a Dublin-bound plane from Doha describe scenes on board during severe turbulence.", 
            "title": "Dublin passengers recall 'panic' as Doha plane hit turbulence - BBC.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/26/europe/national-service-britain-uk-sunak-intl-latam/index.html", 
            "description": "Britain’s Conservative Party will introduce mandatory national service for 18-year-olds, comprising military or community participation, if it wins the national election on July 4, the UK’s leader said on Sunday.", 
            "title": "Britain’s Prime Minister Rishi Sunak pitches national service at 18 - CNN"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cmj66r4lvzzo", 
            "description": "The US housing market has changed dramatically since the pandemic - an issue looming over the election.", 
            "title": "Trying to buy a house is 'playing a game you can't win' - BBC.com"
        }, 
        {
            "url": "https://nypost.com/2024/05/26/sports/davis-riley-wins-at-colonial-as-pga-tour-mourns-grayson-murray/", 
            "description": "The final round was played on the day that Grayson Murray’s parents said their 30-year-old son took his own life Saturday.", 
            "title": "Davis Riley holds off Scottie Scheffler to win Charles Schwab Challenge as golf mourns Grayson Murray - New York Post "
        }, 
        {
            "url": "http://www.hollywoodreporter.com/news/music-news/taylor-swift-eras-tour-europe-lisbon-dates-1235909432/", 
            "description": "The superstar singer performed in Portugal for the first time ever over the weekend at back-to-back, sold-out shows at Estádio da Luz on the European leg of her Eras Tour.", 
            "title": "Taylor Swift Performs in Portugal for First Time, Praises Crowds for Eras Tour Love During Emotional Speech: “Took My Breath Away” - Hollywood Reporter"
        }, 
        {
            "url": "https://www.axios.com/2024/05/26/trump-libertarian-rfk-jr-ineligible-nominee", 
            "description": null, 
            "title": "Trump's longshot Libertarian nomination bid halted by party chair - Axios"
        }, 
        {
            "url": "https://variety.com/2024/music/news/beach-boys-documentary-interview-frank-marshall-1236016901/", 
            "description": "Mike Love and Al Jardine and director Frank Marshall talk about the Disney+ doc 'The Beach Boys' and subjects like their friendly Beatles rivalry.", 
            "title": "The Beach Boys and Director Frank Marshall on the Band’s Disney+ Doc: ‘We May Not Have Been Great Surfers, but We Sang About It Really Well’ - Variety"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LmF4aW9zLmNvbS8yMDI0LzA1LzI2L3JhZmFoLXRlbnQtY2FtcC1pc3JhZWwtYWlyc3RyaWtl0gEA?oc=5", 
            "description": null, 
            "title": "Israeli airstrike kills dozens in Rafah tent camp, Gaza authorities say - Axios"
        }
    ], 
    "last_updated": "2024-05-28 10:48:23"
}