{
    "news": [
        {
            "url": "https://www.espn.com/nfl/story/_/id/40101148/source-wr-tyler-boyd-agrees-one-year-contract-titans", 
            "description": "Receiver Tyler Boyd is signing with the Tennessee Titans on a one-year deal worth up to $4.5 million, a source told ESPN's Jeremy Fowler on Tuesday.", 
            "title": "Source: WR Boyd agrees to contract with Titans - ESPN"
        }, 
        {
            "url": "https://www.nbcnews.com/news/sports/referees-admit-missing-crucial-call-final-seconds-knicks-win-pacers-rcna151080", 
            "description": "Referees said they incorrectly called a late kicked ball violation Monday night against the Indiana Pacers, who by rule couldn’t challenge the play.", 
            "title": "Referees admit to missing crucial call in final seconds of Knicks win against Pacers - NBC News"
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-68966860", 
            "description": "The sergeant, who was held on 2 May, is accused of stealing from a woman, reports the BBC's partner CBS.", 
            "title": "US Army sergeant arrested in Russia accused of theft - BBC.com"
        }, 
        {
            "url": "https://www.foxbusiness.com/markets/disney-shares-sink-streaming-business-falls-shy-profitability", 
            "description": "Disney reported fiscal second-quarter results on Tuesday. Its combined streaming business of Disney+, Hulu and ESPN+ came very close to turning a profit.", 
            "title": "Disney shares sink as streaming business falls shy of profitability - Fox Business"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/07/us/boy-scouts-rebrands-scouting-america-reaj/index.html", 
            "description": "Boy Scouts of America announced Tuesday that the organization will change its name to ‘Scouting America’ next February, to reflect its commitment to enabling all the youth of America to “experience the benefits of Scouting.”", 
            "title": "Boy Scouts of America announces rebrand to ‘Scouting America’ - CNN"
        }, 
        {
            "url": "https://www.politico.eu/article/emmanuel-macron-xi-jinping-china-france-meeting-trade-ukraine/", 
            "description": "Xi Jinping handed Emmanuel Macron some wins during his state visit, but offered few meaningful concessions on trade and Ukraine", 
            "title": "Macron's cognac — the only thing that went down smoothly with Xi - POLITICO Europe"
        }, 
        {
            "url": "https://www.washingtonpost.com/technology/2024/05/07/tiktok-legal-challenge-law-ban/", 
            "description": "The filing ignites a high-stakes court battle in Washington that could prove to be an existential fight for one of the world’s most popular apps.", 
            "title": "TikTok challenges federal law that could lead to its being banned - The Washington Post"
        }, 
        {
            "url": "https://www.eonline.com/news/1401032/doja-cat-is-essentially-naked-in-2024-met-gala-after-party-look", 
            "description": "Doja Cat stunned in her all-nude 2024 Met Gala after-party look, following her wet T-shirt dress look for the Costume Institute fundraiser’s red carpet.", 
            "title": "Doja Cat Is Essentially Naked in 2024 Met Gala After-Party Look - E! NEWS"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/07/politics/joe-biden-antisemitism-speech/index.html", 
            "description": "President Joe Biden on Tuesday issued a call to fight a swiftly rising tide of antisemitism, saying such hate has no place in America as he connected the horrors of the Holocaust to Hamas’ attack on October 7.", 
            "title": "Biden says antisemitism has no place in America in somber speech connecting the Holocaust to Hamas’ attack on Israel - CNN"
        }, 
        {
            "url": "https://www.cbssports.com/college-football/news/revenue-sharing-in-college-athletics-is-coming-but-only-collective-bargaining-will-provide-a-true-solution/", 
            "description": "Setting the college sports landscape perfectly will take more than just giving the players a cut of the money", 
            "title": "Revenue sharing in college athletics is coming, but only collective bargaining will provide a true solution - CBS Sports"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/07/us-concerns-over-israels-gaza-policy-led-to-weapons-holdup-00156528", 
            "description": null, 
            "title": "US concerns over Israel's Gaza policy led to weapons holdup - POLITICO"
        }, 
        {
            "url": "https://www.wired.com/story/google-pixel-8a/", 
            "description": "The company's refined midrange Android phone packs its flagship Tensor G3 chipset. The handset was announced ahead of next week's Google I/O conference.", 
            "title": "Google Pixel 8A: News, Specs, Features, Price, Release Date - WIRED"
        }, 
        {
            "url": "https://www.eurogamer.net/hades-2-early-access-launch-on-steam-reaches-over-100k-concurrent-players-24-hours-after-launch", 
            "description": "Hades 2 released in early access last night, and it is already pulling in some impressive numbers.", 
            "title": "Hades 2 early access launch on Steam reaches over 100k concurrent players 24 hours after launch - Eurogamer.net"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=gkK9JiYASHU", 
            "description": null, 
            "title": "The Nail-Biting Third Round | 93 Seats Across 11 States & U.T |Over 61% Voting Turnout Phase 3 Polls - India Today"
        }, 
        {
            "url": "https://finance.yahoo.com/news/private-equity-firms-consider-potential-124111161.html", 
            "description": null, 
            "title": "Private equity firms consider potential Peloton buyout, CNBC reports - Yahoo Finance"
        }, 
        {
            "url": "https://abc7chicago.com/university-of-chicago-police-begin-clearing-pro-palestinian-protest-encampment-on-campus/14777881/", 
            "description": "Police removed a pro-Palestinian encampment at the University of Chicago in Hyde Park Tuesday morning.", 
            "title": "University of Chicago police clear pro-Palestinian protest encampment on campus - WLS-TV"
        }, 
        {
            "url": "https://www.nbcnews.com/pop-culture/celebrity/met-gala-2024-red-carpet-photos-rcna150956", 
            "description": "Zendaya, Ayo Edebiri, Ariana Grande and more awaken our fashion senses at the 2024 Met Gala. \"Sleeping Beauties: Reawakening Fashion\"", 
            "title": "2024 Met Gala red carpet photos: Zendaya, Tyla, Ariana Grande, Sabrina Carpenter, Doja Cat, Lizzo and more - NBC News"
        }, 
        {
            "url": "https://www.quantamagazine.org/dogged-dark-matter-hunters-find-new-hiding-places-to-check-20240507/", 
            "description": "Perhaps dark matter is made of an entirely different kind of particle than the ones physicists have been searching for. New experiments are springing up to look for these ultra-lightweight phantoms.", 
            "title": "Dogged Dark Matter Hunters Find New Hiding Places to Check - Quanta Magazine"
        }, 
        {
            "url": "https://9to5mac.com/2024/05/07/apple-reduces-ipad-10-price-to-349-discontinues-ipad-9-with-home-button/", 
            "description": "While refreshing the iPad line at the mid to high end, Apple has also rejiggered the starting lineup as well....", 
            "title": "Apple reduces iPad 10 price to $349, discontinues iPad 9 with Home button - 9to5Mac"
        }, 
        {
            "url": "https://www.apple.com/newsroom/2024/05/apple-unveils-the-redesigned-11-inch-and-all-new-13-inch-ipad-air-with-m2/", 
            "description": "Apple today announced the redesigned 11-inch and all-new 13-inch iPad Air, supercharged by the M2 chip.", 
            "title": "Apple unveils the redesigned 11-inch and all-new 13-inch iPad Air with M2 - Apple"
        }
    ], 
    "last_updated": "2024-05-08 20:05:11"
}