{
    "news": [
        {
            "url": "https://www.cnbc.com/2024/05/22/fed-minutes-may-2024-.html", 
            "description": "The Federal Reserve on Wednesday released minutes from its April 30-May 1 policy meeting.", 
            "title": "Federal Reserve minutes indicate worries over lack of progress on inflation - CNBC"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/22/uk/uk-early-elections-sunak-conservatives-intl/index.html", 
            "description": "UK Prime Minister Rishi Sunak announced a snap general election for July 4 in a statement outside Downing Street on Wednesday evening, as his Conservative party faces an uphill struggle to extend its 14 years in power.", 
            "title": "UK PM Rishi Sunak calls surprise July election as his party seeks to defy dire polls - CNN"
        }, 
        {
            "url": "https://www.cbsnews.com/news/uvalde-school-shooting-settlement-texas-city-lawsuits/", 
            "description": "Family members of Uvalde school shooting victims also said they're filing lawsuits against dozens of Texas Department of Public Safety officers and Uvalde's school district.", 
            "title": "Uvalde school shooting victims' families announce $2 million settlement with Texas city and new lawsuits - CBS News"
        }, 
        {
            "url": "http://www.nbcphiladelphia.com/news/local/chester-shooting-business/3865307/", 
            "description": "At least two workers were killed and three others were hurt in a workplace shooting at a family-owned linen business in Chester, Pennsylvania, Wednesday, Delaware County authorities said.", 
            "title": "‘Absolute tragedy': 2 dead, 3 hurt in Chester workplace shooting - NBC Philadelphia"
        }, 
        {
            "url": "https://www.cbsnews.com/news/judicial-nominations-200-senate-confirmation-biden/", 
            "description": "The milestone comes with the confirmation of two judges to the federal district court in Arizona.", 
            "title": "Senate confirms 200th Biden judge as Democrats tout \"major milestone\" - CBS News"
        }, 
        {
            "url": "https://abcnews.go.com/US/tennessee-judge-blocks-effort-sell-graceland/story?id=110448166", 
            "description": "A notary said the signature on a document was not actually hers.", 
            "title": "Tennessee judge blocks effort to sell Elvis Presley's Graceland - ABC News"
        }, 
        {
            "url": "https://apnews.com/article/norway-palestinian-state-ddfd774a23d39f77f5977b9c89c43dbc", 
            "description": "Norway, Ireland and Spain say they will recognize a Palestinian state. The historic but largely symbolic move further deepens Israel’s isolation more than seven months into its grinding war against Hamas in Gaza. Israel immediately denounced Wednesday's decis…", 
            "title": "Norway, Ireland and Spain say they will recognize a Palestinian state, deepening Israel's isolation - The Associated Press"
        }, 
        {
            "url": "https://www.desmoinesregister.com/story/weather/2024/05/21/iowa-national-weather-service-severe-weather-outlook-des-moines-readar/73783200007/", 
            "description": null, 
            "title": "Several tornadoes touch down; deaths, injuries confirmed in Greenfield - Des Moines Register"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c3gglgwe49zo", 
            "description": "Prosecutors allege a “scramble\" to ensure boxes containing sensitive material were moved “off-camera\" at Mar-a-Lago.", 
            "title": "Classified files found in Trump bedroom at Mar-a-Lago - BBC.com"
        }, 
        {
            "url": "https://www.ft.com/content/e3b5c1a0-48ac-4922-970a-8b9ca7c2539e", 
            "description": "Analysts see Target and Walmart setting a new tone for sector after years of increases", 
            "title": "Biggest US retailers cut prices as inflation hits shoppers - Financial Times"
        }, 
        {
            "url": "https://apnews.com/article/wegovy-ozempic-teens-young-adults-24047516e0c3b4f678c3e91f4ed6face", 
            "description": "Use of diabetes and obesity medications such as Ozempic, Wegovy and other so-called GLP-1 drugs has soared among teens and young adults. New research shows that the number of 12- to 25-year-olds who used the medications climbed from about 8,700 a month in 202…", 
            "title": "Use of Wegovy and other weight-loss drugs soars among kids and young adults - The Associated Press"
        }, 
        {
            "url": "https://techcrunch.com/2024/05/22/boeing-nasa-indefinitely-delay-crewed-starliner-launch/", 
            "description": "If you've been looking forward to seeing Boeing’s Starliner capsule carry two astronauts to the International Space Station for the first time, you'll", 
            "title": "Boeing, NASA indefinitely delay crewed Starliner launch - TechCrunch"
        }, 
        {
            "url": "https://www.npr.org/2024/05/22/1252872978/russia-assets-aid-ukraine-eu-war-sanctions", 
            "description": "Under the plan, the European Union will send as much as $3.25 billion in profits from frozen Russian assets to Ukraine to help finance its military and reconstruction efforts.", 
            "title": "Billions from Russia's frozen assets will go to help Ukraine's military, the EU says - NPR"
        }, 
        {
            "url": "https://www.axios.com/2024/05/22/altman-openai-chatgpt-scarlet-johansson", 
            "description": null, 
            "title": "Scarlett Johansson scandal is putting OpenAI's Sam Altman in the hot seat - Axios"
        }, 
        {
            "url": "https://9to5mac.com/2024/05/22/t-mobile-price-raise/", 
            "description": "You might need to prepare yourself for a T-Mobile price increase, if you’re on one of the company’s older plans....", 
            "title": "T-Mobile price increase of $2 or $5 per line for some older plans - 9to5Mac"
        }, 
        {
            "url": "https://gizmodo.com/humane-ai-pin-selling-billion-1851493143", 
            "description": "The company is reportedly in the early stages of looking at a sale a few weeks after critics widely panned the $700 AI-centric wearable.", 
            "title": "One Month After Launch, AI Pin Maker Humane Seeks a Billion Dollar Sale - Gizmodo"
        }, 
        {
            "url": "https://www.eonline.com/news/1402143/ben-affleck-goes-out-to-dinner-solo-amid-jennifer-lopez-split-rumors", 
            "description": "Ben Affleck attended dinner in Los Angeles without Jennifer Lopez amid breakup rumors surrounding the couple, who tied the knot in 2022.", 
            "title": "Ben Affleck Goes Out to Dinner Solo Amid Jennifer Lopez Split Rumors - E! NEWS"
        }, 
        {
            "url": "https://www.cbssports.com/nba/news/lebron-james-calls-out-pacers-for-not-fouling-up-by-3-points-in-game-1-loss-vs-celtics/", 
            "description": "LeBron said teams should foul 'every single time' after Jaylen Brown's game-tying triple", 
            "title": "LeBron James calls out Pacers for not fouling up by 3 points in Game 1 loss vs. Celtics - CBS Sports"
        }, 
        {
            "url": "https://ktla.com/news/local-news/spacex-rocket-loaded-with-spy-satellites-seen-over-downtown-l-a/", 
            "description": "A SpaceX rocket carrying a set of spy satellites for the U.S. government was seen flying over downtown Los Angeles overnight. The Falcon 9 rocket lifted off from Vandenberg Space Force Base in Santa Barbara County around 1 a.m. The launch was part of a Nation…", 
            "title": "SpaceX rocket loaded with spy satellites seen over downtown L.A. - KTLA Los Angeles"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-features/glen-powell-interview-hit-man-movie-texas-move-1235905159/", 
            "description": "The red hot star of ‘Top Gun’ and ‘Anyone But You’ — mentored by Tom Cruise and on every studio wish list — is returning to his native Texas to party with his folks, escape the L.A. fishbowl and finally graduate college. But don’t worry, you’ll still be seein…", 
            "title": "Glen Powell Finally Conquered Hollywood. So Why Is He Leaving? - Hollywood Reporter"
        }
    ], 
    "last_updated": "2024-05-23 21:30:24"
}