{
    "news": [
        {
            "url": "https://www.reuters.com/world/middle-east/israel-pushes-back-into-northern-gaza-ups-military-pressure-rafah-2024-05-12/", 
            "description": null, 
            "title": "Israel pushes back into northern Gaza, ups military pressure on Rafah - Reuters"
        }, 
        {
            "url": "https://www.espn.com/nhl/story/_/id/40131959/with-brad-marchand-game-4-bruins-seek-avenge-him", 
            "description": "Bruins captain Brad Marchand is out for Game 4 of their series against the Panthers on Sunday night, and his teammates are looking to avenge him.", 
            "title": "With Brad Marchand out for Game 4, Bruins seek to avenge him - ESPN"
        }, 
        {
            "url": "https://www.usatoday.com/story/entertainment/movies/2024/05/12/roger-corman-director-producer-dies-tributes/73662623007/", 
            "description": "Roger Corman, the prolific director of B-movies who gave many prominent filmmakers their start, has died. He was 98.", 
            "title": "Roger Corman dead: 'Little Shop of Horrors' filmmaker dies at 98 - USA TODAY"
        }, 
        {
            "url": "https://www.usatoday.com/story/money/2024/05/10/berlin-tesla-factory-germany-protest-video/73649849007/", 
            "description": "Around 800 protesters clashed with police in Germany while trying to break into a Tesla factory. Elon Musk blamed 'left-wing' groups.", 
            "title": "Watch as German police, protesters at Tesla factory clash in Berlin - USA TODAY"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/12/blinken-reiterates-findings-israel-00157491", 
            "description": null, 
            "title": "Blinken reiterates human rights findings on Israel - POLITICO"
        }, 
        {
            "url": "https://thehill.com/homenews/nexstar_media_wire/4653747-will-your-last-covid-vaccine-work-against-new-flirt-variants/", 
            "description": "There are two new COVID-19 variants circulating, posing a threat to a summer surge. Is your last vaccine dose still protecting you?", 
            "title": "Does COVID vaccine protect against symptoms of new 'FLiRT' variants? - The Hill"
        }, 
        {
            "url": "https://nypost.com/2024/05/12/entertainment/maya-rudolph-transforms-into-beyonce-for-hot-ones-on-snl/", 
            "description": "Maya Rudolph revisited her beloved Beyoncé “Hot Ones” sketch on “SNL.”", 
            "title": "'SNL' host Maya Rudolph channels Beyoncé for spicy sketch and Mother's Day monologue - New York Post "
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-12/dividend-payouts-are-latest-sign-of-big-tech-s-financial-muscle", 
            "description": "After years of chasing growth at all costs, tech firms are taking a page from the playbook of old-school value businesses — paying a dividend. Throwing off more cash than they can spend, the shift to a regular payout provides more evidence for the companies’ …", 
            "title": "Dividend Payouts Are Latest Sign of Big Tech's Financial Muscle - Bloomberg"
        }, 
        {
            "url": "https://www.aljazeera.com/program/newsfeed/2024/5/12/berkeley-chancellor-speaks-out-about-gaza-brutality-at-graduation", 
            "description": "Chancellor of UC Berkeley addressed the ‘brutality of the violence in Gaza’ in her graduation ceremony speech.", 
            "title": "UC Berkeley chancellor speaks out about ‘Gaza brutality’ - Al Jazeera English"
        }, 
        {
            "url": "https://theathletic.com/5487263/2024/05/12/celtics-jaylen-brown-cavaliers-game-3-win/", 
            "description": "\"We didn't come to Cleveland for the weather, so let's go,\" says Jaylen Brown.", 
            "title": "Jaylen Brown's pep talk fuels Celtics in Game 3: 'We're not here to play around' - The Athletic"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/12/europe/russia-kharkiv-region-offensive-ukraine-intl/index.html", 
            "description": "Russia’s Ministry of Defense claims to have captured five villages in the Kharkiv Region on the border with Ukraine, while Ukrainian authorities have disputed this and say the “fighting continues.”", 
            "title": "Ukraine warns northern front has ‘significantly worsened’ as Russia claims capture of several villages - CNN"
        }, 
        {
            "url": "https://thehill.com/homenews/campaign/4658913-trump-heightens-attacks-against-ny-prosecutor-biden-at-jersey-shore-rally/", 
            "description": "Former President Trump ramped up his attacks on Manhattan District Attorney Alvin Bragg (D) and President Biden at his latest rally at the Jersey Shore on Saturday.   Trump repeatedly railed against the hush money case being brought against him in New York an…", 
            "title": "Trump heightens attacks against NY prosecutor, Biden at Jersey Shore rally - The Hill"
        }, 
        {
            "url": "https://www.bbc.com/news/uk-politics-68999212", 
            "description": "Foreign Secretary David Cameron tells the BBC the UK should focus on getting humanitarian aid into Gaza.", 
            "title": "UK ban on selling arms to Israel would strengthen Hamas, says Cameron - BBC.com"
        }, 
        {
            "url": "https://wccftech.com/ipados-holding-oled-ipad-pro-back/", 
            "description": "New OLED iPad Pro models are great, but iPadOS is holding back its potential to become a full-fledged computer and Apple needs to take note.", 
            "title": "How iPadOS Is Dragging The OLED iPad Pro Down To The Level Of The Budget iPads - Wccftech"
        }, 
        {
            "url": "https://www.usatoday.com/story/tech/2024/05/10/crush-apple-ipad-ad-apology/73646375007/", 
            "description": "Apple's recent video ad posted on YouTube and social media promoting its new iPad Pro struck some in the creative community as insensitive.", 
            "title": "Apple apologizes for 'Crush' iPad Pro ad after creators react - USA TODAY"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "http://9to5google.com/2024/05/12/google-wallet-android-wear-os/", 
            "description": "Starting next month, Google is increasing the minimum OS version for Wallet on Android phones and Wear OS with security cited as the reason.", 
            "title": "Google Wallet dropping support for old Android, Wear OS versions - 9to5Google"
        }, 
        {
            "url": "https://apnews.com/article/trump-hush-money-trial-michael-cohen-witness-091b0e50af2738eb261f395e9d658505", 
            "description": "Michael Cohen is the most central witness for prosecutors in former President Donald Trump's hush money trial. But Trump’s fixer-turned-foe is also as challenging a star witness as they come. He's expected to take the stand on Monday and offer jurors an insid…", 
            "title": "Michael Cohen: A challenging star witness in Donald Trump's hush money trial - The Associated Press"
        }, 
        {
            "url": "https://fortune.com/2024/05/12/viking-cruises-torstein-hagen-luxury-baby-boomers/", 
            "description": "Torstein Hagen, who founded Viking 27 years ago, said he owes the company’s success in part to its “cookie cutter” philosophy.", 
            "title": "Viking founder Torstein Hagen on the luxury cruise line specifically for baby boomers - Fortune"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }
    ], 
    "last_updated": "2024-05-13 19:16:10"
}