{
    "news": [
        {
            "url": "https://www.bbc.com/news/world-middle-east-68980826", 
            "description": "Israeli leader says his country will \"stand alone\" and \"fight with fingernails\" if shipments are halted.", 
            "title": "Gaza war: Netanyahu says Israel can 'stand alone' if US halts arms shipments - BBC.com"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/10/uk-gdp-q1-2024-economy-emerges-from-a-technical-recession.html", 
            "description": "The U.K. economy has emerged from recession as gross domestic product rose 0.6% in the first quarter, beating expectations.", 
            "title": "UK economy emerges from recession with 0.6% growth in first quarter - CNBC"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c51n0p14y1lo", 
            "description": "Pasco has recalled 104,000 packs of sliced bread after rat remains were found in its products.", 
            "title": "Pasco: Rat remains found in Japanese bread triggers recall and refunds - BBC.com"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNubi5jb20vMjAyNC8wNS8wOS91cy9zaGVuYW5kb2FoLWNvdW50eS1jb25mZWRlcmF0ZS1zY2hvb2wtbmFtZXMtcmVhai9pbmRleC5odG1s0gFVaHR0cHM6Ly9hbXAuY25uLmNvbS9jbm4vMjAyNC8wNS8wOS91cy9zaGVuYW5kb2FoLWNvdW50eS1jb25mZWRlcmF0ZS1zY2hvb2wtbmFtZXMtcmVhag?oc=5", 
            "description": null, 
            "title": "Virginia school board votes to restore Confederate names to two schools - CNN"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://sports.yahoo.com/nba-playoffs-luka-doncic-mavericks-fend-off-thunder-in-game-2-to-tie-series-041203241.html", 
            "description": "P.J. Washington dropped a playoff career-high 29 points to help the Mavericks pull off a huge win in Game 2 on Thursday night.", 
            "title": "NBA playoffs: Luka Dončić, Mavericks fend off Thunder in Game 2 to tie series - Yahoo Sports"
        }, 
        {
            "url": "https://www.axios.com/2024/05/10/severe-solar-storm-northern-lights", 
            "description": null, 
            "title": "\"Severe\" solar storm could bring Northern Lights to U.S. this weekend - Axios"
        }, 
        {
            "url": "https://9to5mac.com/2024/05/09/controversial-ipad-pro-crush-ad-lg/", 
            "description": "During its “Let Loose” event on Tuesday, Apple introduced the new M4 iPad Pro. However, the product was unveiled with...", 
            "title": "Controversial new iPad Pro ad might have been inspired by LG ad - 9to5Mac"
        }, 
        {
            "url": "https://bleacherreport.com/articles/10120489-jayson-tatum-celtics-slammed-by-nba-fans-for-game-2-loss-to-donovan-mitchell-cavs", 
            "description": "The Cleveland Cavaliers outscored the Boston Celtics by 12 points in both the third and fourth quarters en route to a dominant 118-94 win in Game 2 of their…", 
            "title": "Jayson Tatum, Celtics Slammed By NBA Fans for Game 2 Loss to Donovan Mitchell, Cavs - Bleacher Report"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/09/us/roger-forston-florida-airman-shot/index.html", 
            "description": "A Florida sheriff’s office publicly released bodycam footage from a deputy who fatally shot a Black airman in his home last week, and disputed claims from the victim’s family that the deputy had gone to the wrong apartment.", 
            "title": "Florida sheriff releases bodycam video of airman fatally shot in apartment, disputes family’s claim deputy went to wrong unit - CNN"
        }, 
        {
            "url": "http://9to5google.com/2024/05/09/open-ai-google-search-report/", 
            "description": "According to a new report, OpenAI plans to launch its Google Search competitor on May 13, the day before Google I/O.", 
            "title": "Report: OpenAI to launch its AI-powered search engine a day before Google I/O - 9to5Google"
        }, 
        {
            "url": "https://www.investing.com/news/stock-market-news/us-stock-futures-edge-higher-as-treasury-yields-dip;-inflation-awaited--3433508", 
            "description": "US stock futures edge higher as Treasury yields dip; inflation awaited", 
            "title": "US stock futures edge higher as Treasury yields dip; inflation awaited - Investing.com"
        }, 
        {
            "url": "https://www.washingtonpost.com/sports/2024/05/09/bookies-casinos-sibella-bowyer-boyajian/", 
            "description": "The case involving Shohei Ohtani’s interpreter is shedding light on a sprawling money-laundering probe — and rattling the Strip in the process.", 
            "title": "Sports-betting probes reveal Vegas casinos’ ties to illegal bookies - The Washington Post"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/09/health/bird-flu-cows-human-receptors/index.html", 
            "description": "Cows have the same kinds of gateways into their cells as humans and birds, a new study shows. The finding suggests that cows could be mixing bowls - hosts that could help H5N1 bird flu learn to spread in humans.", 
            "title": "Cows have human flu receptors, study shows, raising stakes on bird flu outbreak in dairy cattle - CNN"
        }, 
        {
            "url": "https://www.washingtonpost.com/sports/2024/05/09/patrick-beverley-suspended/", 
            "description": "Patrick Beverley threw a ball at fans, rebuffed reporter during and after the Milwaukee Bucks’ season-ending loss", 
            "title": "Patrick Beverley suspended four games for viral incidents - The Washington Post"
        }, 
        {
            "url": "https://www.cnn.com/politics/live-news/trump-hush-money-trial-05-09-24/index.html", 
            "description": "The testimony of adult film actress Stormy Daniels, a central figure in the criminal case against Donald Trump, wrapped on Thursday after the former president's lawyers continued their attack on her credibility.", 
            "title": "Day 14 of Trump New York hush money trial - CNN"
        }, 
        {
            "url": "https://www.sfchronicle.com/health/article/flirt-variants-summer-covid-wave-19445209.php", 
            "description": "The FLiRT coronavirus variants, KP.1.1 and KP.2, have recently overtaken JN.1 as the dominant omicron offshoot in the U.S. Here’s what you need to know.", 
            "title": "New FLiRT variants could spark summer COVID wave in California - San Francisco Chronicle"
        }, 
        {
            "url": "https://abc7.com/post/kyle-lombardo-charged-in-death-of-mother-burbank-teacher-at-bret-harte-school/14790410/", 
            "description": "A 25-year-old Burbank man who is charged in his mother's death has struggled with mental health challenges and did not intend to kill her, his father told Eyewitness News in an emotional interview.", 
            "title": "In emotional interview, father of Burbank murder suspect says he didn't intend to kill own mother, struggles with mental health - KABC-TV"
        }, 
        {
            "url": "https://apnews.com/article/trump-daniels-trial-rick-scott-3ae0d6eddb94d2ca1155b0266dc9d35c", 
            "description": "Former President Donald Trump is limited in what he can publicly say as his hush money trial is underway in New York. But he’s getting help from some GOP allies who are joining him in court. U.S. Sen. Rick Scott of Florida was the latest surrogate to accompan…", 
            "title": "Trump is limited in what he can say about his court case. His GOP allies are showing up to help - The Associated Press"
        }, 
        {
            "url": "https://apnews.com/article/brazil-floods-rio-grande-do-sul-horse-rescue-d50d1c2436245c24a0094d4106b60e85", 
            "description": "About 24 hours after it was first spotted and with people clamoring for the rescue of a horse social media users nicknamed Caramelo, a team in Brazil’s Rio Grande do Sul state have successfully removed Caramelo, providing a dose of hope to a beleaguered regio…", 
            "title": "'Caramelo,' the Brazilian horse stranded on a roof by floods, is rescued after stirring the nation - The Associated Press"
        }
    ], 
    "last_updated": "2024-05-11 11:08:52"
}