{
    "news": [
        {
            "url": "https://www.washingtonpost.com/wellness/2024/05/27/mental-health-treatment-disparity/", 
            "description": "Of the respondents: 51 percent reported experiencing depression, anxiety or another mental health condition in the previous 12 months.", 
            "title": "Americans see disparities in mental and physical care, survey finds - The Washington Post"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/27/world/papua-new-guinea-landslide-thousands-feared-buried-intl-hnk/index.html", 
            "description": "As many as 2,000 people are feared to have been buried by last week’s massive landslide in Papua New Guinea, according to the country’s National Disaster Centre, as survivors recounted the horror losing so many loved ones.", 
            "title": "As many as 2,000 people feared buried under Papua New Guinea landslide as survivors dig with hands and spades - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/26/entertainment/johnny-wactor-shot/index.html", 
            "description": "Former “General Hospital” actor Johnny Wactor was fatally shot in downtown Los Angeles while interrupting thieves Saturday, according to his agent and CNN affiliate KABC.", 
            "title": "Former ‘General Hospital’ actor Johnny Wactor fatally shot in Los Angeles - CNN"
        }, 
        {
            "url": "https://www.foxbusiness.com/lifestyle/12-qatar-airways-passengers-injured-boeing-jet-hits-turbulence-en-route-dublin", 
            "description": "A Qatar Airways Boeing 787-9 Dreamliner hit turbulence while traveling over Turkey, leaving six passengers and six crew members injured, the airline says.", 
            "title": "12 Qatar Airways passengers injured as Boeing jet hits turbulence en route to Dublin - Fox Business"
        }, 
        {
            "url": "https://www.hindustantimes.com/world-news/us-news/whats-open-on-memorial-day-2024-hours-for-starbucks-mcdonalds-ikea-walmart-and-more-101716802721994.html", 
            "description": "Keep reading to know what stores and restaurants are open on Memorial Day 2024", 
            "title": "What's open on Memorial Day 2024? Hours for Starbucks, McDonald's, IKEA, Walmart and more - Hindustan Times"
        }, 
        {
            "url": "https://finance.yahoo.com/news/asian-stocks-climb-risk-sentiment-225710109.html", 
            "description": "(Bloomberg) -- European shares struggled for traction in thin trading after a European Central Bank official warned that policy will have to stay restrictive...", 
            "title": "European Stocks Waver as Traders Assess Rate Path: Markets Wrap - Yahoo Finance"
        }, 
        {
            "url": "https://apnews.com/article/north-korea-spy-satellite-japan-3065fd4f1ade7dd0e0a5924cc9a906e2", 
            "description": "North Korea has announced plans to launch a rocket apparently carrying its second military spy satellite in the coming days. The notification of the banned launch drew quick, strong rebukes from its neighbors. South Korean President Yoon Suk Yeol and Japanese…", 
            "title": "North Korea plans to launch a rocket soon, likely carrying its second military spy satellite - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/27/tech/china-semiconductor-investment-fund-intl-hnk/index.html", 
            "description": "China is setting up its largest-ever state investment fund for the semiconductor industry amid rising tensions with the US over the technology.", 
            "title": "China is pumping another $47.5 billion into its chip industry - CNN"
        }, 
        {
            "url": "https://www.cbsnews.com/news/bear-attacks-teen-cabin-arizona-cabin-animal-killed-officers/", 
            "description": "Wildlife officials said the bear entered the home a second time before it fled.", 
            "title": "Bear shot dead after attacking 15-year-old in Arizona cabin: \"Not many kids can say they got in a fight with a bear\" - CBS News"
        }, 
        {
            "url": "https://www.techradar.com/phones/iphone/apples-ios-18-ai-plans-set-out-in-new-report-here-are-9-new-features-to-expect", 
            "description": "AI everywhere all at once", 
            "title": "Apple's iOS 18 AI plans set out in new report – here are 9 new features to expect - TechRadar"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/27/sport/dallas-mavericks-minnesota-timberwolves-wcf-game-3-spt-intl/index.html", 
            "description": "The Dallas Mavericks defeated the Minnesota Timberwolves in Game 3, 116-107, to move to 3-0 in the series and knock on the door of a first NBA Finals in 13 years.", 
            "title": "Dallas Mavericks one win away from NBA Finals as they go up 3-0 on the Minnesota Timberwolves - CNN"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/27/biden-plan-protect-science-trump-00160001", 
            "description": null, 
            "title": "Biden's got a plan to protect science from Trump - POLITICO"
        }, 
        {
            "url": "https://www.businessinsider.com/elon-musk-xai-raised-6-billion-funding-vc-saudi-arabia-2024-5", 
            "description": "Musk said in an X post that the AI startup's pre-money valuation was $18 billion.", 
            "title": "Elon Musk's XAI Says It Just Raised $6 Billion in Funding - Business Insider"
        }, 
        {
            "url": "https://www.tmz.com/2024/05/27/diddy-sean-john-pull-america-best-contacts-eyeglasses-frames/", 
            "description": "Diddy's wallet's about to take a hit ... 'cause his famed Sean John frames are out at a huge eyewear retailer while his legal troubles mount.", 
            "title": "Diddy's Sean John Frames Pulled From America's Best Contacts and Eyeglasses - TMZ"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/27/china-calls-on-japan-and-south-korea-to-reject-protectionism-.html", 
            "description": "This is the first meeting between the three leaders in more than four years.", 
            "title": "China calls on Japan and South Korea to reject 'protectionism' in trilateral summit - CNBC"
        }, 
        {
            "url": "https://www.axios.com/2024/05/26/trump-libertarian-rfk-jr-ineligible-nominee", 
            "description": null, 
            "title": "Trump's longshot Libertarian nomination bid halted by party chair - Axios"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c988jdxl02vo", 
            "description": "The government has confirmed no one will be forced to do military training under the £2.5bn scheme.", 
            "title": "National service explained: Rishi Sunak unveils Conservative election plan - BBC.com"
        }, 
        {
            "url": "https://www.autosport.com/indycar/news/indy-500-newgarden/10616310/", 
            "description": "Team Penske’s Josef Newgarden fought off Pato O’Ward in a last-lap showdown to take back-to-back Indianapolis 500 victories.", 
            "title": "Indy 500: Newgarden beats O'Ward for back-to-back wins - Autosport"
        }, 
        {
            "url": "https://chicago.suntimes.com/horoscopes/2024/05/27/horoscopes-today-monday-may-27-2024", 
            "description": null, 
            "title": "Horoscope for Monday, May 27, 2024 - Chicago Sun-Times"
        }, 
        {
            "url": "https://theconversation.com/eat-a-rock-a-day-put-glue-on-your-pizza-how-googles-ai-is-losing-touch-with-reality-230953", 
            "description": "Using AI to write search results is risky for Google, the internet, and the whole idea of ‘truth’", 
            "title": "Eat a rock a day, put glue on your pizza: how Google's AI is losing touch with reality - The Conversation Indonesia"
        }
    ], 
    "last_updated": "2024-05-28 14:48:40"
}