{
    "news": [
        {
            "url": "https://www.cnbc.com/2024/05/29/after-revenue-miss-salesforce-ceo-details-enterprise-software-landscape.html", 
            "description": "Salesforce CEO Marc Benioff told CNBC's Jim Cramer how the market for enterprise software companies has changed since the pandemic.", 
            "title": "After revenue miss, Salesforce CEO details the 'measured' buying environment for enterprise software companies - CNBC"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c1994g22ve9o", 
            "description": "An Egyptian source denies that cross-border smuggling tunnels used by Hamas still exist in the area.", 
            "title": "Israel in control of Philadelphi Corridor, says military - BBC.com"
        }, 
        {
            "url": "https://nypost.com/2024/05/29/lifestyle/introducing-peanuts-early-reduces-kids-allergy-risk-study/", 
            "description": "“This safe, simple strategy could prevent tens of thousands of cases of peanut allergy among the 3.6 million children born in the United States each year,” the director of the National …", 
            "title": "Introducing peanuts early reduces kids' allergy risk: study - New York Post "
        }, 
        {
            "url": "https://www.theverge.com/2024/5/29/24167407/google-search-algorithm-documents-leak-confirmation", 
            "description": "Until yesterday, Google had refused to comment on the authenticity of the trove of documents, some of which may indicate what the company uses to rank sites in search.", 
            "title": "Google confirms the leaked Search documents are real - The Verge"
        }, 
        {
            "url": "https://9to5mac.com/2024/05/29/apple-music-playlist-wwdc-2024/", 
            "description": "We’re less than two weeks away from WWDC 2024, another edition of Apple’s annual conference for developers. And although the...", 
            "title": "Apple Music launches special playlist to promote WWDC 2024, hints at new icon - 9to5Mac"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/29/sport/josh-gibson-mlb-records-negro-league/index.html", 
            "description": "Major League Baseball (MLB) has incorporated the statistics of former Negro Leagues players into its historical records on its website, meaning legendary leaders in some categories like Babe Ruth and Ty Cobb have now been replaced in the record books by playe…", 
            "title": "MLB integrates Negro League statistics into all-time record book with Josh Gibson now career batting average leader - CNN"
        }, 
        {
            "url": "https://thehill.com/policy/international/4692532-north-korea-sends-fleet-of-balloons-carrying-excrement-to-south-korea/", 
            "description": "North Korea sent a fleet of balloons carrying excrement and trash into South Korea, according to multiple reports. “As already warned by the [North Korean] vice minister of National Defence, a large amount of waste paper and rubbish are being scattered in the…", 
            "title": "North Korea sends fleet of balloons carrying excrement to South Korea - The Hill"
        }, 
        {
            "url": "https://www.gamespot.com/articles/playstation-days-of-play-2024-ps5-deals/1100-6523751/", 
            "description": "The event runs through June 12, giving you a chance to save on games, accessories, consoles, and more.", 
            "title": "Tons Of PS5-Exclusive Games Are On Sale For Low Prices For PlayStation's Days Of Play - GameSpot"
        }, 
        {
            "url": "https://apnews.com/article/bronny-james-draft-c625e5c48bef7308d0e502d680329fe6", 
            "description": "Bronny James is keeping his name in the NBA draft, with the hopes of joining his father in the league next season. Rich Paul, the CEO of Klutch Sports Group, confirmed the decision to The Associated Press. It was first reported by ESPN. LeBron James, Bronny’s…", 
            "title": "Bronny James is staying in the NBA draft, agent Rich Paul announces - The Associated Press"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=DuUH2sdTL_4", 
            "description": "A joint European-Japanese satellite has launched to measure how clouds influence the climate. Some low-level clouds are known to cool the planet, others at h...", 
            "title": "European-Japanese satellite blasts off to space | BBC News - BBC News"
        }, 
        {
            "url": "https://www.buzzfeed.com/larryfitzmaurice/selena-gomez-fans-hurtful-benny-blanco-relationship", 
            "description": "\"He's not going anywhere any time soon.\"", 
            "title": "Selena Gomez Says That Fans Are \"Hurtful\" About \"How I Live My Life\" With Boyfriend Benny Blanco - BuzzFeed"
        }, 
        {
            "url": "https://neurosciencenews.com/gene-mapping-evolution-26192/", 
            "description": "Researchers created the first complete chromosome sequences from non-human primates, revealing significant variations in Y chromosomes among species.", 
            "title": "New Primate Chromosome Maps Shed Light on Human Evolution - Neuroscience News"
        }, 
        {
            "url": "https://www.bbc.com/news/videos/c4nn30vx7yno", 
            "description": "A popular tourist resort was evacuated after a 2.5km-long fissure opened up, which may be “growing”.", 
            "title": "'Curtain of fire': Iceland volcano forces evacuation - BBC.com"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/29/biden-aides-signal-openness-to-allowing-ukraine-to-strike-russia-with-us-weapons-00160462", 
            "description": null, 
            "title": "Top Biden aides signal openness to letting Ukraine strike Russia with US weapons - POLITICO"
        }, 
        {
            "url": "https://www.nbcnews.com/news/sports/kentucky-prosecutors-drop-charges-golfer-scottie-scheffler-rcna154471", 
            "description": "All charges against top golfer Scottie Scheffler were dropped Wednesday after a Kentucky prosecutor said the high-profile arrest amounted to a \"big misunderstanding.\"", 
            "title": "Kentucky prosecutors drop all charges against golfer Scottie Scheffler - NBC News"
        }, 
        {
            "url": "https://www.cbsnews.com/news/delhi-temperature-may-break-record-highest-ever-india-126-degrees/", 
            "description": "A substation in Delhi gave a preliminary reading of 126.1 degrees Fahrenheit this week amid a heat wave.", 
            "title": "Delhi temperature may break record for highest ever in India: 126.1 degrees - CBS News"
        }, 
        {
            "url": "https://apnews.com/article/biden-black-voters-election-2024-pennsylvania-0c4a7343c017f57a38c847bfc9b1316f", 
            "description": "President Joe Biden is renewing his election-year pitch to Black voters. At an appearance in Philadelphia with Vice President Kamala Harris on Wednesday, he lashed out at what he called Donald Trump’s “MAGA lies” and said the winner of this year’s White House…", 
            "title": "Biden and Harris will launch a Black voter outreach effort as they see signs of diminished support - The Associated Press"
        }, 
        {
            "url": "https://www.cbsnews.com/news/supreme-court-justice-alito-wont-recuse-over-flags/", 
            "description": "Justice Samuel Alito has come under pressure from congressional Democrats to recuse himself from cases involving the Jan. 6, 2021, Capitol attack and former President Donald Trump.", 
            "title": "Alito tells congressional Democrats he won't recuse over flags - CBS News"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/29/doj-charges-chinese-national-in-5point9-billion-covid-botnet-fraud.html", 
            "description": "The FBI previously shut down the China-backed \"Volt Typhoon\" hacking group, which had been targeting U.S. water plants, electric grids and more.", 
            "title": "DOJ charges Chinese national with operating 'world's largest botnet' that stole $5.9 billion in Covid relief funds - CNBC"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }
    ], 
    "last_updated": "2024-05-31 01:44:05"
}