{
    "news": [
        {
            "url": "https://www.usatoday.com/story/sports/wnba/2024/05/14/indiana-connecticut-caitlin-clark-wnba-first-game-score-highlights/73684549007/", 
            "description": "Caitlin Clark makes her official pro debut tonight as the Indiana Fever face the Sun in Connecticut in one of four WNBA season openers.", 
            "title": "Caitlin Clark makes WNBA regular-season debut: Indiana Fever vs Connecticut Sun live updates - USA TODAY"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/14/politics/takeaways-day-17-trump-hush-money-trial-michael-cohen/index.html", 
            "description": "Donald Trump’s attorney Todd Blanche began his confrontation with Michael Cohen on Tuesday by throwing the former fixer’s language back in his face.", 
            "title": "Takeaways from the first day of Michael Cohen’s cross-examination in the Trump hush money trial - CNN"
        }, 
        {
            "url": "https://finance.yahoo.com/news/walmart-lays-off-hundreds-employees-012657914.html", 
            "description": "Walmart on Tuesday announced layoffs affecting several hundred jobs at the retail giant’s campus offices.  It also said it will require most remote workers...", 
            "title": "Walmart lays off hundreds of employees and requires others to relocate - Yahoo Finance"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/14/politics/biden-administration-new-israel-arms-deal/index.html", 
            "description": "The Biden administration on Tuesday began the early stages of a process to move ahead with a new $1 billion arms deal for Israel, according to two congressional sources.", 
            "title": "Biden administration begins lengthy process to approve new $1 billion arms deal for Israel - CNN"
        }, 
        {
            "url": "https://apnews.com/article/sun-solar-flare-earth-ed204eef352560f09b8366bee05e2381", 
            "description": "The sun isn't done yet. That's the message from the National Oceanic and Atmospheric Administration, as the biggest flare in nearly two decades erupted on the sun Tuesday. A NASA spacecraft photographed the bright flash of the X-ray flare, which was classifie…", 
            "title": "Sun shoots out biggest solar flare in nearly a decade - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/14/business/boeing-justice-department-criminal-prosecution/index.html", 
            "description": "The Justice Department on Tuesday notified Boeing Co. that it breached terms of its 2021 deferred prosecution agreement, under which the company avoided criminal prosecution for safety lapses in exchange for paying $2.5 billion in penalties and promised to im…", 
            "title": "Boeing may be prosecuted after breaking safety agreement that prevented criminal charges for 737 crashes, US DOJ says - CNN"
        }, 
        {
            "url": "https://www.espn.com/nhl/story/_/id/40148473/bronny-james-focused-simply-getting-league", 
            "description": "Speaking to reporters at the NBA combine on Tuesday, Bronny James, addressing the idea of playing with his father, LeBron James, said, \"That's not my mindset or not at all. I'm just trying to put in the work and see where it takes me from there.\"", 
            "title": "Bronny James focused on simply 'getting to the league' - ESPN"
        }, 
        {
            "url": "https://sports.yahoo.com/live/2024-nfl-schedule-release-live-updates-ahead-of-wednesdays-full-announcement-222736159.html", 
            "description": "Before Wednesday arrives, football fans got some appetizers as some games were formally announced.", 
            "title": "2024 NFL schedule release: Live updates ahead of Wednesday's full announcement - Yahoo Sports"
        }, 
        {
            "url": "https://apnews.com/article/maryland-west-virginia-senate-primary-republican-democrat-632750f07b79a9bd4922635fd07ca644", 
            "description": "Republican voters have advanced strong Senate contenders in Maryland and West Virginia, giving the GOP a big boost in its push to claim control of Congress’ upper chamber. Former Republican Gov. Larry Hogan claimed the Republican nomination in what will be a …", 
            "title": "Primaries in Maryland and West Virginia will shape the battle this fall for a Senate majority - The Associated Press"
        }, 
        {
            "url": "https://abcnews.go.com/International/protesters-israel-arrested-after-attacking-gaza-aid-trucks/story?id=110220557", 
            "description": "Footage shows protesters apparently destroying boxes of aid bound for Gaza.", 
            "title": "Protesters in Israel arrested after attacking Gaza aid trucks - ABC News"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/tv/tv-news/disney-upfront-bob-iger-emma-stone-jimmy-kimmel-1235899498/", 
            "description": "Ryan Reynolds cracks jokes about cocaine and Jimmy Kimmel makes Sheryl Lee Ralph blush in the increasingly spicy House of Mouse.", 
            "title": "Inside the Racy Disney Upfront: Bob Iger and Amorous Golden Retrievers Take Center Stage - Hollywood Reporter"
        }, 
        {
            "url": "https://apnews.com/article/rudy-giuliani-bankruptcy-judge-7ee7fa1fa5885e8114060a87b481f7b8", 
            "description": "A New York bankruptcy judge has denied Rudy Giuliani a chance to pursue an appeal of a $148 million defamation judgment for spreading lies about the the 2020 election. The judge says Tuesday that he was “disturbed” by the lack of progress in the case. Giulian…", 
            "title": "Giuliani bankruptcy judge frustrated with case, rebuffs attempt to challenge $148 million judgment - The Associated Press"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/14/cramer-warns-against-meme-stock-mania-says-to-sell-gamestop-and-amc.html", 
            "description": "AMC and GameStop soared after \"Roaring Kitty,\" the man who helped bring on 2021's enormous short squeeze, posted online for the first time in about three years.", 
            "title": "Cramer warns against 'meme stock mania,' says to sell GameStop and AMC - CNBC"
        }, 
        {
            "url": "https://www.washingtonpost.com/dc-md-va/2024/05/14/baltimore-key-bridge-collapse-ntsb-report/", 
            "description": "The preliminary report offers the first explanation of the problems that led to the Dali container ship’s destruction of the Francis Scott Key Bridge in March.", 
            "title": "Federal investigators release report into Baltimore bridge collapse - The Washington Post"
        }, 
        {
            "url": "https://apnews.com/article/biden-china-tariffs-electric-vehicles-evs-solar-2024ba735c47e04a50898a88425c5e2c", 
            "description": "President Joe Biden says in defending his new tariffs on Chinese products that China's government subsidies ensure its companies don’t have to turn a profit, giving them an unfair advantage in global trade. The Democratic president on Tuesday slapped tariffs …", 
            "title": "Biden raises tariffs on Chinese EVs, chips and other goods - The Associated Press"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://abcnews.go.com/US/boat-custody-miami-teen-killed/story?id=110222544", 
            "description": "Ella Adler, 15, was killed while wakeboarding in the Miami area, FWC said.", 
            "title": "Boat found in connection with hit-and-run that killed Florida teen: Authorities - ABC News"
        }, 
        {
            "url": "https://www.cnn.com/travel/inappropriate-behavior-shuts-down-dublin-new-york-portal/index.html", 
            "description": "A livestream sculpture installation connecting Dublin, Ireland, and New York City has been temporarily shut down because of “inappropriate behavior.”", 
            "title": "‘Inappropriate’ behavior shuts down Dublin to New York City portal - CNN"
        }, 
        {
            "url": "https://gizmodo.com/raw-milk-sales-up-bird-flu-h5n1-tiktok-usda-cdc-fda-1851476916", 
            "description": "Pasteurization kills H5N1, but raw milk has \"high concentrations\" of the virus. Please don't drink raw milk.", 
            "title": "Raw Milk Sales Skyrocket as Idiots Believe Drinking Bird Flu Will Give Them 'Immunity' - Gizmodo"
        }, 
        {
            "url": "https://www.wesh.com/article/ocala-bus-crash/60788231", 
            "description": "According to Marion County Public Schools, their school buses were used to transport victims to the hospital.", 
            "title": "Florida bus crash: 8 people dead, 45 hospitalized in Ocala - WESH 2 Orlando"
        }
    ], 
    "last_updated": "2024-05-16 04:39:01"
}