{
    "news": [
        {
            "url": "https://www.nbcnews.com/news/crime-courts/michelle-troconis-sentenced-jennifer-dulos-murder-rcna154868", 
            "description": "Michelle Troconis, the Connecticut woman convicted of helping her boyfriend murder his estranged wife in 2019, was sentenced to 14 1/2 years in prison Friday following an emotional, hours-long hearing.", 
            "title": "Michelle Troconis sentenced to more than 14 years for helping boyfriend murder his wife - NBC News"
        }, 
        {
            "url": "https://bleacherreport.com/articles/10123206-mike-tyson-vs-jake-paul-boxing-fight-postponed-after-icons-medical-emergency", 
            "description": "The Jake Paul vs. Mike Tyson boxing match has been postponed after Tyson's recent medical emergency. Most Valuable Promotions, which is Paul's boxing…", 
            "title": "Mike Tyson vs. Jake Paul Boxing Fight Postponed After Icon's Medical Emergency - Bleacher Report"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=99R0wnF0RK8", 
            "description": null, 
            "title": "UFC 302: Ceremonial Weigh-In - UFC"
        }, 
        {
            "url": "https://www.reuters.com/world/biden-speak-middle-east-friday-white-house-says-2024-05-31/", 
            "description": null, 
            "title": "Biden presents new Israel ceasefire plan, calls on Hamas to accept - Reuters"
        }, 
        {
            "url": "https://apnews.com/article/airman-shot-florida-deputy-roger-fortson-c616444086b39d20a80f35ba86ec531b", 
            "description": "A Florida sheriff on Friday fired a deputy who fatally shot a Black airman at his home while holding a handgun pointed to the ground, saying the deputy’s life was never in danger and he should not have fired his weapon. The Okaloosa County Sheriff on Friday f…", 
            "title": "Florida deputy who fatally shot Airman Roger Fortson fired - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/31/us/chad-daybell-sentencing-death-penalty-decision/index.html", 
            "description": "A day after delivering a guilty verdict in Chad Daybell’s murder trial, an Idaho jury on Friday began deliberating whether he will face the death penalty for killing his first wife and two of his second wife’s children.", 
            "title": "Idaho jury begins deliberations in sentencing of Chad Daybell, who faces possible death penalty for 3 murders - CNN"
        }, 
        {
            "url": "https://families.google.com/service-restricted", 
            "description": null, 
            "title": "Chobani Yogurt Founder Buys Anchor Brewing Company - The New York Times"
        }, 
        {
            "url": "https://thehill.com/policy/healthcare/4697185-women-mediterranean-diet-live-longer/", 
            "description": "Women who are on a Mediterranean diet live significantly longer, according to a new study. The Mediterranean diet often consists of higher consumption of food and ingredients like olive oil, fruits, fish, nuts and vegetables and lower consumption of red meat …", 
            "title": "Women on Mediterranean diet live significantly longer: Study - The Hill"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL3BpY2t0b24tZGVhZC1jYW5hZGEtc2VyaWFsLWtpbGxlci1waWctZmFybS1mMmYyYzM1NDVhYzBiZWEyM2EzOGNjNjkwY2YxYzc5NtIBAA?oc=5", 
            "description": null, 
            "title": "Canadian serial killer Robert Pickton, who brought victims to pig farm, is dead after prison assault - The Associated Press"
        }, 
        {
            "url": "https://www.espn.com/soccer/story/_/id/40251698/borussia-dortmund-real-madrid-champions-league-favourites", 
            "description": "Borussia Dortmund have not travelled so far in this season's Champions League to be mere witnesses to Real Madrid lifting the trophy for a record-extending 15th time, coach Edin Terzic vowed.", 
            "title": "Borussia Dortmund 'don't care' Real Madrid are UCL favourites - ESPN"
        }, 
        {
            "url": "https://apnews.com/article/trump-2024-campaign-trial-4629840240cb308c5eae335532ad17ed", 
            "description": "Donald Trump sought to move past his historic criminal conviction on Friday and build momentum for his bid to return to the White House with fierce attacks on the judge who oversaw the case, the prosecution’s star witness and the criminal justice system as a …", 
            "title": "Trump responds to guilty verdict by falsely blasting 'rigged trial' - The Associated Press"
        }, 
        {
            "url": "https://apnews.com/article/israel-netanyahu-war-gaza-congress-596b0adf6ed8f71ccaaecccec8b9d341", 
            "description": "Congressional leaders have invited Israeli Prime Minister Benjamin Netanyahu to deliver an address a the U.S. Capitol. The visit would provide a show of wartime support for the longtime ally despite mounting political divisions over Israel’s military assault …", 
            "title": "US leaders invite Israel's Netanyahu to deliver an address to Congress - The Associated Press"
        }, 
        {
            "url": "https://www.cbsnews.com/news/boeings-starliner-ready-launch-space-station-first-flight-crew-on-board/", 
            "description": "If the first piloted test flight goes well, NASA hopes to certify the Starliner for regularly scheduled service starting next year.", 
            "title": "Boeing's Starliner ready for Saturday launch to space station, first flight with crew on board - CBS News"
        }, 
        {
            "url": "https://variety.com/2024/music/news/jennifer-lopez-cancels-tour-1236021391/", 
            "description": "Jennifer Lopez has canceled her troubled summer tour to spend more time with her family and is 'heartsick' over the decision, she said Friday.", 
            "title": "Jennifer Lopez Cancels Summer Tour - Variety"
        }, 
        {
            "url": "https://www.cbsnews.com/news/bird-flu-vaccine-doses-this-summer-cases/", 
            "description": "The U.S. has ordered 4.8 million doses of vaccine to target bird flu in case the outbreak spreads in people.", 
            "title": "U.S. to make millions of bird flu vaccine doses this summer, as cases grow - CBS News"
        }, 
        {
            "url": "https://wgntv.com/news/friday-night-solar-storm-northern-lights-chicago-wisconsin-michigan-iowa/", 
            "description": "The chance to view the northern lights returns for several U.S. states this weekend as a solar storm blasts magnetic material toward Earth.", 
            "title": "Chance to see northern lights returns - WGN TV Chicago"
        }, 
        {
            "url": "http://www.thecut.com/article/shiloh-jolie-pitt-wants-a-name-change.html", 
            "description": "Angelina Jolie and Brad Pitt’s daughter reportedly asked to legally drop her father’s last name on her 18th birthday, amid her parents’ contentious divorce.", 
            "title": "Shiloh Jolie-Pitt Wants a Name Change - The Cut"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/31/first-quarter-retail-earnings-dont-spell-consumer-comeback.html", 
            "description": "Gap profits were 9 times higher and Foot Locker beat estimates — unlikely winners in Q1 retail earnings. But, this says more about the companies than consumers.", 
            "title": "It was a strong week for retail earnings. That doesn’t spell a consumer comeback - CNBC"
        }, 
        {
            "url": "https://www.cbsnews.com/news/yemen-houthi-threat-red-sea-us-uk-strike-5000-pound-bunker-buster-bomb/", 
            "description": "The Iran-backed Houthis threaten to escalate attacks on Red Sea shipping after strikes by the U.S. and U.K. that the rebels say killed 16 people.", 
            "title": "Yemen's Houthis threaten escalation after American strike using 5,000-pound bunker-buster bomb - CBS News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/31/science/planet-parade-six-planetary-alignment-scn/index.html", 
            "description": "A “planet parade” of six planets will soon appear to align in the sky near dawn, but only three will be visible to the naked eye. Here’s how to view the event.", 
            "title": "‘Planetary parade’ will see six planets line up in the morning sky - CNN"
        }
    ], 
    "last_updated": "2024-06-02 02:47:27"
}