{
    "news": [
        {
            "url": "https://finance.yahoo.com/news/gamestop-amc-shares-rise-two-100723939.html", 
            "description": "(Bloomberg) -- GameStop Corp. shares tumbled toward a third day of declines after the company said it may sell up to 45 million shares, further paring the...", 
            "title": "GameStop Extends Rout on Plan to Sell Up to 45 Million Shares - Yahoo Finance"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/17/health/flirt-covid-variants-summer-wave-risk/index.html", 
            "description": "Covid-19 levels are about the lowest they’ve ever been in the United States, but another new crop of virus variants once again threatens to disrupt the downward trend as the country heads into summer.", 
            "title": "New virus variants threaten a summer Covid-19 wave, but experts say the risk remains uncertain - CNN"
        }, 
        {
            "url": "https://www.reuters.com/world/us/supreme-court-justice-alitos-home-flew-us-flag-upside-down-following-jan-6-nyt-2024-05-17/", 
            "description": null, 
            "title": "Supreme Court Justice Alito's home flew US flag upside down following Jan. 6-NYT - Reuters"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c8vzd111r3lo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D", 
            "description": "Critics call the album \"explicit, sapphic and her best work yet\", plus \"confident and non-conformist\".", 
            "title": "Rave reviews for 'bold, brilliant' Billie Eilish - Yahoo Entertainment"
        }, 
        {
            "url": "https://variety.com/2024/film/news/francis-ford-coppola-slams-studio-system-megalopolis-self-financed-1236007285/", 
            "description": "Francis Ford Coppola shared his thoughts on the current studio system during the press conference for his self-financed epic 'Megalopolis.'", 
            "title": "Francis Ford Coppola Slams Studio System After He Self-Financed ‘Megalopolis’: Execs ‘Don’t Make Good Movies … They Pay Their Debt Obligations’ - Variety"
        }, 
        {
            "url": "https://www.espn.com/golf/story/_/id/40162983/scottie-scheffler-detained-police-prior-start-pga-championship", 
            "description": "World No. 1 golfer Scottie Scheffler was arrested by Louisville Metro Police on Friday morning after trying to drive into the entrance of Valhalla Golf Club, the site of this week's PGA Championship.", 
            "title": "Scottie Scheffler arrested before start of PGA Championship - ESPN"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/16/stock-market-today-live-updates.html", 
            "description": "The Dow briefly crossed 40,000 for the first time on Thursday.", 
            "title": "Dow futures are little changed after blue-chip average touches 40,000 for first time: Live updates - CNBC"
        }, 
        {
            "url": "https://www.reuters.com/world/middle-east/israel-tells-world-court-south-africa-case-makes-mockery-genocide-2024-05-17/", 
            "description": null, 
            "title": "Israel tells World Court South Africa case makes a mockery of genocide - Reuters"
        }, 
        {
            "url": "https://www.foxbusiness.com/lifestyle/walmart-gains-high-income-shoppers-elevated-prices-persist", 
            "description": "Walmart noted yet again that its continuing to gain even more higher-income shoppers. Executives say the driver isn't necessarily price but convenience.", 
            "title": "Walmart gains high-income shoppers as elevated prices persist - Fox Business"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/17/biden-trump-debate-2024-demands-00158586", 
            "description": null, 
            "title": "Biden's team had a few demands for a Trump debate. A major one: No crowd. - POLITICO"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cp3g8kl8dd5o", 
            "description": "The man was armed with a knife and a metallic tool and was shot by an officer after he threatened the police.", 
            "title": "Rouen: Man shot dead after French synagogue set on fire - BBC.com"
        }, 
        {
            "url": "https://www.detroitnews.com/story/news/local/detroit-city/2024/05/16/day-of-celebration-detroit-sees-first-population-growth-since-1957/73685335007/", 
            "description": "Detroit gained 1,852 people from July 1, 2022 to July 1, 2023, according to the Census Bureau, the city's first population growth since 1957.", 
            "title": "'Day of celebration': Detroit sees first population growth since 1957 - Detroit News"
        }, 
        {
            "url": "https://apnews.com/article/houston-texas-severe-weather-storms-d14447267de0a8900e1475a8ad7ed8ba", 
            "description": "Severe thunderstorms have hit southeastern Texas for the second time this month, and Houston's mayor says at least four people are dead. There have also been windows blown out of high-rise buildings, downed trees and power outages for more than 900,000 custom…", 
            "title": "Severe storms kill at least 4 in Houston, knock out power to 900000 homes and businesses - The Associated Press"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c2jd3k1zyjro", 
            "description": "Russia has launched a push north of Kharkiv but its ultimate goal is so far unclear.", 
            "title": "War in Ukraine: Key weeks ahead for Russia’s offensive in Ukraine - BBC.com"
        }, 
        {
            "url": "https://www.cbssports.com/nfl/news/2024-nfl-schedule-release-ranking-10-must-see-games-including-jets-49ers-opener-harbaugh-bowl/", 
            "description": "These dates are already etched into our calendar", 
            "title": "2024 NFL schedule release: Ranking 10 must-see games, including Jets-49ers opener, Harbaugh Bowl - CBS Sports"
        }, 
        {
            "url": "https://www.startribune.com/timberwolves-nuggets-game-6-blowout-anthony-edwards-karl-anthony-towns-target-center/600366609/", 
            "description": "The Timberwolves trailed the Nuggets behind 9-2 in the first few minutes, but buried that slow start with a 20-point run that set the stage for one of the most successful games in the team’s history.", 
            "title": "Timberwolves beat Nuggets by 45 points, set up Game 7 on Sunday - Star Tribune"
        }, 
        {
            "url": "https://www.hindustantimes.com/entertainment/music/jennifer-lopez-and-ben-affleck-wont-split-insider-speaks-out-amid-growing-divorce-tension-101715920652528.html", 
            "description": "Jennifer Lopez and Ben Affleck's rekindled romance facing challenges as they seem to be on 'different pages' amid divorce rumours and tension.", 
            "title": "Jennifer Lopez and Ben Affleck 'won't split', insider speaks out amid growing divorce tension - Hindustan Times"
        }, 
        {
            "url": "https://nypost.com/2024/05/17/us-news/house-hearing-on-garland-devolves-into-chaos-involving-mtg-aoc-amp-crockett/", 
            "description": "“I think you know what you’re here for,” Rep. Marjorie Taylor Greene told Democratic Rep. Jasmine Crockett. “I think your fake eyelashes are messing up what you’re reading.”", 
            "title": "House hearing on Garland devolves into chaos involving AOC, MTG & Crockett: 'Are your feelings hurt? Aww' - New York Post "
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-69021543", 
            "description": "Harrison Butker also attacked \"degenerate cultural values\" and \"the tyranny of diversity, equity and inclusion\".", 
            "title": "Harrison Butker 'homemaker' speech sparks backlash - BBC.com"
        }, 
        {
            "url": "http://deadline.com/2024/05/young-sheldon-series-finale-producer-interview-1235919308/", 
            "description": "The May 16 episode of Young Sheldon marked the end of The Big Bang Theory spinoff, with young Sheldon Cooper (Iain Armitage) heading off to California", 
            "title": "‘Young Sheldon’ Series Finale: EP Steve Holland Talks Return Of Mayim Bialik & Jim Parsons, Why The World Needs A Sheldon Cooper Memoir - Deadline"
        }
    ], 
    "last_updated": "2024-05-18 16:28:30"
}