{
    "news": [
        {
            "url": "http://deadline.com/2024/05/jeremy-renner-wake-up-dead-man-a-knives-out-mystery-1235943996/", 
            "description": "Jeremy Renner is set to join to join Daniel Craig in Netflix’s Wake Up Dead Man: A Knives Out Mystery'", 
            "title": "Jeremy Renner Joins Daniel Craig In ‘Wake Up Dead Man: A Knives Out Mystery’ - Deadline"
        }, 
        {
            "url": "https://www.foxbusiness.com/lifestyle/us-tells-owners-stop-driving-older-nissan-vehicles-over-air-bag-concerns", 
            "description": "Nissan and the NHTSA are warning drivers of older Nissan vehicles that still have recalled Takata air bags not to drive until the air bags are repaired and replaced due to safety risks.", 
            "title": "US tells owners to stop driving older Nissan vehicles over air bag concerns - Fox Business"
        }, 
        {
            "url": "https://apnews.com/article/nra-aclu-parkland-shooting-lawsuit-supreme-court-953424f3fd33f279b0cc2ce050069d48", 
            "description": "The Supreme Court has cleared the way for a National Rifle Association lawsuit against an ex-New York state official over claims she pressured companies to blacklist it following the 2018 Parkland, Florida, school shooting. Justice Sonia Sotomayor wrote Thurs…", 
            "title": "Supreme Court clears the way for the NRA's free speech lawsuit against an ex-New York official - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/30/africa/early-results-released-in-south-africas-election-intl/index.html", 
            "description": "The early results declared in South Africa’s election suggest the ruling African National Congress (ANC) party could lose its majority for the first time in 30 years.", 
            "title": "First results in South Africa’s election suggest it is heading for biggest political shift since apartheid - CNN"
        }, 
        {
            "url": "https://www.detroitnews.com/story/news/local/detroit-city/2024/05/30/police-clear-wayne-state-pro-palestinian-encampment/73903734007/", 
            "description": null, 
            "title": "Police clear Wayne State pro-Palestinian encampment - Detroit News"
        }, 
        {
            "url": "https://www.espn.com/nfl/story/_/id/40244650/sources-dolphins-wr-jaylen-waddle-agree-8475m-extension", 
            "description": "The Dolphins and wide receiver Jaylen Waddle have reached an agreement on a three-year, $84.75 million contract extension that includes $76 million guaranteed, sources told ESPN.", 
            "title": "Sources - Dolphins, WR Jaylen Waddle agree to $84.75M extension - ESPN"
        }, 
        {
            "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-salesforce-stock-crm/", 
            "description": "Key earnings movers include Best Buy, Salesforce, Pure Storage and Okta.", 
            "title": "Stock Market Today: Dow Jones Slides 375 Points On Jobless Claims, GDP; Salesforce Plunges 20% - Investor's Business Daily"
        }, 
        {
            "url": "https://finance.yahoo.com/news/gdp-us-economy-grew-at-a-slower-pace-than-initially-thought-in-q1-131220924.html", 
            "description": "The reading came in significantly lower than fourth quarter GDP, which was revised up to 3.4%", 
            "title": "GDP: US economy grew at a slower pace than initially thought in Q1 - Yahoo Finance"
        }, 
        {
            "url": "https://www.nbcnews.com/news/us-news/general-hospital-actor-johnny-wactor-shielded-co-worker-harm-was-fatal-rcna154646", 
            "description": "A friend and co-worker of actor Johnny Wactor, who was fatally shot over the weekend while interrupting a catalytic converter theft in downtown Los Angeles, spent his last moments shielding her from harm before he died in her arms.", 
            "title": "'General Hospital' actor Johnny Wactor died in arms of co-worker he shielded from harm moments before he was fatally shot - NBC News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/30/style/stegosaurus-fossil-auction-scli-intl-scn/index.html", 
            "description": "A Stegosaurus skeleton described as the “most complete and best preserved” of its kind ever discovered is expected to fetch up to $6 million at auction this summer – but not everyone is happy about it﻿.", 
            "title": "‘Virtually complete’ Stegosaurus fossil goes on sale - but not everyone is happy - CNN"
        }, 
        {
            "url": "https://www.cbsnews.com/news/volcano-eruption-iceland-shoots-lava-sends-gas-pollution-to-the-capital/", 
            "description": "\"Considerable lava fountaining\" is spewing from a two-mile-long fissure as southwest Iceland battles its fifth volcanic eruption since December.", 
            "title": "Watch Live: \"Explosive\" Iceland volcano eruption shoots lava across roads and sends pollution toward the capital - CBS News"
        }, 
        {
            "url": "https://variety.com/2024/film/festivals/venice-2024-lineup-joker-2-angelina-jolie-maria-queer-daniel-craig-johnny-depp-1236019529/", 
            "description": "Venice Film Festival is eyeing 'Joker 2,' Angelina Jolie's 'Maria,' Johnny Depp's 'Modi' and more for its 2024 lineup.", 
            "title": "Venice 2024: ‘Joker 2,’ Angelina Jolie’s ‘Maria,’ ‘Queer’ Starring Daniel Craig and Johnny Depp-Directed ‘Modì’ Eyed for Lineup (EXCLUSIVE) - Variety"
        }, 
        {
            "url": "https://www.espn.com/nba/insider/story/_/id/40242486/2024-nba-draft-withdrawal-deadline-faq-questions-uconn-bronny-james-nil-alabama", 
            "description": "Deadline day delivered news on star players returning to their college programs, while others are staying in the draft. We answer your biggest questions.", 
            "title": "NBA draft withdrawal deadline FAQ: Bama, UConn, Bronny James, more - ESPN"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/30/24167787/esa-hera-mission-didymos-asteroid-nasa-dart-testing", 
            "description": "The European Space Agency is running some final tests ahead of launching its Hera mission this October, which aims to investigate the results of NASA’s DART mission.", 
            "title": "The ESA is visiting the asteroid punched by NASA’s DART mission - The Verge"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c844g9eyzz7o", 
            "description": "Several Western allies have signalled they are open to Ukraine using their weapons against Russia.", 
            "title": "Pressure on Biden to let Ukraine strike Russia with US weapons - BBC.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/30/health/menstruation-early-wellness/index.html", 
            "description": "Starting menstruation is an important sign of health. A new study shows that the trend of children starting at an earlier age may point to worrying conditions.", 
            "title": "Kids are starting menstruation earlier, study shows. Here is what that means for their health - CNN"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=XJVDg07A74E", 
            "description": "#UFC stars predict the #UFC302 main event between lightweight champion Islam Makhachev and Dustin Poirier.Join this channel to get access to perks:https://ww...", 
            "title": "UFC 302: Pros Predict Islam Makhachev vs. Dustin Poirier | MMA Fighting - MMAFightingonSBN"
        }, 
        {
            "url": "http://www.rollingstone.com/music/music-features/kaytranada-new-album-timeless-interview-1235019415/", 
            "description": "Kaytranada's forward-thinking production has subtly shifted the sound of pop culture, even if he’s too humble to admit it", 
            "title": "Kaytranada on New Album, Touring With the Weeknd, Producing Mach-Hommy - Rolling Stone"
        }, 
        {
            "url": "https://www.newsweek.com/solar-flare-radio-blackout-x-class-aurora-sunspot-1906248", 
            "description": "The solar flare was released from the same sunspot that triggered auroras seen around the world on May 10.", 
            "title": "US Radio Blackouts As Historic Sunspot Fires Off 'Remarkable' X-Flare - Newsweek"
        }, 
        {
            "url": "https://www.usatoday.com/story/news/nation/2024/05/30/man-driving-suspended-license-zoom-court-video/73903770007/", 
            "description": "A viral video shows a Michigan man, Corey Harris, with a suspended license attending a Zoom court hearing about his case when he was seen driving.", 
            "title": "Video shows Michigan man driving while attending Zoom court hearing over suspended license - USA TODAY"
        }
    ], 
    "last_updated": "2024-05-31 18:20:39"
}