{
    "news": [
        {
            "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmJhcnJvbnMuY29tL2xpdmVjb3ZlcmFnZS9zdG9jay1tYXJrZXQtdG9kYXktMDUyNDI00gEA?oc=5", 
            "description": null, 
            "title": "Dow Rises Today Ahead of Memorial Day Weekend; Nasdaq and Chip Stocks Jump; and Other Stock Market News - Barron's"
        }, 
        {
            "url": "https://www.cbssports.com/nfl/news/travis-kelce-joins-andy-reid-patrick-mahomes-in-defending-harrison-butker-calls-chiefs-kicker-great-person/", 
            "description": "The NFL commissioner spoke about the matter Wednesday", 
            "title": "Travis Kelce joins Andy Reid, Patrick Mahomes in defending Harrison Butker, calls Chiefs kicker 'great person' - CBS Sports"
        }, 
        {
            "url": "https://www.nbcnews.com/news/us-news/us-tourist-facing-jail-turks-caicos-possessing-ammunition-released-rcna153874", 
            "description": "An American man who was facing up to 12 years in jail on this Caribbean island for bringing 20 rounds of ammunition on a vacation has been freed after a court ruling Friday.", 
            "title": "U.S. tourist facing jail in Turks and Caicos for possessing ammunition is released - NBC News"
        }, 
        {
            "url": "https://www.cbsnews.com/minnesota/news/brain-worms-bear-meat-south-dakota-family-gathering-minnesota-arizona/", 
            "description": "At least six family members who shared a meal of bear meat that one of the family members had harvested earlier were subsequently infected with brain worms, the CDC reports.", 
            "title": "Family members infected with brain worms after eating undercooked bear meat - CBS News"
        }, 
        {
            "url": "https://www.floridatoday.com/story/tech/science/space/spacex/2024/05/23/spacex-starlink-falcon-9-rocket-booster-night-launch-space-coast-cape-canaveral-florida/73769537007/", 
            "description": "On Wednesday night, SpaceX launched the first of a Starlink double-header.", 
            "title": "SpaceX Falcon 9 rocket lights up night sky over Space Coast, Florida - Florida Today"
        }, 
        {
            "url": "https://apnews.com/article/israel-gaza-palestinians-court-ceasefire-01d093d21a1eadaa31af5708cf1cbf38", 
            "description": "The top United Nations court has ordered Israel to immediately halt its military offensive in the southern Gaza city of Rafah — but stopped short of ordering a full cease-fire. While Israel is unlikely to comply with Friday's order, it will ratchet up the pre…", 
            "title": "ICJ orders Israel to halt Gaza offensive; Israel unlikely to comply - The Associated Press"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDUvMjQvZ29vZ2xlLWNyaXRpY2l6ZWQtYXMtYWktb3ZlcnZpZXctbWFrZXMtZXJyb3JzLWxpa2Utc2F5aW5nLXByZXNpZGVudC1vYmFtYS1pcy1tdXNsaW0uaHRtbNIBfGh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDI0LzA1LzI0L2dvb2dsZS1jcml0aWNpemVkLWFzLWFpLW92ZXJ2aWV3LW1ha2VzLWVycm9ycy1saWtlLXNheWluZy1wcmVzaWRlbnQtb2JhbWEtaXMtbXVzbGltLmh0bWw?oc=5", 
            "description": null, 
            "title": "Google criticized as AI Overview makes obvious errors, saying President Obama is Muslim and that it's safe to leave dogs in hot cars - CNBC"
        }, 
        {
            "url": "https://www.nbcnews.com/news/us-news/storms-will-rumble-memorial-day-weekend-nearly-44-million-travel-holid-rcna153890", 
            "description": "Nearly 44 million people are traveling this Memorial Day weekend, but severe spring weather will put a damper on some of the festivities with showers and thunderstorms forecast across the country along with scorching heat in South Texas and Florida.", 
            "title": "Storms will rumble into Memorial Day weekend as nearly 44 million travel for the holiday - NBC News"
        }, 
        {
            "url": "https://sports.yahoo.com/ncaa-settlement-qa-how-will-schools-distribute-revenue-what-is-the-future-of-nil-collectives-and-more-125519681.html", 
            "description": "The landmark $2.8B deal topples the NCAA’s long-standing rules around amateurism and could help protect the organization from future legal challenges. But...", 
            "title": "NCAA settlement Q&A: How will schools distribute revenue, what is the future of NIL collectives and more - Yahoo Sports"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/24/health/new-experiments-milk-h5n1-infected-cows-raise-questions-flash-pasteurization/index.html", 
            "description": "New experiments confirm milk from H5N1-infected cows can make other animals sick — and raise questions about flash pasteurization", 
            "title": "New tests confirm milk from flu-infected cows can make other animals sick — and raise questions about flash pasteurization - CNN"
        }, 
        {
            "url": "https://variety.com/2024/film/obituaries-people-news/morgan-spurlock-dead-super-size-me-1236015338/", 
            "description": "Morgan Spurlock, a documentary filmmaker whose McDonald's takedown \"Super Size Me\" captured the zeitgeist and an Oscar nomination, has died of cancer.", 
            "title": "Morgan Spurlock, ‘Super Size Me’ Director, Dies at 53 - Variety"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/23/3-billion-secret-program-undermining-bidens-tech-policy-00158757", 
            "description": null, 
            "title": "'I don't know how this happened': A $3B secret program undermining Biden's tech policy - POLITICO"
        }, 
        {
            "url": "http://9to5google.com/2024/05/24/samsung-galaxy-watch-7-ultra-leak-renders/", 
            "description": "Samsung is gearing up to launch three different versions of its upcoming Galaxy Watch 7, and that apparently includes a...", 
            "title": "Galaxy Watch 7 Ultra leaks with round display, squarish body, and maybe a rotating crown? [Gallery] - 9to5Google"
        }, 
        {
            "url": "https://www.cbsnews.com/news/italian-millennial-catholic-sainthood-internet-pope-francis-vatican-miracle/", 
            "description": "Carlo Acutis died of leukemia in 2006 at age 15. The Catholic Church has attributed two miracles to him, which means he can be elevated to sainthood.", 
            "title": "Italian teenager Carlo Acutis to become first millennial Catholic saint after second miracle attributed to him - CBS News"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3Lm5mbC5jb20vbmV3cy9jYW4tY2FsZWItd2lsbGlhbXMtbGVkLWJlYXJzLWxpdmUtdXAtdG8taHlwZS13aWxsLXNlYWhhd2tzLXNvYXItYWdhaW4tYmVoaW5kLWhvdC1kZWZlbnNpdmUtc2NoZW1l0gEA?oc=5", 
            "description": null, 
            "title": "Can Caleb Williams-led Bears live up to hype? Will Seahawks soar again behind hot defensive scheme? - NFL.com"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/24/eli-lilly-invests-to-increase-mounjaro-zepbound-supply.html", 
            "description": "Demand for the drugs Mounjaro and Zepbound has far outpaced supply over the last year, forcing Eli Lilly to invest heavily to scale up its manufacturing.", 
            "title": "Eli Lilly to invest another $5.3 billion in Indiana plant to expand Mounjaro, Zepbound supply - CNBC"
        }, 
        {
            "url": "https://apnews.com/article/diddy-sean-combs-sexual-assault-lawsuit-3a64e5b28d87fb76051865b9e47eba67", 
            "description": "A woman who says Sean “Diddy” Combs subjected her to violence and abuse over several years in the 1990s has filed a lawsuit in New York accusing the rapper of sexual assault, battery and gender-motivated violence. The woman describes in the lawsuit several “t…", 
            "title": "New lawsuit accuses Sean 'Diddy' Combs of sexually abusing college student in the 1990s - The Associated Press"
        }, 
        {
            "url": "https://apnews.com/article/papua-new-guinea-landslide-86fcf41e600122fd54ddcfb56bcab403", 
            "description": "More than 100 people are believed to have been killed in a landslide that buried a village in a remote, mountainous part of Papua New Guinea. An emergency response is underway. The landslide hit at about 3 a.m. Friday in an area about 370 miles northwest of t…", 
            "title": "More than 100 people believed killed by a landslide in Papua New Guinea, Australian media report - The Associated Press"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.al.com/life/2024/05/wheel-of-fortune-contestants-answer-shocks-host-pat-sajak-stuns-others.html", 
            "description": "The long-time host didn't really know what to say.", 
            "title": "‘Wheel of Fortune’ contestant’s answer shocks host Pat Sajak, stuns others - AL.com"
        }
    ], 
    "last_updated": "2024-05-25 19:00:12"
}