{
    "news": [
        {
            "url": "https://www.cbsnews.com/news/florida-bus-crash-marion-county-people-killed/", 
            "description": "The crash involved a bus transporting about 53 farm workers and a 2001 Ford Ranger truck, officials said.", 
            "title": "At least 8 people killed in Florida bus crash; dozens injured - CBS News"
        }, 
        {
            "url": "https://www.tmz.com/2024/05/14/9-year-old-boy-dodges-bullets-drive-by-shooting-fort-worth/", 
            "description": "The shocking moment a 9-year-old boy in Fort Worth, Texas, dodges bullets from the comfort his own home can be seen in distressing new footage.", 
            "title": "9-Year-Old Boy Dodges Bullets During Fort Worth Drive-By Shooting - TMZ"
        }, 
        {
            "url": "https://www.reuters.com/markets/us/futures-lackluster-with-inflation-data-fed-chair-powell-speech-tap-2024-05-14/", 
            "description": null, 
            "title": "Wall St edges up after 'mixed' producer inflation data, all eyes on CPI - Reuters"
        }, 
        {
            "url": "https://gizmodo.com/house-of-dragon-season-2-trailer-matt-smith-game-throne-1851475755", 
            "description": "Matt Smith, Olivia Cooke, and Emma D’Arcy return for HBO's Game of Thrones prequel show.", 
            "title": "In House of the Dragon Season 2's New Trailer, Westeros Rides to War - Gizmodo"
        }, 
        {
            "url": "https://www.bbc.com/news/world-middle-east-69006734", 
            "description": "A member of the UN's safety team was killed in Rafah on their way to a hospital, the agency says.", 
            "title": "Israel-Gaza war: UN says Indian staff member killed in Gaza - BBC.com"
        }, 
        {
            "url": "https://apnews.com/article/cannes-film-festival-greta-gerwig-meryl-streep-650243306d8e6fb23b76e55f8e452c6c", 
            "description": "Cannes opens with the unveiling of Greta Gerwig’s jury and the presentation of an honorary Palme d’Or for Meryl Streep.", 
            "title": "Cannes kicks off with Greta Gerwig's jury and a Palme d'Or for Meryl Streep - The Associated Press"
        }, 
        {
            "url": "https://www.wlky.com/article/pga-championship-play-suspended-bad-weather/60788678", 
            "description": "The bad weather has moved into the Louisville area and play has been halted at Valhalla Golf Club.", 
            "title": "PGA Championship: Play suspended, fans evacuated briefly due to weather - WLKY Louisville"
        }, 
        {
            "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-gamestop-gme-amc-stock/", 
            "description": null, 
            "title": "Stocks Edge Higher As Powell Responds To Inflation Data; GameStop Surges Again In Revived Meme Frenzy - Investor's Business Daily"
        }, 
        {
            "url": "https://www.tomsguide.com/news/live/google-io-2024-keynote", 
            "description": "Get all the latest news from Google I/O", 
            "title": "Google I/O 2024 live blog — all the Gemini AI and Android 15 news as it happens - Tom's Guide"
        }, 
        {
            "url": "https://apnews.com/article/bird-flu-raw-milk-h5n1-6398d2eda26eb41797ee2700cf9d036b", 
            "description": "Sales of raw milk appear to be on the rise, despite an outbreak of bird flu in U.S. dairy cows. Federal officials warn about the health risks of drinking raw milk at any time, but especially during this novel outbreak. Retail sales of raw cow's milk have jump…", 
            "title": "There's bird flu in US dairy cows. Raw milk drinkers aren't deterred - The Associated Press"
        }, 
        {
            "url": "https://www.usatoday.com/story/news/health/2024/05/12/pig-kidney-transplant-patient-dies/73663322007/", 
            "description": "Seven weeks after receiving the first-ever kidney transplant from a pig, a Massachusetts man died this weekend.", 
            "title": "Richard Slayman dies 7 weeks after historic pig-kidney transplant - USA TODAY"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-cohen-hush-money-stormy-daniels-735aadfd1ce015e05ba955c203a96f1b", 
            "description": "Donald Trump’s fixer-turned-foe Michael Cohen returned to the witness stand Tuesday, testifying in detail how former president was linked to all aspects of a hush money scheme that prosecutors say was aimed at stifling stories that threatened his 2016 campaig…", 
            "title": "Trump hush money trial: Michael Cohen returns to face cross-examination - The Associated Press"
        }, 
        {
            "url": "https://abc7.com/post/covid-in-los-angeles-what-to-know-about-new-flirt-variants-and-possible-summer-surge/14811098/", 
            "description": "The days of school closures and statewide lockdowns may be years behind us, but the threat of COVID-19 still lurks in the shadows.", 
            "title": "COVID in Los Angeles: What to know about new FLiRT variants and possible summer surge - KABC-TV"
        }, 
        {
            "url": "https://www.washingtonpost.com/world/2024/05/14/georgia-foreign-agent-law-approved/", 
            "description": "The approval defies mass street protests by Georgians who fear the bill will strip civil rights and push their country further into Moscow’s orbit.", 
            "title": "Georgia parliament approves controversial foreign agent law defying protests - The Washington Post"
        }, 
        {
            "url": "https://www.buffalobills.com/news/wr-marquez-valdes-scantling-signs-one-year-deal-with-bills", 
            "description": "Buffalo's newest wide receiver led the NFL in yards per reception during the 2020 season.", 
            "title": "WR Marquez Valdes-Scantling signs one-year deal with Bills - BuffaloBills.com"
        }, 
        {
            "url": "https://www.espn.com/nfl/story/_/id/40144410/aaron-rodgers-jets-visit-49ers-mnf-week-1", 
            "description": "Aaron Rodgers' comeback season will open in prime time, as the New York Jets will travel to the San Francisco 49ers to face the defending NFC champions Sept. 9 on ESPN's \"Monday Night Football.\"", 
            "title": "Rodgers, Jets to visit Niners on MNF in Week 1 - ESPN"
        }, 
        {
            "url": "https://www.livemint.com/news/trends/missed-aurora-magic-northern-lights-likely-to-be-visible-again-nasa-confirms-fresh-solar-storm-this-week-11715687539850.html", 
            "description": "The fresh solar storm forecast has increased the possibility of seeing more aurora across various parts of the globe", 
            "title": "Missed Aurora magic? Northern Lights likely to be visible again, NASA confirms fresh solar storm this week | Mint - Mint"
        }, 
        {
            "url": "https://www.cosmopolitan.com/entertainment/celebs/a60786942/travis-kelce-gift-taylor-swift-kentucky-derby/", 
            "description": "Check out the sentimental gift Travis Kelce got Taylor Swift at the Kentucky Derby.", 
            "title": "Check out the Sentimental Gift Travis Kelce Got Taylor Swift at the Kentucky Derby - Cosmopolitan"
        }, 
        {
            "url": "https://www.wsj.com/science/academic-studies-research-paper-mills-journals-publishing-f5a3d4bc", 
            "description": null, 
            "title": "Exclusive | Flood of Fake Science Forces Multiple Journal Closures - The Wall Street Journal"
        }, 
        {
            "url": "https://www.france24.com/en/live-news/20240514-israeli-police-say-investigating-ransacking-of-gaza-bound-aid-trucks", 
            "description": null, 
            "title": "Israeli police say investigating ransacking of Gaza-bound aid trucks - FRANCE 24 English"
        }
    ], 
    "last_updated": "2024-05-15 18:00:07"
}