{
    "news": [
        {
            "url": "https://www.cbsnews.com/news/jerry-seinfeld-duke-university-commencement-address-graduates-walk-out/", 
            "description": "Jerry Seinfeld, who has supported Israel since the Oct. 7 attack by Hamas militants, delivered the commencement address at Duke University on Sunday.", 
            "title": "Duke University graduates walk out ahead of Jerry Seinfeld's commencement address - CBS News"
        }, 
        {
            "url": "https://www.cbsnews.com/colorado/news/dozens-colorado-dairy-farm-workers-monitored-avian-bird-flu-symptoms/", 
            "description": "The Colorado Department of Public Health and Environment confirmed Friday that approximately 70 dairy farm workers are currently being monitored for possible symptoms of avian flu.", 
            "title": "Dozens of Colorado dairy farm workers monitored for bird flu symptoms - CBS News"
        }, 
        {
            "url": "https://www.cbssports.com/nba/news/2024-nba-draft-order-complete-list-of-picks-as-atlanta-hawks-win-no-1-selection-in-lottery/", 
            "description": "The full draft order was unveiled Sunday afternoon", 
            "title": "2024 NBA Draft order: Complete list of picks as Atlanta Hawks win No. 1 selection in Lottery - CBS Sports"
        }, 
        {
            "url": "https://www.startribune.com/timberwolves-nuggets-live-game-report-nikola-jokic-anthony-edwards-nba-playoffs/600365426/", 
            "description": "Denver's win in Game 3 enabled it to cut the Wolves' lead to 2-1 entering tonight's contest at Target Center.", 
            "title": "Live from Timberwolves-Nuggets Game 4 - Star Tribune"
        }, 
        {
            "url": "https://arstechnica.com/cars/2024/05/the-2025-aston-martin-vantage-gets-a-bold-new-body-and-big-power-boost/", 
            "description": "It features modern tech, a better interior, and an extra 150 hp on the old model.", 
            "title": "The 2025 Aston Martin Vantage gets a bold new body and big power boost - Ars Technica"
        }, 
        {
            "url": "https://www.espn.com/nba/story/_/id/40133896/indiana-pacers-cruise-new-york-knicks-tie-series", 
            "description": "The Indiana Pacers utilized a 69-point first half to control Game 4 against the New York Knicks on Sunday afternoon in Indianapolis, evening the series at 2-2 before the East Semifinals shift back to Madison Square Garden for a pivotal Game 5.", 
            "title": "Indiana Pacers cruise past New York Knicks, tie series - ESPN"
        }, 
        {
            "url": "https://sports.yahoo.com/rory-mcilroy-dominates-xander-schauffele-field-for-4th-wells-fargo-title-as-pga-championship-looms-215447122.html", 
            "description": "McIlroy now has four wins at 2025 PGA Championship host Quail Hollow and is dialed in ahead of next week's PGA Championship at Valhalla.", 
            "title": "Rory McIlroy dominates Xander Schauffele, field for 4th Wells Fargo title as PGA Championship looms - Yahoo Sports"
        }, 
        {
            "url": "https://www.reuters.com/world/europe/putin-proposes-sacking-defence-minister-shoigu-parliament-says-2024-05-12/", 
            "description": null, 
            "title": "Putin taps civilian economist to run defense, replacing Shoigu in surprise move - Reuters"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/12/politics/biden-lawmakers-congress-israel-ultimatum-weapons-israel/index.html", 
            "description": "Lawmakers in Washington, DC, on Sunday weighed in on President Joe Biden’s ultimatum last week on CNN that an Israeli invasion of Rafah would cause him to pause certain weapons transfers.", 
            "title": "Biden faces bipartisan backlash on Capitol Hill over Israel ultimatum - CNN"
        }, 
        {
            "url": "https://www.eonline.com/news/1401437/olivia-munn-shares-she-underwent-a-hysterectomy-amid-cancer-battle", 
            "description": "Olivia Munn revealed in a new interview that in addition to her double mastectomy, she also had a hysterectomy after being diagnosed with breast cancer.", 
            "title": "Olivia Munn Shares She Underwent a Hysterectomy Amid Cancer Battle - E! NEWS"
        }, 
        {
            "url": "https://apnews.com/article/maryland-baltimore-bridge-collapse-controlled-demolition-3da84f13a5688af5cc0bdba4c922bd32", 
            "description": "The controlled demolition of the largest remaining steel span of the collapsed Francis Scott Key Bridge in Baltimore has been postponed because of weather conditions. The explosives are now expected to be detonated Monday evening. The steel span landed on the…", 
            "title": "Baltimore bridge collapse: Controlled demolition scheduled - The Associated Press"
        }, 
        {
            "url": "https://www.ksl.com/article/51006239/astronomers-finally-detect-a-rocky-planet-with-an-atmosphere", 
            "description": "Astronomers have searched for years for rocky planets beyond our solar system with an atmosphere — a trait considered essential for any possibility of harboring life.", 
            "title": "Astronomers finally detect a rocky planet with an atmosphere - KSL.com"
        }, 
        {
            "url": "https://nypost.com/2024/05/12/us-news/boardwalk-empire-star-steve-buscemi-attacked-by-rock-wielding-maniac-in-nyc/", 
            "description": "Actor Steve Buscemi, a Brooklyn native and one-time FDNY firefighter, became the latest victim of random New York City street violence when he was slugged by a vagrant who ran off.", 
            "title": "'Boardwalk Empire' star Steve Buscemi punched by maniac in random NYC attack - New York Post "
        }, 
        {
            "url": "https://www.youtube.com/watch?v=E2Chww7IpzU", 
            "description": "There has been a lot of debate around the world about ultra-processed food and some studies have suggested it is linked to poor health. But, what exactly is ...", 
            "title": "What is ultra-processed food and what does it mean for your health? | BBC News - BBC News"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/12/ukraines-military-chief-admits-difficult-situation-in-kharkiv-region", 
            "description": "General Syrskii says situation in northeastern oblast ‘significantly worsened’ this week as Russian forces advance.", 
            "title": "Ukraine’s military chief admits ‘difficult situation’ in Kharkiv region - Al Jazeera English"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/roger-corman-tributes-1235897043/", 
            "description": "Corman died on Thursday at age 98.", 
            "title": "Ron Howard, Joe Russo, John Carpenter and More Pay Tribute to Roger Corman: “Profound Loss to Cinema” - Hollywood Reporter"
        }, 
        {
            "url": "https://www.space.com/spacex-starlink-launch-group-6-58", 
            "description": "Liftoff is scheduled for 8:53 p.m. ET tonight (May 12).", 
            "title": "SpaceX to launch 23 Starlink satellites from Florida tonight - Space.com"
        }, 
        {
            "url": "https://fox8.com/news/tributes-pour-in-for-euclid-officer-killed-in-line-of-duty/", 
            "description": "Tributes pour in for Euclid, Ohio police officer killed in line of duty", 
            "title": "Tributes for Euclid officer killed in line of duty - WJW FOX 8 News Cleveland"
        }, 
        {
            "url": "https://www.usatoday.com/story/news/world/2024/05/12/mexico-earthquake-guatemala/73664081007/", 
            "description": "A 6.4 magnitude earthquake struck early Sunday near the border of Mexico and Guatemala.", 
            "title": "Earthquake rattles Mexico-Guatemala: 6.4 magnitude temblor strikes - USA TODAY"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/12/politics/michael-cohen-trump-hush-money/index.html", 
            "description": "Nobody has anything nice to say about Michael Cohen.", 
            "title": "Here are all the bad things witnesses have said about Michael Cohen, Trump’s former fixer who is set to testify Monday - CNN"
        }
    ], 
    "last_updated": "2024-05-14 03:16:45"
}