{
    "news": [
        {
            "url": "https://warriorswire.usatoday.com/2024/05/25/draymond-green-reacts-to-luka-doncics-game-winner-vs-timberwolves-in-game-2/", 
            "description": "Draymond Green chimed in on Instagram after Luka Doncic's clutch game-winner against the Timberwolves in Game 2 of the Western Conference Finals.", 
            "title": "Draymond Green reacts to Luka Doncic's game-winner vs. Timberwolves in Game 2 - Yahoo Sports"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/25/europe/kharkiv-russian-strike-hypermarket-ukraine-intl/index.html", 
            "description": "At least two people have been killed and others are missing after a Russian strike hit a large hardware store in Kharkiv, Ukraine on Saturday, according to officials.", 
            "title": "At least two killed and others missing after Russia strikes hardware store in Kharkiv - CNN"
        }, 
        {
            "url": "https://www.polygon.com/24164149/atlas-jennifer-lopez-director-brad-peyton-mech-design", 
            "description": null, 
            "title": "Atlas director says Jennifer Lopez's dance skills were key to mech fights - Polygon"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/furiosa-box-office-garfield-worst-memorial-day-1235909084/", 
            "description": "The bad news doesn't end there: overall revenue for the four-day holiday could hit a 25-year low.", 
            "title": "Box Office Meltdown: ‘Furiosa’ or ‘Garfield Movie’ to Win Memorial Day With Worst No. 1 Opening in 31 Years - Hollywood Reporter"
        }, 
        {
            "url": "https://www.motorsport.com/f1/news/leclerc-would-have-felt-completely-stupid-without-monaco-f1-pole/10615566/", 
            "description": "Charles Leclerc felt he would look \"completely stupid\" if he missed Monaco Grand Prix pole after dominating Formula 1 practice in the principality for Ferrari.", 
            "title": "Leclerc would have felt \"completely stupid\" without Monaco F1 pole - Motorsport.com"
        }, 
        {
            "url": "https://variety.com/2024/film/news/cannes-film-festival-2024-palme-dor-prizes-awards-1236016498/", 
            "description": "Jury president Greta Gerwig announced 'Anora' as the Palme d'Or winner, marking the first American film to win Cannes' top prize since 'Tree of Life.'", 
            "title": "Cannes Awards: Female-Centered Stories Win Big in Cannes, as Sean Baker’s ‘Anora’ Wins Palme d’Or - Variety"
        }, 
        {
            "url": "https://www.nbcnews.com/health/health-news/bear-meat-family-reunion-outbreak-roundworm-disease-rcna154050", 
            "description": "Six family members were sickened with a rare parasitic disease caused by roundworm larvae after they ate undercooked kebabs made of bear meat.", 
            "title": "Bear meat kebabs at family reunion lead to outbreak of roundworm disease - NBC News"
        }, 
        {
            "url": "https://www.thedailybeast.com/at-least-20-people-killed-in-horrific-amusement-park-fire-in-western-india", 
            "description": "The cause of the fire is being investigated.", 
            "title": "At Least 20 People Killed in Horrific Amusement Park Fire - The Daily Beast"
        }, 
        {
            "url": "https://www.cnet.com/deals/best-memorial-day-sales-2024-05-25/", 
            "description": "It's Memorial Day weekend and we're here rounding up all the best deals to save you a bit of cash. Let's kick things off!", 
            "title": "Memorial Day Sales 2024: Get the Best Deals From Amazon, Best Buy, Walmart and More - CNET"
        }, 
        {
            "url": "https://www.nbcnews.com/news/sports/caitlin-clark-indiana-fever-1st-win-wnba-season-rcna154054", 
            "description": "The heat is off Caitlin Clark and the Indiana Fever now that the WNBA rookie sensation and her team have won their first game of the season.", 
            "title": "Heat is off Caitlin Clark and Indiana Fever after 1st win of WNBA season - NBC News"
        }, 
        {
            "url": "https://www.washingtonpost.com/politics/2024/05/25/alito-flag-martha-ann-washington-post/", 
            "description": "In January 2021, Martha-Ann Alito said the flag, a symbol embraced by election deniers, was raised outside her home in response to a neighborhood dispute.", 
            "title": "Martha-Ann Alito told The Post in 2021 that flag was ‘signal of distress’ - The Washington Post"
        }, 
        {
            "url": "https://nypost.com/2024/05/25/us-news/haitian-gangs-shot-burned-bodies-of-young-missionary-husband-nonprofit-director/", 
            "description": "Davy Lloyd and Natalie Baker Lloyd were killed on Thursday evening.", 
            "title": "Haitian gangs shot, burned bodies of Missouri pol's missionary daughter, husband while couple was on phone with father-in-law - New York Post "
        }, 
        {
            "url": "https://www.koco.com/article/oklahoma-storms-ok-weather-timeline-hail-tornado-saturday/60903320", 
            "description": "A handful of strong tornadoes, softball-sized hail and 80 mph winds are possible as there's a significant risk of severe storms on Saturday in Oklahoma.", 
            "title": "TIMELINE: Oklahoma could see large hail and tornadoes on Saturday - KOCO Oklahoma City"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/25/politics/donald-trump-libertarian-party-rfk/index.html", 
            "description": "Donald Trump will address the Libertarian Party’s convention Saturday, a move illustrative of his campaign’s intensifying concern over third-party candidates.", 
            "title": "Trump courts Libertarians amid mounting concern over third-party candidates - CNN"
        }, 
        {
            "url": "https://nytlicensing.com/stories/e9T2V9Ql", 
            "description": "Brent Jacquette knows a thing or two about college sports. A former collegiate soccer player and coach in Pennsylvania who is now an executive at a...", 
            "title": "NCAA Athletes' Pay Deal Raises Questions About Future of College Sports - Yahoo! Voices"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/25/israel-continues-to-bomb-gaza-including-rafah-despite-icj-ruling", 
            "description": "Dozens of Palestinians killed across the besieged territory as Israeli forces hit multiple targets from north to south.", 
            "title": "Israel continues to bomb Gaza, including Rafah, despite ICJ ruling - Al Jazeera English"
        }, 
        {
            "url": "https://www.reuters.com/world/asia-pacific/more-than-300-buried-papua-new-guinea-landslide-local-media-says-2024-05-25/", 
            "description": null, 
            "title": "More than 300 buried in Papua New Guinea landslide, local media report - Reuters"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/25/world/nasa-prefire-mission-launch-scn/index.html", 
            "description": "NASA has launched the first of two research satellites to measure how much heat is lost to space from the Arctic and Antarctica.", 
            "title": "NASA launches tiny CubeSat to set its sights on Earth - CNN"
        }, 
        {
            "url": "https://www.reuters.com/world/asia-pacific/china-ends-war-games-taiwan-details-warplane-warship-surge-2024-05-25/", 
            "description": null, 
            "title": "China ends war games, Taiwan details warplane, warship surge - Reuters"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/25/millions-vote-amid-heatwave-alert-in-phase-6-of-indias-staggered-election", 
            "description": "Many people lined polling stations before the start of voting at 7am to avoid blazing sun at peak of summer.", 
            "title": "Millions vote amid heatwave alert in Phase 6 of India’s staggered election - Al Jazeera English"
        }
    ], 
    "last_updated": "2024-05-26 21:40:13"
}