{
    "news": [
        {
            "url": "https://www.usatoday.com/story/news/nation/2024/05/29/bird-flu-updates-iowa-infected-chickens-alpacas/73892743007/", 
            "description": "An outbreak in Iowa will result in the culling of a 4-million chicken flock. The infection has also been found in alpacas for the first time.", 
            "title": "Bird flu updates: 4.2M infected chickens to be culled in Iowa, cases detected in alpacas - USA TODAY"
        }, 
        {
            "url": "https://www.tomsguide.com/computing/mobile-apps/google-news-goes-down-for-millions-of-users-worldwide-in-mysterious-outage", 
            "description": "A slow news day?", 
            "title": "Google News goes down for millions worldwide in mysterious outage — latest updates - Tom's Guide"
        }, 
        {
            "url": "https://www.ft.com/content/6c0b34a3-63d7-4dad-865b-5554ff7b73ff", 
            "description": "Personal consumption expenditures figure was in line with economists’ expectations", 
            "title": "Fed's preferred inflation metric remains at 2.7% in April - Financial Times"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/31/trump-campaign-donations-record.html", 
            "description": "The Trump campaign said it nearly doubled its single-day fundraising record after a New York jury found Donald Trump guilty in his criminal hush money trial.", 
            "title": "Trump campaign raises record $34.8 million in donations after guilty verdict - CNBC"
        }, 
        {
            "url": "https://apnews.com/article/israel-palestinians-rafah-2f603675195f80c73c593020398ed72a", 
            "description": "The Israeli military has confirmed that its forces are operating in central parts of Rafah in its expanding offensive in the southern Gaza city. The military said in a statement Friday that its troops in central Rafah had uncovered Hamas rocket launchers and …", 
            "title": "Israel confirms its forces are in central Rafah in expanding offensive in the southern Gaza city - The Associated Press"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.wcvb.com/article/northern-lights-aurora-sunspot-visible-massachusetts/60960091", 
            "description": "Parts of New England could glimpse the aurora tonight, but there's another phenomenon we could see before sunset.", 
            "title": "Another chance to see northern lights, plus another solar spectacle - WCVB Boston"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/30/politics/biden-ukraine-limited-strikes-russia/index.html", 
            "description": "President Joe Biden has given permission to Ukraine to strike inside Russian territory with American munitions, though he has restricted their use so Kyiv can only hit targets over the border close to Kharkiv after Russia made significant advances around the …", 
            "title": "Biden gives Ukraine permission to carry out limited strikes within Russia using US weapons - CNN"
        }, 
        {
            "url": "https://www.cbsnews.com/news/germany-knife-stabbing-attack-mannheim-video-anti-islam-activist-michael-sturzenberger/", 
            "description": "Police confirm that several people were stabbed in an attack in southwest Germany which reportedly targeted an anti-Islam activist.", 
            "title": "Video shows anti-Islam activist among those stabbed in Germany knife attack - CBS News"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5yZXV0ZXJzLmNvbS93b3JsZC9taWRkbGUtZWFzdC95ZW1lbnMtaG91dGhpcy1zYXktdGhleS1sYXVuY2hlZC1taXNzaWxlLWF0dGFjay11cy1haXJjcmFmdC1jYXJyaWVyLWVpc2VuaG93ZXItMjAyNC0wNS0zMS_SAQA?oc=5", 
            "description": null, 
            "title": "Yemen's Houthis say they launched attack on US aircraft carrier Eisenhower in Red Sea - Reuters"
        }, 
        {
            "url": "https://apnews.com/article/minneapolis-police-shooting-injured-ca68f99b50603ac905237d407514485b", 
            "description": "A Minneapolis police officer was killed when he responded to a shooting call and was providing medical attention to a man who shot him in what authorities are calling an ambush. Minneapolis Assistant Police Chief Katie Blackwell says the suspected gunman and …", 
            "title": "Minneapolis police officer dies in ambush shooting that killed 2 others, including suspected gunman - The Associated Press"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.koin.com/news/nba-player-drew-gordon-philadelpiha-76ers-killed-car-crash/", 
            "description": "Former Philadelphia 76ers forward Drew Gordon has died in a car crash in Clackamas County, Oregon, according to ESPN.", 
            "title": "Drew Gordon, former 76ers player, killed in Clackamas County car crash - KOIN.com"
        }, 
        {
            "url": "https://www.politico.eu/article/france-u-turn-invite-russia-d-day-memorial-ceremony/", 
            "description": "The prospect of a Russian presence at the Normandy commemorations drew concern from Western allies.", 
            "title": "France U-turns on inviting Russia to D-Day memorial ceremony - POLITICO Europe"
        }, 
        {
            "url": "https://www.etonline.com/brad-pitt-and-angelina-jolies-daughter-shiloh-files-docs-to-legally-drop-pitt-from-last-name-226446", 
            "description": "Angelina Jolie's daughter, Shiloh, is reportedly asking the court to allow her to legally drop her dad's last name from her own.", 
            "title": "Brad Pitt and Angelina Jolie's Daughter Shiloh Files Docs to Legally Drop 'Pitt' From Last Name - Entertainment Tonight"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=6nTG_o_I_7Y", 
            "description": null, 
            "title": "Apple’s Biggest AI News at WWDC Will Be… Weird Emoji - CNET"
        }, 
        {
            "url": "https://www.cbsnews.com/news/serial-slingshot-shooter-prince-king-dies-after-arrest-california/", 
            "description": "Prince King was accused of breaking windows and car windshields and of narrowly missing people with ball bearings shot from a slingshot.", 
            "title": "81-year-old man accused of terrorizing California neighborhood for years with slingshot is found dead days after arrest - CBS News"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5lbmdhZGdldC5jb20vdGhlLW1vcm5pbmctYWZ0ZXItZ29vZ2xlLXRpZ2h0ZW5zLXVwLWl0cy1haS1vdmVydmlldy1mZWF0dXJlLWFmdGVyLXN1Z2dlc3RpbmctZ2x1ZS1vbi1hLXBpenphLTExMTUwMjA2MS5odG1s0gEA?oc=5", 
            "description": null, 
            "title": "The Morning After: Google tightens up its AI Overview feature after suggesting glue on a pizza - Engadget"
        }, 
        {
            "url": "https://arstechnica.com/cars/2024/05/driverless-racing-is-real-terrible-and-strangely-exciting/", 
            "description": "The Abu Dhabi Autonomous Racing League proves it’s possible, just very hard.", 
            "title": "Driverless racing is real, terrible, and strangely exciting - Ars Technica"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/31/entertainment/jim-henson-idea-man-documentary-review/index.html", 
            "description": "“Jim Henson: Idea Man” threads a difficult needle, celebrating the creative genius of the Muppets mastermind without sidestepping the thornier aspects of his personal life.", 
            "title": "‘Jim Henson: Idea Man’ celebrates the Muppets mastermind without shying away from the hand behind them - CNN"
        }
    ], 
    "last_updated": "2024-06-01 16:16:38"
}