{
    "news": [
        {
            "url": "https://www.cnbc.com/2024/05/29/russia-ukraine-live-updates.html", 
            "description": "French President Emmanuel Macron said Tuesday that Kyiv should be allowed to use Western arms against Russian military sites used to target Ukraine.", 
            "title": "Ukraine war updates: Macron says Kyiv should be allowed to use Western weapons on Russian military sites; Blinken travels to Moldova - CNBC"
        }, 
        {
            "url": "https://www.ign.com/articles/sony-state-of-play-may-2024", 
            "description": null, 
            "title": "Sony State of Play Announced for This Week, Expected to Feature New Astro Bot and More - IGN"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/29/24166168/fitbit-ace-lte-kids-smartwatch-wearables", 
            "description": "The $229.95 Fitbit Ace LTE is a fresh take on a smartwatch for children, with collectible wristbands, games, and built-in LTE connectivity for parents.", 
            "title": "The Fitbit Ace LTE is like a Nintendo smartwatch for kids - The Verge"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3Lm55dGltZXMuY29tL2F0aGxldGljLzU1MjU4NTQvMjAyNC8wNS8yOS9tbGItbmVncm8tbGVhZ3Vlcy1zdGF0LWNoYW5nZS13aGF0LXdoeS_SAQA?oc=5", 
            "description": null, 
            "title": "The MLB-Negro Leagues stat change: What happened, and why? - The New York Times"
        }, 
        {
            "url": "https://finance.yahoo.com/video/american-airlines-stock-tumbles-cutting-135300512.html", 
            "description": "Shares of American Airlines (AAL) are sinking after the company cut its second quarter sales outlook. Yahoo Finance's Pras Subramanian reports more on the...", 
            "title": "American Airlines stock tumbles after cutting Q2 guidance - Yahoo Finance"
        }, 
        {
            "url": "https://sports.yahoo.com/karl-anthony-towns-and-the-timberwolves-needed-this-win-keep-after-it-and-maybe-the-tide-turns-055829428.html", 
            "description": "Minnesota's All-Star big man finally found the range, extending the series to a Game 5 on Thursday night.", 
            "title": "Karl-Anthony Towns and the Timberwolves needed this win: 'Keep after it, and maybe the tide turns' - Yahoo Sports"
        }, 
        {
            "url": "https://www.wlky.com/article/scottie-scheffler-louisville-charges-court/60926542", 
            "description": "The Jefferson County prosecutor announced he will address Scottie Scheffler's Louisville charges in court on Wednesday.", 
            "title": "Scottie Scheffler's Louisville case to be addressed in court Wednesday - WLKY Louisville"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/29/africa/south-africa-elections-polls-open-intl/index.html", 
            "description": "Millions of South Africans are voting in what is expected to be the most pivotal general election since the end of apartheid.", 
            "title": "South Africans go to the polls in election seen as biggest test yet to ANC’s 30 years in power - CNN"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy9hcnRpY2xlcy9jMDMzbTUyOXJ5MG_SAQA?oc=5", 
            "description": null, 
            "title": "US military Gaza pier knocked out of action by heavy seas - BBC.com"
        }, 
        {
            "url": "https://www.usatoday.com/story/entertainment/movies/2024/05/29/wolfs-trailer-george-clooney-brad-pitt-new-movie-jon-watts/73882441007/", 
            "description": "George Clooney and Brad Pitt star in the trailer for the Jon Watts thriller \"Wolfs,\" which marks their first movie together in more than a decade.", 
            "title": "'Wolfs' trailer: Brad Pitt, George Clooney new movie reunites actors - USA TODAY"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c166xxd4y36o", 
            "description": "Several parts of northern and central India have recorded soaring temperatures this summer.", 
            "title": "Summer 2024: Temperatures cross 50C in northern India - BBC.com"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-deliberations-jury-judge-verdict-390f045e9e8a37f069e82576edd7a842", 
            "description": "Jurors in Donald Trump’s New York hush money trial are expected to begin deliberations after receiving instructions from the judge on the law and the factors they may consider as they strive to reach a verdict in the first criminal case against a former Ameri…", 
            "title": "Trump hush money trial: Jury begin deliberations after marathon closing arguments - The Associated Press"
        }, 
        {
            "url": "https://www.washingtonpost.com/health/2024/05/29/peanut-allergy-baby-infants/", 
            "description": "An author of the study said the correlation was “extraordinary.” She advised parents that “plain old peanut butter mixed in warm water can work for a 4-month-old.”", 
            "title": "Babies exposed to peanuts less likely to be allergic years later, study says - The Washington Post"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c977g96vll1o", 
            "description": "The £39bn mega-merger between the two international mining giants hangs by a thread.", 
            "title": "Anglo American rejects BHP's plea to extend mega-merger deadline - BBC.com"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS93b3JsZC9hcnRpY2xlLzIwMjQvbWF5LzI5L21leGljby1lbGVjdGlvbi12aW9sZW5jZS1jZWxheWHSAVVodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vd29ybGQvYXJ0aWNsZS8yMDI0L21heS8yOS9tZXhpY28tZWxlY3Rpb24tdmlvbGVuY2UtY2VsYXlh?oc=5", 
            "description": null, 
            "title": "‘It’s become a battleground’: Mexico’s local candidates face deadly violence - The Guardian"
        }, 
        {
            "url": "https://nypost.com/2024/05/29/us-news/general-hospital-star-johnny-wactors-family-doesnt-want-his-ex-fiancee-tessa-farrell-speaking-on-la-murder/", 
            "description": "In a video Tuesday, Farrell broke down in tears over the “General Hospital” star’s death, slamming the gunmen for shooting “the wrong guy.”", 
            "title": "'General Hospital' star Johnny Wactor's family doesn't want his ex-fiancée Tessa Farrell speaking on LA murder - New York Post "
        }, 
        {
            "url": "https://www.cnn.com/2024/05/29/entertainment/sean-diddy-combs-federal-investigation/index.html", 
            "description": "Federal investigators are preparing to bring accusers of music mogul Sean “Diddy” Combs before a federal grand jury, two sources familiar with the probe tell CNN — signaling the US Justice Department is moving towards possibly seeking an indictment of Combs.", 
            "title": "Exclusive: A federal grand jury may soon hear from Sean ‘Diddy’ Combs’ accusers - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/29/sport/caitlin-clark-wnba-history-indiana-fever-sparks-spt-intl/index.html", 
            "description": "The Indiana Fever’s early season woes continued Tuesday with an 88-82 defeat to the Los Angeles Sparks, but Caitlin Clark produced a historic performance.", 
            "title": "Caitlin Clark makes WNBA history in Indiana Fever loss to Los Angeles Sparks - CNN"
        }
    ], 
    "last_updated": "2024-05-30 17:13:26"
}