{
    "news": [
        {
            "url": "https://www.ft.com/content/641cf6f1-69dd-4b0c-af45-0fb2d0f4e80c", 
            "description": "Sergei Shoigu’s move from defence ministry painted as an attempt to rein in runaway military spending", 
            "title": "Putin replaces security chiefs in surprise reshuffle - Financial Times"
        }, 
        {
            "url": "https://www.cbssports.com/nba/news/2024-nba-draft-order-complete-list-of-picks-as-atlanta-hawks-win-no-1-selection-in-lottery/", 
            "description": "The full draft order was unveiled Sunday afternoon", 
            "title": "2024 NBA Draft order: Complete list of picks as Atlanta Hawks win No. 1 selection in Lottery - CBS Sports"
        }, 
        {
            "url": "https://www.cbsnews.com/news/jerry-seinfeld-duke-university-commencement-address-graduates-walk-out/", 
            "description": "Jerry Seinfeld, who has supported Israel since the Oct. 7 attack by Hamas militants, delivered the commencement address at Duke University on Sunday.", 
            "title": "Duke University graduates walk out ahead of Jerry Seinfeld's commencement address - CBS News"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=E2Chww7IpzU", 
            "description": "There has been a lot of debate around the world about ultra-processed food and some studies have suggested it is linked to poor health. But, what exactly is ...", 
            "title": "What is ultra-processed food and what does it mean for your health? | BBC News - BBC News"
        }, 
        {
            "url": "https://www.mlb.com/news/vladimir-guerrero-jr-cartwheels-after-catch", 
            "description": null, 
            "title": "Vladimir Guerrero Jr. cartwheels after catch - MLB.com"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/12/ukraines-military-chief-admits-difficult-situation-in-kharkiv-region", 
            "description": "General Syrskii says situation in northeastern oblast ‘significantly worsened’ this week as Russian forces advance.", 
            "title": "Ukraine’s military chief admits ‘difficult situation’ in Kharkiv region - Al Jazeera English"
        }, 
        {
            "url": "https://apnews.com/article/blinken-israel-hamas-gaza-rafah-war-6e0f887bd307f707a05190b33708fe58", 
            "description": "Secretary of State Antony Blinken has delivered some of the Biden administration’s strongest public criticism yet of Israel’s conduct of the war in Gaza. America's top diplomat said in two television interviews that Israeli tactics have meant “a horrible loss…", 
            "title": "Blinken delivers some of the strongest US public criticism of Israel's conduct of the war in Gaza - The Associated Press"
        }, 
        {
            "url": "https://nypost.com/2024/05/12/sports/novak-djokovic-loses-in-italian-open-after-taking-bottle-to-head/", 
            "description": "In Novak Djokovic’s career, the 2024 Italian Open will be remembered as the bottle tournament.", 
            "title": "Novak Djokovic loses in Italian Open after 'nausea, dizziness' from taking bottle to head - New York Post "
        }, 
        {
            "url": "https://wsbt.com/news/nation-world/6-dead-20-injured-after-apartment-block-collapses-in-russia-ukrainian-shelling-blamed-belgorod-online-footage-damage-destruction-rubble-search-and-rescue-tochka-u-trc-missile", 
            "description": "An apartment block partially collapsed in the Russian border city of Belgorod on Sunday, leaving at least six dead and 20 injured.", 
            "title": "6 dead, 20 injured after apartment block collapses in Russia, Ukrainian shelling blamed - WKRC TV Cincinnati"
        }, 
        {
            "url": "https://www.foxweather.com/earth-space/northern-lights-us-geomagnetic-storm-sunday", 
            "description": "Millions of people in the U.S. as far south as Alabama could be in for another dazzling display of the Northern Lights on Sunday night as Earth continues to be blasted by a historic geomagnetic storm that hasn’t been experienced in decades.", 
            "title": "Another 'severe and extreme' geomagnetic storm Sunday could bring Northern Lights as far south as Alabama - Fox Weather "
        }, 
        {
            "url": "https://variety.com/2024/film/box-office/kingdom-of-the-planet-of-the-apes-worldwide-box-office-opening-weekend-1235999832/", 
            "description": "\"Kingdom of the Planet of the Apes\" climbed to $72 million at the international box office, bringing its global tally to $129 million.", 
            "title": "‘Kingdom of the Planet of the Apes’ Swings to $72 Million at Overseas Box Office, Mighty $129 Million Globally - Variety"
        }, 
        {
            "url": "https://9to5mac.com/2024/05/12/ipad-pro-thin-redesigned-chassis-structure/", 
            "description": "The new iPad Pro is Apple’s thinnest product ever, with the 13-inch model measuring at just 5.1mm thick (excluding camera...", 
            "title": "Ultra-thin M4 iPad Pro features new internal structure to improve stiffness and heat dissipation - 9to5Mac"
        }, 
        {
            "url": "https://www.foxweather.com/extreme-weather/earthquake-mexico-guatemala-may-12", 
            "description": "A magnitude 6.4 earthquake struck just offshore the coasts of Mexico and Guatemala on Sunday morning, the U.S. Geological Survey reported.", 
            "title": "Magnitude 6.4 earthquake strikes near Mexico-Guatemala border on Sunday - Fox Weather "
        }, 
        {
            "url": "https://finance.yahoo.com/news/doomsday-recession-mentality-keeping-p-160000276.html", 
            "description": "(Bloomberg) -- North America’s largest companies are on track to post their best quarterly earnings relative to expectations in at least two years, as...", 
            "title": "A Doomsday Recession Mentality is Keeping the S&P 500 Strong - Yahoo Finance"
        }, 
        {
            "url": "https://techcrunch.com/2024/05/12/workers-at-a-maryland-apple-store-authorize-strike/", 
            "description": "It's been a busy weekend for union organizing efforts at U.S. Apple stores, with the union at one store voting to authorize a strike, while workers at", 
            "title": "Workers at a Maryland Apple store authorize strike - TechCrunch"
        }, 
        {
            "url": "https://thehill.com/homenews/nexstar_media_wire/4653747-will-your-last-covid-vaccine-work-against-new-flirt-variants/", 
            "description": "There are two new COVID-19 variants circulating, posing a threat to a summer surge. Is your last vaccine dose still protecting you?", 
            "title": "Will your last COVID vaccine work against new ‘FLiRT’ variants? - The Hill"
        }, 
        {
            "url": "https://nypost.com/2024/05/12/entertainment/maya-rudolph-transforms-into-beyonce-for-hot-ones-on-snl/", 
            "description": "Maya Rudolph revisited her beloved Beyoncé “Hot Ones” sketch on “SNL.”", 
            "title": "'SNL' host Maya Rudolph channels Beyoncé for spicy sketch and Mother's Day monologue - New York Post "
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.aljazeera.com/program/newsfeed/2024/5/12/berkeley-chancellor-speaks-out-about-gaza-brutality-at-graduation", 
            "description": "Chancellor of UC Berkeley addressed the ‘brutality of the violence in Gaza’ in her graduation ceremony speech.", 
            "title": "Berkeley chancellor speaks out about ‘Gaza brutality’ at graduation | Gaza - Al Jazeera English"
        }, 
        {
            "url": "https://theathletic.com/5487263/2024/05/12/celtics-jaylen-brown-cavaliers-game-3-win/", 
            "description": "\"We didn't come to Cleveland for the weather, so let's go,\" says Jaylen Brown.", 
            "title": "Jaylen Brown's pep talk fuels Celtics in Game 3: 'We're not here to play around' - The Athletic"
        }
    ], 
    "last_updated": "2024-05-13 22:46:25"
}