{
    "news": [
        {
            "url": "https://sports.yahoo.com/nba-playoffs-celtics-cruise-to-game-1-win-over-cavaliers-behind-big-night-from-jaylen-brown-derrick-white-011844326.html", 
            "description": "Jayson Tatum struggled from the field. But for a Celtics team loaded with weapons, it didn't matter.", 
            "title": "NBA playoffs: Celtics cruise to Game 1 win over Cavaliers behind big night from Jaylen Brown, Derrick White - Yahoo Sports"
        }, 
        {
            "url": "https://apnews.com/article/drake-shooting-toronto-mansion-03741edc5b50c9cab8424c7fa15adab1", 
            "description": "Police are investigating a shooting outside rapper Drake’s mansion that left a security guard seriously wounded. Authorities did not confirm whether Drake was at home at the time of the shooting, but said his team is cooperating. The shooting happened around …", 
            "title": "Drake house shooting: Police investigating, security injured - The Associated Press"
        }, 
        {
            "url": "https://wwmt.com/news/local/nws-tornado-touches-down-near-decatur-van-buren-county-residents-take-shelter-severe-weather-alert-kalamazoo-county-west-michigan", 
            "description": "Update 7:37 p.m. - A tornado warning has been issued for Calhoun County until 8:30 p.m.", 
            "title": "NWS: Tornado touches down near Decatur; tornado warning issued for Calhoun County - WWMT-TV"
        }, 
        {
            "url": "https://www.wsj.com/finance/regulation/fdic-investigation-report-discrimination-harassment-522d43d9", 
            "description": null, 
            "title": "FDIC Investigation Finds Culture Rife With Sexual Harassment, Discrimination - The Wall Street Journal"
        }, 
        {
            "url": "https://www.cbssports.com/nfl/news/2024-nfl-schedule-release-sneak-peek-here-are-seven-things-we-already-know-about-this-years-slate-of-games/", 
            "description": "The 2024 schedule isn't out yet, but we already know quite a few things about this year's slate of games", 
            "title": "2024 NFL schedule release sneak peek: Here are seven things we already know about this year's slate of games - CBS Sports"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c72pqlgqe4jo", 
            "description": "TikTok said the measure was an \"extraordinary intrusion on free speech rights\".", 
            "title": "TikTok sues to block US law which could ban app - BBC.com"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/07/politics/judge-postpones-trump-classified-documents-trial/index.html", 
            "description": "Judge Aileen Cannon has indefinitely postponed former President Donald Trump’s classified documents trial in Florida, citing significant issues around classified evidence that would need to be worked out before the federal criminal case goes to a jury.", 
            "title": "Federal judge indefinitely postpones Trump classified documents trial - CNN"
        }, 
        {
            "url": "https://www.espn.com/nba/story/_/id/40102961/nuggets-jamal-murray-fined-100k-avoids-suspension-toss", 
            "description": "Jamal Murray was fined $100K but avoided a suspension after tossing multiple objects in the direction of an official during Denver's Game 2 loss.", 
            "title": "Nuggets' Jamal Murray fined $100K, avoids suspension for toss - ESPN"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cm54pp11x3go", 
            "description": "Serbia has been deepening its relationship with China while continuing talks to join the EU.", 
            "title": "China's Xi Jinping gets red-carpet welcome in Serbia - BBC.com"
        }, 
        {
            "url": "https://families.google.com/service-restricted", 
            "description": null, 
            "title": "Cleveland Cavaliers @ Boston Celtics Game 1 | #NBAplayoffs presented by Google Pixel Live Scoreboard - NBA"
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-07/ftx-has-billions-more-than-needed-to-repay-bankruptcy-victims", 
            "description": "Cryptocurrency exchange FTX has amassed billions of dollars more than it needs to cover what customers lost in its November 2022 collapse, setting them up to receive full recoveries under the company’s bankruptcy.", 
            "title": "FTX Has Billions More Than It Needs to Repay Its More Than Two Million Customers - Bloomberg"
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-07/openai-is-readying-an-ai-search-product-to-rival-google-perplexity", 
            "description": "The feature would let ChatGPT users search the web and cite sources in its results.", 
            "title": "OpenAI Is Readying a Search Product to Rival Google, Perplexity - Bloomberg"
        }, 
        {
            "url": "https://apnews.com/article/boy-scouts-new-name-scouting-america-d583f5712680f155b4f6b762128734d3", 
            "description": "The Boy Scouts of America is changing its name for the first time in its 114-year history. The Texas-based organization announced Tuesday that it would become Scouting America. It's a significant shift for the organization as it emerges from bankruptcy after …", 
            "title": "Boy Scouts is changing its name to Scouting America - The Associated Press"
        }, 
        {
            "url": "https://www.livescience.com/space/black-holes/epic-nasa-video-takes-you-to-the-heart-of-a-black-hole-and-destroys-you-in-seconds", 
            "description": "What would it be like to fall past the event horizon of a black hole? A new NASA simulation provides a peek into the bizarre physics of spaghettification.", 
            "title": "Epic NASA video takes you to the heart of a black hole — and destroys you in seconds - Livescience.com"
        }, 
        {
            "url": "https://www.reuters.com/technology/us-revoked-some-export-licenses-chinas-huawei-2024-05-07/", 
            "description": null, 
            "title": "US revokes some export licenses for China's Huawei - Reuters"
        }, 
        {
            "url": "http://9to5google.com/2024/05/07/google-pixel-8a-trade-in-values/", 
            "description": "Google is offering some excellent Pixel 8a trade-in values, with especially good prices for older A-Series Pixel phones.", 
            "title": "Google offering solid trade-in values towards Pixel 8a for previous A-Series phones - 9to5Google"
        }, 
        {
            "url": "https://www.androidcentral.com/apps-software/google-announces-may-2024-update-to-pixel-phones", 
            "description": "The new update rollout begins today for the global versions of Pixel 5a and above.", 
            "title": "Google brings May update to Pixel phones with bug fixes - Android Central"
        }, 
        {
            "url": "https://www.washingtonpost.com/wellness/2024/05/07/olive-oil-dementia-lower-risk/", 
            "description": "A study has found that daily olive oil consumption is associated with a lower risk of dying from dementia.", 
            "title": "Olive oil use associated with lower risk of dying from dementia - The Washington Post"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/7/the-goal-is-to-destroy-gaza-why-israel-rejects-a-ceasefire-with-hamas", 
            "description": "Israel has rejected a ceasefire and launched an operation in Rafah, raising fears that the war in Gaza could drag on.", 
            "title": "'The goal is to destroy Gaza': Why Israel rejects a ceasefire with Hamas - Al Jazeera English"
        }
    ], 
    "last_updated": "2024-05-09 03:36:55"
}