{
    "news": [
        {
            "url": "https://www.cnbc.com/2024/05/29/salesforce-crm-q1-earnings-report-2025.html", 
            "description": "Salesforce issued a disappointing forecast in its quarterly earnings report on Wednesday.", 
            "title": "Salesforce shares plunge 17% on revenue miss, weak forecast - CNBC"
        }, 
        {
            "url": "https://www.washingtonpost.com/weather/2024/05/29/record-heat-delhi-india-climate-survival/", 
            "description": "Delhi experienced record highs near 122 degrees (50 Celsius) Tuesday and Wednesday.", 
            "title": "Record heat in Delhi and northern India nears limits of human survival - The Washington Post"
        }, 
        {
            "url": "https://apnews.com/article/harvey-weinstein-me-too-retrial-nyc-courthouse-1d1182cdcf20b26fa9f1f72f3d085ee4", 
            "description": "Manhattan prosecutors have told a judge they are evaluating new claims of sexual misconduct made against Harvey Weinstein. Assistant District Attorney Nicole Blumberg has said during a court hearing Wednesday that additional people have come forward with assa…", 
            "title": "Harvey Weinstein may face new charges as more accusers come forward, New York prosecutors say - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/29/us/scottie-scheffler-court-hearing/index.html", 
            "description": "All charges against Scottie Scheffler have been dismissed less than two weeks after the world No. 1 golfer was arrested trying to drive around the scene of a fatal crash on his way to the PGA Championship – and as video of the arrest aftermath emerged.", 
            "title": "Charges against Scottie Scheffler dismissed after arrest outside PGA Championship - CNN"
        }, 
        {
            "url": "https://www.washingtonpost.com/sports/2024/05/29/bronny-james-nba-draft/", 
            "description": "James’s decision will inevitably lead to intrigue about whether he could team up with his father, LeBron, next season.", 
            "title": "Bronny James will stay in the NBA draft. Is a pairing with LeBron James next? - The Washington Post"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/glenn-close-knives-out-3-1235911053/", 
            "description": "Production on 'Wake Up Dead Man,' the latest installment of Rian Johnson's murder mystery movie series, begins in June in the U.K.", 
            "title": "Glenn Close Joins Daniel Craig in ‘Knives Out 3’ (Exclusive) - Hollywood Reporter"
        }, 
        {
            "url": "https://www.cbsnews.com/news/supreme-court-justice-alito-wont-recuse-over-flags/", 
            "description": "Justice Samuel Alito has come under pressure from congressional Democrats to recuse himself from cases involving the Jan. 6, 2021, Capitol attack and former President Donald Trump.", 
            "title": "Alito tells congressional Democrats he won't recuse over flags - CBS News"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNic25ld3MuY29tL25ld3MvdXMtbWFkZS1ib21iLWlzcmFlbGktc3RyaWtlLXJhZmFoLW11bml0aW9ucy1leHBlcnRzLXNheS_SAVlodHRwczovL3d3dy5jYnNuZXdzLmNvbS9hbXAvbmV3cy91cy1tYWRlLWJvbWItaXNyYWVsaS1zdHJpa2UtcmFmYWgtbXVuaXRpb25zLWV4cGVydHMtc2F5Lw?oc=5", 
            "description": null, 
            "title": "U.S.-made bomb used in Israeli strike on Rafah that killed dozens, munitions experts say - CBS News"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c844em2ey7eo", 
            "description": "Grindavik's mayor says larger lava flows than usual are heading towards the largely abandoned area.", 
            "title": "Iceland volcano: Concern for town of Grindavik after new eruption - BBC.com"
        }, 
        {
            "url": "https://www.washingtonpost.com/education/2024/05/29/yale-new-president-maurie-mcinnis/", 
            "description": "Maurie McInnis, who has been president of Stony Brook University since 2020, is expected to begin July 1.", 
            "title": "Yale names historian leading Stony Brook as its next president - The Washington Post"
        }, 
        {
            "url": "https://finance.yahoo.com/news/american-airlines-stock-tanks-following-surprising-guidance-cut-173333605.html", 
            "description": "American Airlines stock is getting hit in midday trade after the company announced the departure of Vasu Raja, its chief commercial officer, and issued...", 
            "title": "American Airlines stock tanks following 'surprising' guidance cut - Yahoo Finance"
        }, 
        {
            "url": "https://www.espn.com/olympics/story/_/id/40240116/gabby-douglas-gymnastics-ends-2024-olympics-bid", 
            "description": "Three-time Olympic gold medalist Gabby Douglas has withdrawn from competition at the U.S. gymnastics championships in Fort Worth, citing an ankle injury.", 
            "title": "Gabby Douglas pulls out of U.S. championships, ends 2024 Olympic bid - ESPN"
        }, 
        {
            "url": "https://arstechnica.com/space/2024/05/ars-live-caleb-henry-joins-us-to-discuss-the-profitability-of-starlink/", 
            "description": "How has Starlink has gone from zero to profitability in five years?", 
            "title": "Ars Live: How profitable is Starlink? We dig into the details of satellite Internet. - Ars Technica"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL3NvdXRoLWFmcmljYS1lbGVjdGlvbi1hbmMtdm90ZS1kYjIwMWJjMWFhMjFhMWQ5ODZkNTBhZjE2NzRhOGU3ONIBAA?oc=5", 
            "description": null, 
            "title": "South Africa votes in election that could bring biggest shift since 1994 - The Associated Press"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c977g96vll1o", 
            "description": "The £39bn mega-merger between the two international mining giants collapses after a frantic back and forth.", 
            "title": "BHP pulls out of £39bn mega-merger with rival Anglo American - BBC.com"
        }, 
        {
            "url": "https://apnews.com/article/russia-ukraine-war-macron-weapons-e308755a31716ee0123b441bb9b548b0", 
            "description": "France’s president has joined the head of NATO in pushing for a policy shift that could change the complexion of the Ukraine war: allowing Kyiv to strike military bases inside Russia with sophisticated long-range weapons provided by its Western partners. It i…", 
            "title": "France's Macron urges a green light for Ukraine to strike targets inside Russia with Western weapons - The Associated Press"
        }, 
        {
            "url": "https://www.cbsnews.com/news/nicole-brown-simpsons-sisters-on-documentary-series-30-years-after-her-tragic-death/", 
            "description": "Nicole Brown Simpson's sisters discussed a new documentary series that they say reveals new details about her life and tragic death at 35 years old.", 
            "title": "Nicole Brown Simpson's sisters on documentary series 30 years after her murder: \"Let's humanize Nicole\" - CBS News"
        }, 
        {
            "url": "https://thehill.com/policy/healthcare/4691790-girls-periods-younger-less-regularity/", 
            "description": "Girls in the United States have been getting their periods at younger ages over the last fifty years, with additional variation among races, according to a new study. The study published in the JAMA Network Wednesday found that the average age girls born betw…", 
            "title": "Girls are getting their periods younger and with less regularity: ‘It alarms us’ - The Hill"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=ZobN3ny7rx8", 
            "description": null, 
            "title": "Former OpenAI board member reveals why CEO Sam Altman was fired in November - CNBC Television"
        }
    ], 
    "last_updated": "2024-05-30 23:13:53"
}