{
    "news": [
        {
            "url": "https://nypost.com/2024/05/13/entertainment/steve-buscemi-spotted-with-black-eye-swollen-face-after-random-nyc-attack/", 
            "description": "The 66-year-old “Boardwalk Empire” actor was sporting bruises and a swollen chin while shooting a commercial in Soho on Saturday.", 
            "title": "Steve Buscemi spotted with black eye, swollen face after random NYC attack - New York Post "
        }, 
        {
            "url": "https://www.espn.com/nfl/story/_/id/40139300/buccaneers-make-safety-antoine-winfield-jr-nfl-highest-paid-db", 
            "description": "The Buccaneers and Antoine Winfield Jr. have reached agreement on a four-year, $84.1 million deal, agent David Mulugheta told ESPN's Adam Schefter on Monday.", 
            "title": "Buccaneers, Antoine Winfield agree to 4-year, $81.4M contract - ESPN"
        }, 
        {
            "url": "https://finance.yahoo.com/news/gamestop-jumps-roaring-kitty-returns-112405881.html", 
            "description": "(Reuters) -Shares of videogame retailer GameStop surged 66% on Monday after \"Roaring Kitty\", social media finance influencer credited with sparking the 2021 ...", 
            "title": "GameStop soars as flag bearer 'Roaring Kitty' resurfaces, sparks meme stock rally - Yahoo Finance"
        }, 
        {
            "url": "https://www.yahoo.com/news/canadian-wildfires-trigger-air-quality-165157560.html", 
            "description": "Smoke from wildfires in western Canada has triggered air quality alerts and warnings in Montana, North Dakota, South Dakota and Minnesota.", 
            "title": "Canadian wildfires trigger air quality alerts across 4 U.S. states - Yahoo! Voices"
        }, 
        {
            "url": "https://9to5mac.com/2024/05/13/chatgpt-mac-desktop-openai/", 
            "description": "OpenAI announced during its spring update keynote that it would be launching a first-party Mac app for ChatGPT.", 
            "title": "ChatGPT arriving on the Mac in new OpenAI app ahead of WWDC - 9to5Mac"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/13/investing/melinda-gates-resigns-foundation/index.html", 
            "description": "Melinda French Gates, one of the world’s preeminent philanthropists, said Monday she would resign as co-chair of the Bill & Melinda Gates Foundation that she has helped lead since 2000.", 
            "title": "Melinda French Gates is resigning from the Bill & Melinda Gates Foundation - CNN"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c8vzzqz2qq6o", 
            "description": "Vladimir Putin has begun his fifth term in office by nominating an economist as the country's new minister of defence.", 
            "title": "Who is Andrei Belousov, Russia's new minister of defence? - BBC.com"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-stormy-daniels-michael-cohen-hush-money-f96dd7289cf952145cdd6737b29add3d", 
            "description": "Donald Trump’s fixer-turned-foe, Michael Cohen, is directly implicating the former president in a hush money scheme. He told jurors during highly anticipated testimony Monday that his celebrity client approved hefty payouts to stifle stories about sex that he…", 
            "title": "Trump hush money trial: Star witness Michael Cohen testifies - The Associated Press"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/13/openai-launches-new-ai-model-and-desktop-version-of-chatgpt.html", 
            "description": "OpenAI on Monday introduced a new AI model and a desktop version of ChatGPT, its popular chatbot.", 
            "title": "OpenAI launches new AI model and desktop version of ChatGPT - CNBC"
        }, 
        {
            "url": "http://9to5google.com/2024/05/13/google-gemini-video-input-prototype/", 
            "description": "Ahead of Google I/O, Google is showing off an impressive new conversational Gemini prototype which uses video input.", 
            "title": "Google shows off conversational Gemini prototype that uses video ahead of I/O [Video] - 9to5Google"
        }, 
        {
            "url": "https://theathletic.com/5489626/2024/05/13/bronny-james-nba-draft-combine/", 
            "description": "The USC freshman has been fully cleared to play in the league as part of Fitness to Play panel.", 
            "title": "Bronny James expected to stay in 2024 NBA Draft - The Athletic"
        }, 
        {
            "url": "https://www.washingtonpost.com/nation/2024/05/13/catholic-communion-louisiana-teen-gun/", 
            "description": "A live stream shows the chaos unfolding after several people confronted an armed teen who entered a Louisiana church during a First Communion service for 60 children.", 
            "title": "Teen gunman stopped during Louisiana Catholic church Communion for 60 - The Washington Post"
        }, 
        {
            "url": "http://www.billboard.com/music/music-news/taylor-swift-wears-kansas-city-chiefs-colors-travis-kelce-paris-eras-tour-1235681228/", 
            "description": "Taylor Swift wore Kansas City Chiefs colors with Travis Kelce in the crowd at her Paris Eras Tour show. Get the details.", 
            "title": "Taylor Swift Wears Kansas City Chiefs Colors at Paris Eras Show With Travis Kelce in the Audience - Billboard"
        }, 
        {
            "url": "https://hoopshype.com/lists/nba-draft-lottery-intel-whats-next-for-each-team/", 
            "description": "NBA Draft Lottery reporting on the Hawks, Wizards, Rockets, Spurs, Pistons, Hornets, Blazers, Grizzlies, Jazz, Bulls, Thunder, and Kings from HoopsHype Senior NBA Insider Michael Scotto.", 
            "title": "NBA Draft Lottery Intel: What's next for each team? - Hoops Hype"
        }, 
        {
            "url": "https://www.reuters.com/business/aerospace-defense/major-airlines-sue-biden-administration-over-fee-disclosure-rule-2024-05-13/", 
            "description": null, 
            "title": "Major airlines sue Biden administration over fee disclosure rule - Reuters"
        }, 
        {
            "url": "https://www.livescience.com/health/surgery/1st-person-to-receive-a-pig-kidney-transplant-has-died", 
            "description": "Rick Slayman was the first person in the world to receive this pioneering surgery in March 2024.", 
            "title": "1st person to receive a pig kidney transplant has died - Livescience.com"
        }, 
        {
            "url": "https://www.foxbusiness.com/economy/americans-expect-high-inflation-stick-around-latest-ny-fed-survey", 
            "description": "A New York Federal Reserve survey published on Monday found that many American consumers expect inflation to remain abnormally high in the coming years.", 
            "title": "Americans expect high inflation to stick around in latest NY Fed survey - Fox Business"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.ft.com/content/22fa5904-a46c-4f2b-83d4-209b0061b8e5", 
            "description": "Australian miner increases all-share proposal by 15% but board of UK-listed target says it is still ‘highly unattractive’", 
            "title": "Anglo American rejects improved £34bn offer from BHP - Financial Times"
        }, 
        {
            "url": "https://www.cnet.com/tech/mobile/after-using-google-pixel-8a-im-questioning-the-pixel-8s-purpose/", 
            "description": "The Pixel 8A is Google's best budget phone yet, but it could overshadow the regular Pixel 8.", 
            "title": "After Using Google's Pixel 8A, I'm Questioning the Pixel 8's Purpose - CNET"
        }
    ], 
    "last_updated": "2024-05-14 23:00:07"
}