{
    "news": [
        {
            "url": "https://www.wsj.com/business/autos/uaws-southern-expansion-is-tested-in-alabama-as-mercedes-vote-ends-4854ec2f", 
            "description": "Union’s loss hurts its push to organize at more facilities in the South owned by foreign automakers", 
            "title": "UAW Loses Unionization Vote at Mercedes Plant in Alabama - The Wall Street Journal"
        }, 
        {
            "url": "https://apnews.com/article/russia-ukraine-war-news-5-17-2024-ce31e2e73cbb8dd59aa73baa6cd87d68", 
            "description": "Russian President Vladimir Putin says Moscow’s offensive on Ukraine’s Kharkiv aims to create a buffer zone but that there are no plans to capture the city. Meanwhile, Ukraine says it will allow prisoners to join the army’s depleted ranks. Putin has said in Ch…", 
            "title": "Putin says Russia wants a buffer zone in Ukraine's Kharkiv but has no plans to capture the city - The Associated Press"
        }, 
        {
            "url": "https://www.lex18.com/news/covering-kentucky/scottie-scheffler-arrested-at-pga-championship-for-not-following-orders-after-traffic-fatality", 
            "description": "Masters champion Scottie Scheffler was arrested Friday morning on his way to the PGA Championship, with stunning images showing him handcuffed as he was led to a police car.", 
            "title": "Scottie Scheffler arrested for traffic violation, returns in time to tee off - LEX 18 News - Lexington, KY"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/17/entertainment/sean-combs-cassie-ventura/index.html", 
            "description": "A 2016 surveillance video obtained exclusively by CNN shows Sean “Diddy” Combs grab, shove, drag and kick his then-girlfriend Cassie Ventura during an altercation that matches allegations in a now-settled federal lawsuit filed by Ventura in November.", 
            "title": "Exclusive: Sean ‘Diddy’ Combs seen physically assaulting Cassie Ventura in 2016 surveillance video obtained by CNN - CNN"
        }, 
        {
            "url": "https://www.washingtonpost.com/technology/2024/05/17/boeing-starliner-launch-delay-may-25/", 
            "description": "The company is still assessing a helium leak in the service module of its Starliner capsule, whose test launch with astronauts has now been postponed three times.", 
            "title": "Boeing Starliner launch delayed again. New date is May 25 - The Washington Post"
        }, 
        {
            "url": "https://www.foxbusiness.com/markets/dow-hits-40000-for-first-time", 
            "description": "The Dow Jones Industrial Average crossed 40,000 on Thursday, the first new milestone in over three years as investors bank on an improving economy and corporate profits.", 
            "title": "Dow closes above 40,000 for first time - Fox Business"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/17/sport/scottie-scheffler-detained/index.html", 
            "description": "The world’s top-ranked golfer, Scottie Scheffler, was arrested, charged with felony assault and released from jail before shooting a stellar 5-under par at the PGA Championship on Friday in a whirlwind few hours that upended the typically staid world of profe…", 
            "title": "Scottie Scheffler arrested in alleged assault on police officer outside PGA Championship, then returns to ‘play some golf’ - CNN"
        }, 
        {
            "url": "https://apnews.com/article/putin-visit-china-xi-907134e5d2ec2cc62376caca5d8df79b", 
            "description": "Russian President Vladimir Putin is concluding a two-day visit to China by emphasizing the countries' strategic ties as well as his own personal relationship with Chinese leader Xi Jinping as they seek to present an alternative to U.S. global influence. Putin…", 
            "title": "Putin concludes a trip to China by emphasizing its strategic and personal ties to Russia - The Associated Press"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cz96d3dn9jro", 
            "description": "It marks the opening of a new route for humanitarian aid to reach the stricken Gaza Strip.", 
            "title": "US confirms first aid trucks arrive via Gaza pier - BBC.com"
        }, 
        {
            "url": "https://pagesix.com/2024/05/17/entertainment/ben-affleck-house-hunting-in-la-according-to-real-estate-buzz/", 
            "description": "Rumors have recently surfaced that the couple is on the rocks, but their reps so far have not commented.", 
            "title": "Ben Affleck 'house-hunting' in LA according to buzz, Jennifer Lopez seen doing the same as split rumors swirl - Page Six"
        }, 
        {
            "url": "https://abcnews.go.com/US/wireStory/canadian-police-link-4-women-killed-1970s-dead-110348912", 
            "description": "Canadian police say they have linked the deaths of four young women nearly 50 years ago to a now deceased U.S. fugitive who hid in Canada from the mid 1970s to the late 1990s", 
            "title": "Canadian police link 4 women killed in the 1970s to dead American serial sex offender - ABC News"
        }, 
        {
            "url": "https://www.espn.com/mlb/story/_/id/40166583/pirates-paul-skenes-dominant-second-start-vs-cubs", 
            "description": null, 
            "title": "Pirates' Paul Skenes holds Cubs hitless before exit after 6 - ESPN"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=G4-WBq3vnds", 
            "description": "AI has moved into a new era – from chatbots to AI agents capable of having instantaneous, real-time conversations as showcased by Microsoft-backed OpenAI’s G...", 
            "title": "Age of the AI agents: GPT-4o, Project Astra and an exclusive with Sundar Pichai - CNBC Television"
        }, 
        {
            "url": "https://abcnews.go.com/US/state-department-issues-travel-alert-caution-lgbtq-people/story?id=110349175", 
            "description": "The alert follows a similar warning from the FBI and the DHS.", 
            "title": "State Department issues travel alert for LGBTQ people, events abroad - ABC News"
        }, 
        {
            "url": "https://thepointsguy.com/news/frontier-airlines-overhauls-pricing-structure/", 
            "description": "Frontier Airlines is now offering four ticket categories: Basic, Economy, Premium and Business, while eliminating change fees for some tickets.", 
            "title": "Frontier overhauls pricing with four ticket categories - The Points Guy"
        }, 
        {
            "url": "https://www.commondreams.org/news/coral-bleaching-2668300664", 
            "description": "\"We had to add additional bleaching alert levels to appropriately categorize just how hot it was,\" said a coral reefs expert at the agency.", 
            "title": "Coral Bleaching 'Off the Charts' in Atlantic as NOAA Warns Ocean Going 'Crazy Haywire' - Common Dreams"
        }, 
        {
            "url": "https://variety.com/2024/film/news/yorgos-lanthimos-emma-stone-kinds-of-kindness-cannes-standing-ovation-1236007352/", 
            "description": "Yorgos Lanthimos’ ‘Kinds of Kindness,’ with Emma Stone and Jesse Plemons, earned a standing ovation at the 2024 Cannes Film Festival.", 
            "title": "Emma Stone’s Descent Into Sex Cults and Cannibalism in ‘Kinds of Kindness’ Lands 4.5-Minute Standing Ovation in Cannes - Variety"
        }, 
        {
            "url": "https://www.reuters.com/world/us/supreme-court-justice-alitos-home-flew-us-flag-upside-down-following-jan-6-nyt-2024-05-17/", 
            "description": "An American flag was photographed hanging upside down at the Virginia home of Supreme Court Justice Samuel Alito in January 2021, weeks after the Jan. 6 protests, the New York Times reported on Thursday.", 
            "title": "Supreme Court Justice Alito's home flew US flag upside down following Jan. 6-NYT - Reuters"
        }, 
        {
            "url": "https://deadline.com/video/francis-ford-coppola-megalopolis-adam-driver-aubrey-plaza-nathalie-emmanuel-interview-cannes/", 
            "description": "Francis Ford Coppola, Adam Driver, Aubrey Plaza and Nathalie Emmanuel", 
            "title": "Francis Ford Coppola \"Not Interested\" In Streaming For 'Megalopolis' - Deadline"
        }, 
        {
            "url": "http://electrek.co/2024/05/17/tesla-drops-steam-gaming-support-inside-vehicles/", 
            "description": "Tesla is telling new Model S and Model X buyers that they won’t have access to Steam gaming inside their...", 
            "title": "Tesla drops Steam gaming support inside its vehicles - Electrek.co"
        }
    ], 
    "last_updated": "2024-05-19 02:30:45"
}