{
    "news": [
        {
            "url": "https://www.youtube.com/watch?v=wVl0JcuCvMc", 
            "description": "LIVE | SpaceX Launches New Batch of Starlink Satellites from Vandenberg Air Force Base, California | N18L | English News LIVE Watch live coverage of SpaceX's...", 
            "title": "LIVE | SpaceX Launches New Batch of Starlink Satellites from Vandenberg Air Force Base, California - CNN-News18"
        }, 
        {
            "url": "https://www.reuters.com/world/middle-east/un-general-assembly-set-back-palestinian-bid-membership-2024-05-10/", 
            "description": null, 
            "title": "UN General Assembly backs Palestinian bid for membership - Reuters"
        }, 
        {
            "url": "https://www.bbc.com/news/world-asia-india-68767574", 
            "description": "The Delhi chief minister was arrested in March in a corruption case - he denies the allegations.", 
            "title": "Arvind Kejriwal: India court grants bail to Delhi leader - BBC.com"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-hush-money-stormy-daniels-cohen-ddef05884265e4d6217b55a89304b878", 
            "description": "Prosecutors in Donald Trump’s hush money trial are narrowing in on checks and phone records as they lay the groundwork for jurors to hear eventually from their star witness: Michael Cohen, Trump’s former attorney. With the third week of the testimony drawing …", 
            "title": "Trump hush money trial: Michael Cohen awaits turn after graphic Stormy Daniels account - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/10/politics/steve-bannon-appeal-denied/index.html", 
            "description": "A federal appeals court on Friday upheld the contempt-of-Congress conviction of Steve Bannon, the ex-adviser to former President Donald Trump who was found guilty after failing to comply with a subpoena from the House January 6 committee.", 
            "title": "Steve Bannon: Appeals court upholds contempt-of-Congress conviction for defying Jan. 6 subpoena - CNN"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/lord-of-the-rings-gollum-movie-reaction-1235894809/", 
            "description": "A 'Hunt for Gollum' has already been online for 15 years.", 
            "title": "Warners Allows Fan-Made ‘Lord of the Rings’ Movie to Stay on YouTube - Hollywood Reporter"
        }, 
        {
            "url": "https://jalopnik.com/boeing-spacecraft-should-be-grounded-over-risk-of-a-di-1851469185", 
            "description": "NASA delayed the debut crewed mission for the Boeing Starliner on Monday over a valve issue.", 
            "title": "Boeing Spacecraft Should Be Grounded Over 'Risk Of A Disaster,' Warns NASA Contractor - Jalopnik"
        }, 
        {
            "url": "https://www.espn.com/nba/story/_/id/40119273/pacers-coach-rick-carlisle-fined-35k-criticizing-refs", 
            "description": "Pacers coach Rick Carlisle has been fined $35,000 for criticizing the officiating during his team's playoff series against the Knicks.", 
            "title": "Pacers coach Rick Carlisle fined $35K for criticizing refs - ESPN"
        }, 
        {
            "url": "https://gizmodo.com/nintendo-doesnt-want-to-deal-with-x-twitter-either-1851469160", 
            "description": "This hardly used Switch feature is getting dropped.", 
            "title": "Nintendo Doesn't Want to Deal With X/Twitter Either - Gizmodo"
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-68979577", 
            "description": "Roger Fortson - who was armed - was fatally shot by officers responding to a disturbance call at his home.", 
            "title": "US airman shot and killed by police in Florida - BBC.com"
        }, 
        {
            "url": "https://www.cbsnews.com/news/flirt-covid-variants-us-cases/", 
            "description": "Some of the strains in the \"FLiRT\" group are closely related to the JN.1 COVID variant from last winter.", 
            "title": "\"FLiRT\" COVID variants are now more than a third of U.S. cases. Scientists share what we know about them so far. - CBS News"
        }, 
        {
            "url": "https://www.hola.com/us/celebrities/20240510359878/selena-gomez-went-viral-after-justin-biebers-baby-announcement/", 
            "description": "During their teenage years, Selena Gomez and Justin Bieber had a romantic relationship that captivated the interest of millions of fans.", 
            "title": "Selena Gomez went viral after Justin Bieber’s baby news - HOLA! USA"
        }, 
        {
            "url": "https://arizonasports.com/story/3547421/suns-plan-hire-mike-budenholzer-head-coach/", 
            "description": "The Phoenix Suns are reportedly set to hire Mike Budenholzer as the new head coach, moving quickly after firing Frank Vogel from the job.", 
            "title": "Suns plan to hire Mike Budenholzer as head coach, per report - Arizona Sports"
        }, 
        {
            "url": "https://www.gamesradar.com/games/city-builder/first-major-manor-lords-patch-takes-aim-at-enemy-ai-underpowered-archers-plus-overly-high-ale-consumption-and-adds-a-steep-tax-to-prevent-gold-hoarding/", 
            "description": "The city-builder cracks down on gold hoarders and boozy villagers", 
            "title": "First major Manor Lords patch takes aim at enemy AI, underpowered archers, plus \"overly high ale consumption\" - and adds a steep tax to prevent gold hoarding - Gamesradar"
        }, 
        {
            "url": "https://apnews.com/article/apple-ipad-ad-social-media-reaction-12e7fbd335feb4875d94c31b87379359", 
            "description": "A newly released ad promoting Apple’s new iPad Pro has struck quite a nerve online. The ad shows a hydraulic press crushing just about every creative instrument artists and consumers have used over the years — from a piano and record player, to piles of paint…", 
            "title": "Technology crushing human creativity? Apple's new iPad ad has struck a nerve online - The Associated Press"
        }, 
        {
            "url": "https://www.wctv.tv/2024/05/10/photos-storm-impacts-underway-across-south-georgia-big-bend-areas/", 
            "description": "Storm impacts passed through our local counties Friday morning, causing several power outages, school closures, and damage to homes and vehicles.", 
            "title": "PHOTOS: Storm impacts underway across South Georgia, Big Bend areas - WCTV"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c6pyv8q94g1o", 
            "description": "The attempt came during an attack on a town in the northeastern Kharkiv region, says the military.", 
            "title": "Ukraine says it repelled Russian bid to cross border - BBC.com"
        }, 
        {
            "url": "https://www.washingtonpost.com/business/2024/05/10/target-pride-collection/", 
            "description": "A year after a backlash over its LGBTQ+ products, the retailer says it won’t sell them at all locations this time.", 
            "title": "Target's Pride Month collection to appear in fewer stores - The Washington Post"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/10/health/feet-health-indicator-wellness-partner/index.html", 
            "description": "From your heels to your toes, your feet send messages about your well-being — including warning signs of health conditions.", 
            "title": "An often overlooked body part could give you clues about your health - CNN"
        }
    ], 
    "last_updated": "2024-05-11 21:09:38"
}