{
    "news": [
        {
            "url": "https://www.cnn.com/2024/05/27/us/bill-walton-death/index.html", 
            "description": "Bill Walton, the basketball Hall of Fame center who won two national titles at UCLA, two NBA championships in Portland and Boston and later put the “color” in color commentator, died Monday following a prolonged battle with cancer, the NBA announced.", 
            "title": "Bill Walton, basketball Hall of Famer and colorful commentator, dies of cancer at 71 - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/26/entertainment/johnny-wactor-shot/index.html", 
            "description": "Former “General Hospital” actor Johnny Wactor was fatally shot in downtown Los Angeles while interrupting thieves Saturday, according to his agent and CNN affiliate KABC.", 
            "title": "Johnny Wactor: Former ‘General Hospital’ actor fatally shot in Los Angeles - CNN"
        }, 
        {
            "url": "https://www.americamagazine.org/faith/2024/05/27/pope-francis-homosexual-seminary-248027", 
            "description": "Pope Francis told the Italian bishops’ conference not to allow homosexual men to enter the seminary to train for the priesthood, according to Italian media reports.", 
            "title": "Pope Francis says Italian seminaries should reject gay applicants - America: The Jesuit Review"
        }, 
        {
            "url": "https://www.wsj.com/tech/ai/elon-musks-xai-will-raise-6-billion-in-latest-fundraising-round-fcdd722d", 
            "description": null, 
            "title": "Elon Musk's xAI Valued at $24 Billion After Latest Fundraising Round - The Wall Street Journal"
        }, 
        {
            "url": "https://onemileatatime.com/news/bark-air/", 
            "description": "BARK Air is a new airline that flies Gulfstream G500s specifically for dogs and their owners. What an innovative concept!", 
            "title": "BARK Air: The First Airline For Dogs, Flying Gulfstreams - One Mile at a Time"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/27/health/black-bear-kabobs-trichinellosis/index.html", 
            "description": "It was supposed to be a celebration, but one family’s unique meal of black bear meat sent several members to the hospital instead.", 
            "title": "Black bear kebabs make family sick with parasitic worms - CNN"
        }, 
        {
            "url": "https://www.usatoday.com/story/news/nation/2024/05/27/19-dead-tornadoes-memorial-day-storms-texas-arkansas-oklahoma/73868079007/", 
            "description": null, 
            "title": "Tornadoes, bad weather as severe storms move east on Memorial Day - USA TODAY"
        }, 
        {
            "url": "https://www.teslarati.com/spacex-announces-next-starship-test-flight-date/", 
            "description": "SpaceX's Starship will one day transport human life to other planets.", 
            "title": "SpaceX announces next Starship test flight date - TESLARATI"
        }, 
        {
            "url": "https://www.espn.com/fantasy/baseball/story/_/id/40229139/fantasy-baseball-injury-impact-ten-pickups-replace-ronald-acuna-jr-production", 
            "description": "Here are 10 fantasy baseball pickups to help fantasy managers looking to replace Ronald Acuna Jr.'s production in the lineup.", 
            "title": "Injury impact - 10 pickups to replace Ronald Acuna Jr.'s production - ESPN"
        }, 
        {
            "url": "https://abc30.com/post/passenger-united-flight-fresno-measles-officials-confirm/14878374/", 
            "description": "A passenger on a flight to Fresno was confirmed to be traveling with measles, according to LA County health officials.", 
            "title": "Passenger on United flight to Fresno had measles, officials confirm - KFSN-TV"
        }, 
        {
            "url": "https://ktla.com/entertainment/mike-tyson-suffers-medical-emergency-on-flight-headed-to-los-angeles-reports/", 
            "description": "Mike Tyson suffered a medical emergency on a flight headed to Los Angeles from Miami on Sunday night. “Thankfully Mr. Tyson is doing great,” Tyson’s representatives tell KTLA 5 News. “He became nauseous and dizzy due to an ulcer flare-up 30 minutes before lan…", 
            "title": "Mike Tyson suffers medical emergency on flight headed to Los Angeles - KTLA Los Angeles"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/richard-dreyfuss-slammed-jaws-screening-comments-1235909509/", 
            "description": "The Massachusetts theater that hosted the actor has apologized for his remarks, writing in a statement, \"We deeply regret the distress that this has caused to many of our patrons.“", 
            "title": "Richard Dreyfuss Slammed for Alleged Sexist and Homophobic Comments at ‘Jaws’ Screening - Hollywood Reporter"
        }, 
        {
            "url": "https://apnews.com/article/iaea-iran-nuclear-enrichment-stockpile-2190f0d7247a6160fb13f28304d4b6ad", 
            "description": "A report by the United Nations’ nuclear watchdog says that Iran has further increased its stockpile of uranium enriched to near weapons-grade levels. The confidential report was seen by The Associated Press on Monday. It says Iran now has 142.1 kilograms, or …", 
            "title": "Iran further increases its stockpile of uranium enriched to near weapons-grade levels, watchdog says - The Associated Press"
        }, 
        {
            "url": "https://www.ncaa.com/news/baseball/article/2024-05-27/2024-ncaa-division-i-baseball-championship-bracket-announced", 
            "description": "The NCAA Division I Baseball Committee announced the field of 64 teams competing for the 2024 NCAA Division I Baseball Championship on Monday, May 27.", 
            "title": "2024 NCAA Division I baseball championship bracket announced - NCAA.com"
        }, 
        {
            "url": "https://www.bbc.com/news/uk-politics-69065695", 
            "description": "The Conservatives have given more details of their plan for 30,000 young people to work with the military.", 
            "title": "Rishi Sunak promises allowance for military national service - BBC.com"
        }, 
        {
            "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-27-2024-7b743a848ef8bfbe69a9659a4a5dd047", 
            "description": "Israeli Prime Minister Benjamin Netanyahu acknowledged that a “tragic mistake” was made after an Israeli strike in the southern Gaza city of Rafah set fire to a tent camp housing displaced Palestinians. Local officials say at least 45 people were killed in Su…", 
            "title": "Israel-Hamas war: Netanyahu acknowledges ‘tragic mistake’ in strike on Rafah that killed dozens - The Associated Press"
        }, 
        {
            "url": "https://variety.com/2024/film/box-office/box-office-furiosa-just-barely-beats-garfield-disastrous-memorial-day-weekend-1236017039/", 
            "description": "In a box office nail biter, \"Furiosa: A Mad Max Saga\" emerged victorious over \"The Garfield Movie\" on North American charts.", 
            "title": "Box Office: ‘Furiosa’ Just Barely Beats ‘The Garfield Movie’ in Disastrous Memorial Day Weekend — the Worst in Decades - Variety"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/27/closing-arguments-verdict-trumps-hush-money-trial-entering-final-stretch", 
            "description": "Prosecutors and defence lawyers to deliver closing arguments this week in historic trial against ex-US President Trump.", 
            "title": "Closing arguments, verdict: Trump’s hush money trial entering final stretch - Al Jazeera English"
        }, 
        {
            "url": "https://www.axios.com/2024/05/27/samuel-alito-wife-flag-washington-post-interview", 
            "description": null, 
            "title": "Washington Post sat on Justice Alito upside-down flag interview for years - Axios"
        }, 
        {
            "url": "https://www.cbsnews.com/news/north-korea-second-military-spy-satellite/", 
            "description": "North Korea had earlier notified Japan's coast guard about its plans to launch \"a satellite rocket.\"", 
            "title": "North Korea apparently launches missile into sea after announcing plan to put rocket into orbit with spy satellite - CBS News"
        }
    ], 
    "last_updated": "2024-05-28 22:49:17"
}