{
    "news": [
        {
            "url": "https://nypost.com/2024/05/12/sports/knicks-embarrassed-by-pacers-in-lethargic-game-4-loss-to-tie-series/", 
            "description": "The Knicks absorbed a knockdown blow quickly and never got up.", 
            "title": "Knicks utterly embarrassed by Pacers in lethargic Game 4 loss to tie series - New York Post "
        }, 
        {
            "url": "https://www.reuters.com/world/europe/putin-proposes-sacking-defence-minister-shoigu-parliament-says-2024-05-12/", 
            "description": null, 
            "title": "Putin taps civilian economist to run defense, replacing Shoigu in surprise move - Reuters"
        }, 
        {
            "url": "https://www.espn.com/nba/story/_/page/NBADraft24-40132847/2024-nba-draft-biggest-post-lottery-questions-12-teams-atlanta-hawks-washington-wizards-houston-rockets", 
            "description": "Twelve teams are set with the top 14 lottery picks in June's NBA draft, and our experts weigh in on the biggest topics for each of those teams.", 
            "title": "2024 NBA draft: Biggest post-lottery questions for the 12 teams - ESPN"
        }, 
        {
            "url": "https://www.eonline.com/news/1401437/olivia-munn-shares-she-underwent-a-hysterectomy-amid-cancer-battle", 
            "description": "Olivia Munn revealed in a new interview that in addition to her double mastectomy, she also had a hysterectomy after being diagnosed with breast cancer.", 
            "title": "Olivia Munn Shares She Underwent a Hysterectomy Amid Cancer Battle - E! NEWS"
        }, 
        {
            "url": "https://www.ksl.com/article/51006239/astronomers-finally-detect-a-rocky-planet-with-an-atmosphere", 
            "description": "Astronomers have searched for years for rocky planets beyond our solar system with an atmosphere — a trait considered essential for any possibility of harboring life.", 
            "title": "Astronomers finally detect a rocky planet with an atmosphere - KSL.com"
        }, 
        {
            "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/former-chargers-general-manager-a-j-smith-dies-at-75", 
            "description": "Former Chargers General Manager A.J.", 
            "title": "Former Chargers General Manager A.J. Smith dies at 75 - NBC Sports"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=E2Chww7IpzU", 
            "description": "There has been a lot of debate around the world about ultra-processed food and some studies have suggested it is linked to poor health. But, what exactly is ...", 
            "title": "What is ultra-processed food and what does it mean for your health? | BBC News - BBC News"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/12/ukraines-military-chief-admits-difficult-situation-in-kharkiv-region", 
            "description": "General Syrskii says situation in northeastern oblast ‘significantly worsened’ this week as Russian forces advance.", 
            "title": "Ukraine’s military chief admits ‘difficult situation’ in Kharkiv region - Al Jazeera English"
        }, 
        {
            "url": "https://apnews.com/article/blinken-israel-hamas-gaza-rafah-war-6e0f887bd307f707a05190b33708fe58", 
            "description": "Secretary of State Antony Blinken has delivered some of the Biden administration’s strongest public criticism yet of Israel’s conduct of the war in Gaza. America's top diplomat said in two television interviews that Israeli tactics have meant “a horrible loss…", 
            "title": "Blinken delivers some of the strongest US public criticism of Israel's conduct of the war in Gaza - The Associated Press"
        }, 
        {
            "url": "https://weather.com/news/video/earthquake-rattles-people-awake", 
            "description": "An early morning earthquake rattled people out of bed and onto the streets of Guatemala. Watch this video to see the aftermath. - Videos from The Weather Channel | weather.com", 
            "title": "Earthquake Near Guatemala-Mexico Border - Videos from The Weather Channel - The Weather Channel"
        }, 
        {
            "url": "https://www.boxofficepro.com/weekend-box-office-apes-strong-with-big-planet-wide-debut/", 
            "description": "1. Kingdom of the Planet of the Apes20th Century Studios | NEW$56.5M Domestic Opening Weekend $129M Global Opening Weekend Even after 56 years, Fox's long-running Planet of the Apes franchise continues to endure. The newest entry, Kingdom of the Planet of the…", 
            "title": "Weekend Box Office: APES Strong with $129M Global Debut - Boxoffice - Boxoffice Pro"
        }, 
        {
            "url": "https://variety.com/2024/film/news/ron-howard-tribute-roger-corman-1235999880/", 
            "description": "Director Ron Howard paid tribute to Roger Corman for mentoring a generation of filmmakers and giving opportunities to women in film.", 
            "title": "Ron Howard Remembers Roger Corman’s Mentorship and Impact on Filmmaking: ‘What a Life’ - Variety"
        }, 
        {
            "url": "https://www.reuters.com/world/asia-pacific/taliban-ministry-death-toll-floods-northern-afghanistan-rises-315-2024-05-12/", 
            "description": null, 
            "title": "Afghanistan floods devastate villages, killing 315 - Reuters"
        }, 
        {
            "url": "https://www.foxweather.com/earth-space/northern-lights-us-geomagnetic-storm-sunday", 
            "description": "Millions of people in the U.S. as far south as Alabama could be in for another dazzling display of the Northern Lights on Sunday night as Earth continues to be blasted by a historic geomagnetic storm that hasn’t been experienced in decades.", 
            "title": "Another 'severe and extreme' geomagnetic storm Sunday could bring Northern Lights as far south as Alabama - Fox Weather "
        }, 
        {
            "url": "https://apnews.com/article/uk-cameron-israel-arms-sales-0f686299ae245c0e9edb8461c58eb4d7", 
            "description": "Britain's foreign secretary has said that halting arms exports to Israel is “not a wise path” and would only strengthen Hamas. Asked whether the U.K. would follow the U.S. in threatening to cut the supply of offensive weapons to Israel if it carried out an at…", 
            "title": "UK foreign secretary says halting arms sales to Israel would only strengthen Hamas - The Associated Press"
        }, 
        {
            "url": "https://www.foxnews.com/politics/massive-trump-beach-rally-deep-blue-nj-draws-stark-contrast-bidens-beach-weekend-biden-could-never", 
            "description": "Critics on social media argue President Biden could not pull a massive crowd like former President Trump in Wildwood, New Jersey, as they slam the current president for his beach weekend.", 
            "title": "Massive Trump beach rally in deep blue NJ draws stark contrast to Biden's beach weekend: 'Biden could never' - Fox News"
        }, 
        {
            "url": "https://9to5mac.com/2024/05/12/ipad-pro-thin-redesigned-chassis-structure/", 
            "description": "The new iPad Pro is Apple’s thinnest product ever, with the 13-inch model measuring at just 5.1mm thick (excluding camera...", 
            "title": "Ultra-thin M4 iPad Pro features new internal structure to improve stiffness and heat dissipation - 9to5Mac"
        }, 
        {
            "url": "https://www.marketwatch.com/story/inflation-trap-stock-markets-near-record-run-faces-the-most-crucial-cpi-reading-of-2024-e88374f6", 
            "description": null, 
            "title": "Stock market’s near-record rally faces most crucial inflation reading of 2024 - MarketWatch"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://techcrunch.com/2024/05/12/workers-at-a-maryland-apple-store-authorize-strike/", 
            "description": "It's been a busy weekend for union organizing efforts at U.S. Apple stores, with the union at one store voting to authorize a strike, while workers at", 
            "title": "Workers at a Maryland Apple store authorize strike - TechCrunch"
        }
    ], 
    "last_updated": "2024-05-13 23:46:30"
}