{
    "news": [
        {
            "url": "https://www.nbcnews.com/news/us-news/barge-slams-galveston-bridge-texas-causing-partial-collapse-shutdown-rcna152425", 
            "description": "A barge slammed into a bridge in Galveston on Wednesday, spilling oil into the bay and forcing a shutdown of the Texas span, officials said, in the latest accident involving prominent U.S. thoroughfares.", 
            "title": "Barge slams into Galveston bridge in Texas, causing partial collapse and shutdown - NBC News"
        }, 
        {
            "url": "https://sports.yahoo.com/live/2024-nfl-schedule-release-live-updates-ahead-of-tonights-full-announcement-222736022.html", 
            "description": "Before Wednesday arrives, football fans got some appetizers as some games were formally announced.", 
            "title": "2024 NFL schedule release: Live updates ahead of Wednesday's full announcement - Yahoo Sports"
        }, 
        {
            "url": "https://www.wsj.com/livecoverage/cpi-report-today-inflation-stock-market-05-15-2024", 
            "description": "The consumer-price index for April is out. Follow along for live updates on stocks and other markets, including the Dow Jones Industrial Average, S&P 500 and Nasdaq Composite.", 
            "title": "Stock Market Today: Dow Rises 300 Points After CPI Shows Inflation Eased in April -- Live Updates - The Wall Street Journal"
        }, 
        {
            "url": "http://9to5google.com/2024/05/15/android-boosting-security-with-theft-detection-lock-factory-reset-protection/", 
            "description": "In addition to Private Space, Android at I/O 2024 is really working to boost the mobile operating system’s theft, security,...", 
            "title": "Android boosting security with Theft Detection Lock, factory reset protection - 9to5Google"
        }, 
        {
            "url": "https://techcrunch.com/2024/05/15/google-i-o-2024-everything-announced-so-far/", 
            "description": "Here are quick hits of the biggest news from the Google I/O keynote as they are announced, all in an easy-to-digest, easy-to-skim list.", 
            "title": "Google I/O 2024: Here's everything Google just announced - TechCrunch"
        }, 
        {
            "url": "https://apnews.com/article/2024-election-presidential-debates-biden-trump-6b1d1dbb2ed61c7637041b23662d7da8", 
            "description": "President Joe Biden and former President Donald Trump have agreed to hold two campaign debates, on June 27 hosted by CNN and on Sept. 10 hosted by ABC. CNN says its debate will be held in its Atlanta studios and “no audience will be present.” The Democratic p…", 
            "title": "Biden and Trump agree to 2 presidential debates, in June and in September - The Associated Press"
        }, 
        {
            "url": "https://www.bbc.com/news/science-environment-69012221", 
            "description": "The iconic trees evolved on Madagascar 21 million years ago and later spread to other countries.", 
            "title": "Scientists solve mystery of ancient 'tree of life' - BBC.com"
        }, 
        {
            "url": "https://www.france24.com/en/europe/20240515-what-we-know-about-france-the-fly-and-his-deadly-prison-van-escape", 
            "description": null, 
            "title": "What we know about France's 'The Fly' and his deadly prison van escape - FRANCE 24 English"
        }, 
        {
            "url": "https://variety.com/2024/film/news/megalopolis-francis-ford-coppola-cannes-premiere-controversy-1236004301/", 
            "description": "Francis Ford Coppola prepares to unveil 'Megalopolis,' his 'batshit' epic, at Cannes as bad buzz and controversy mounts.", 
            "title": "Can Cannes Save ‘Megalopolis’? Francis Ford Coppola Prepares to Unveil His $120 Million Epic as Controversy Builds - Variety"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/05/15/statement-from-president-joe-biden-on-attempted-assassination-of-slovakia-prime-minister-robert-fico/", 
            "description": "I am alarmed to hear reports of an attack on Slovak Prime Minister Robert Fico.  Jill and I are praying for a swift recovery, and our thoughts are with his family and the people of Slovakia. We condemn this horrific act of violence. Our embassy is in close to…", 
            "title": "Statement from President Joe Biden on Attempted Assassination of Slovakia Prime Minister Robert Fico - The White House"
        }, 
        {
            "url": "https://www.macrumors.com/2024/05/15/ios-18-accessibility-features-for-carplay/", 
            "description": "Apple today previewed new accessibility features coming with iOS 18 later this year, and this includes some new options for CarPlay.   Apple...", 
            "title": "Apple Previews Three New CarPlay Features Coming With iOS 18 - MacRumors"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjQvMDUvMTUvc3R5bGUvd2VzdG1pbnN0ZXItZG9nLXNob3ctYmVzdC1pbi1zaG93Lmh0bWzSAQA?oc=5", 
            "description": null, 
            "title": "Westminster Dog Show 2024: Unforgettable Dogs Like Sage, Monty and Mercedes - The New York Times"
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-69016219", 
            "description": "Senator Bob Menendez is accused of bribery and trading his influence for gold bars and luxury goods.", 
            "title": "Bob Menendez corruption trial will soon hear opening remarks - BBC.com"
        }, 
        {
            "url": "https://www.espn.com/nfl/story/_/id/40151971/giants-make-hard-knocks-debut-series-1st-offseason-edition", 
            "description": "The Giants are finally going to be on the HBO docuseries \"Hard Knocks\" in the first offseason version of the long-standing franchise.", 
            "title": "Giants to make 'Hard Knocks' debut on series' 1st offseason edition - ESPN"
        }, 
        {
            "url": "https://www.cbsnews.com/news/asia-deadly-heat-wave-india-bangladesh-climate-change/", 
            "description": "Extreme heat is known as a \"silent killer,\" and in some areas across Asia, its intensity would have been impossible without one critical factor, a new study found.", 
            "title": "Asia just had a deadly heat wave, and scientists say it could happen again. Here's what's making it much more likely. - CBS News"
        }, 
        {
            "url": "https://www.npr.org/2024/05/15/1251265727/un-gaza-death-toll-women-children", 
            "description": "Here's a closer look at the United Nations' breakdown of casualties. The overall total of more than 35,000 Palestinians killed since Oct. 7, based on Gaza Health Ministry figures, has not declined.", 
            "title": "Why U.N. lowered Gaza death toll for women and children - NPR"
        }, 
        {
            "url": "https://apnews.com/article/us-israel-arms-gaza-ebe971ca8878ff430ce6458c04151585", 
            "description": "The Biden administration has told key lawmakers it plans to move ahead on a more than $1 billion arms sales to Israel. That's according to three congressional aides who spoke of condition of anonymity to discuss an arms transfer that has not yet been made pub…", 
            "title": "Biden administration is moving ahead on new $1 billion arms sale to Israel, congressional aides say - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/15/world/first-warm-blooded-dinosaurs-scn/index.html", 
            "description": "Dinosaurs were initially cold-blooded, but global warming 180 million years ago may have triggered the evolution of warm-blooded species, a new study found.", 
            "title": "Did dinosaur blood run hot or cold? Both, according to a new study - CNN"
        }, 
        {
            "url": "https://www.etonline.com/sophie-turner-says-she-didnt-know-if-i-was-going-to-make-it-amid-joe-jonas-split-225480", 
            "description": "The 'Game of Thrones' star calls the time after her split from Joe Jonas 'the worst few days of my life.'", 
            "title": "Sophie Turner Says She 'Didn't Know If I Was Going to Make It' Amid Joe Jonas Split - Entertainment Tonight"
        }
    ], 
    "last_updated": "2024-05-16 21:17:02"
}