{
    "news": [
        {
            "url": "https://www.cnn.com/2024/05/22/world/boeing-starliner-crewed-launch-delayed-indefinitely-scn/index.html", 
            "description": "After reporting a helium leak in the spacecraft, NASA has taken the next target date for the highly anticipated launch off the table — without immediately naming a new one.", 
            "title": "Boeing Starliner historic crewed launch delayed again indefinitely - CNN"
        }, 
        {
            "url": "https://www.nbcnews.com/news/us-news/deadly-tornado-devastates-iowa-town-severe-weather-moves-south-rcna153430", 
            "description": "Central Iowa was reeling Wednesday morning after what police described as a \"devastating\" tornado laid waste to rural communities and killed an unknown number of people.", 
            "title": "Deadly tornado devastates Iowa town as severe weather moves east - NBC News"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3Lm5mbC5jb20vbmV3cy9uZmwtcy10b3AtMTAtbW9zdC1jb21wbGV0ZS10ZWFtcy1mb3ItMjAyNC1zZWFzb27SAQA?oc=5", 
            "description": null, 
            "title": "NFL's top 10 most complete teams for 2024 season: 49ers robust; Browns, Jets could contend - NFL.com"
        }, 
        {
            "url": "https://www.cnet.com/tech/mobile/t-mobile-is-raising-prices-on-some-of-its-older-plans-starting-with-your-next-bill/", 
            "description": "Those on older plans can expect a $2 or $5 per line increase, with notifications to affected customers going out on Wednesday.", 
            "title": "T-Mobile Is Raising Prices on Some of Its Older Plans, Starting With Your Next Bill - CNET"
        }, 
        {
            "url": "https://ktla.com/news/local-news/spacex-rocket-loaded-with-spy-satellites-seen-over-downtown-l-a/", 
            "description": "A SpaceX rocket carrying a set of spy satellites for the U.S. government was seen flying over downtown Los Angeles overnight. The Falcon 9 rocket lifted off from Vandenberg Space Force Base in Santa Barbara County around 1 a.m. The launch was part of a Nation…", 
            "title": "SpaceX rocket loaded with spy satellites seen over downtown L.A. - KTLA Los Angeles"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-features/glen-powell-interview-hit-man-movie-texas-move-1235905159/", 
            "description": "The red hot star of ‘Top Gun’ and ‘Anyone But You’ — mentored by Tom Cruise and on every studio wish list — is returning to his native Texas to party with his folks, escape the L.A. fishbowl and finally graduate college. But don’t worry, you’ll still be seein…", 
            "title": "Glen Powell Finally Conquered Hollywood. So Why Is He Leaving? - Hollywood Reporter"
        }, 
        {
            "url": "https://www.cbssports.com/nba/news/how-pacers-tyrese-haliburton-threw-away-game-1-vs-celtics-with-uncharacteristic-turnovers/", 
            "description": "The ball slipped away from the Pacers on Tuesday, and so did the chance for a Game 1 upset", 
            "title": "How Pacers, Tyrese Haliburton threw away Game 1 vs. Celtics with uncharacteristic turnovers - CBS Sports"
        }, 
        {
            "url": "https://www.nascar.com/news-media/2024/05/22/ricky-stenhouse-jr-fined-75k-for-sparking-all-star-brawl-two-crew-members-suspended/", 
            "description": null, 
            "title": "Ricky Stenhouse Jr. fined $75K for sparking All-Star brawl, two crew members suspended - NASCAR"
        }, 
        {
            "url": "https://www.reuters.com/world/uk/uk-pm-sunak-asked-about-summer-election-rumours-says-vote-will-be-second-half-2024-05-22/", 
            "description": null, 
            "title": "Sunak says UK election will be in the second half of the year - Reuters UK"
        }, 
        {
            "url": "https://techcrunch.com/2024/05/22/humane-the-creator-of-the-700-ai-pin-is-reportedly-seeking-a-buyer/", 
            "description": "Humane, the company behind the hyped Ai Pin that launched to less-than-glowing reviews last month, is reportedly on the hunt for a buyer.", 
            "title": "Humane, the creator of the $700 Ai Pin, is reportedly seeking a buyer - TechCrunch"
        }, 
        {
            "url": "https://www.npr.org/sections/health-shots/2024/05/22/1252831827/microplastics-testicles-humans-health", 
            "description": "The new study has scientists concerned that microplastics may be contributing to reproductive health issues.", 
            "title": "Microplastics detected in human testicles, troubling researchers : Shots - Health News - NPR"
        }, 
        {
            "url": "https://www.foxnews.com/entertainment/diddys-ex-heartbroken-cassie-hotel-attack-video-leak-i-know-exactly-how-she-feels", 
            "description": "Sean \"Diddy\" Combs' ex-girlfriend, Misa Hylton, admitted she is \"praying\" for the rapper's help after being triggered by video showing Cassie hotel assault.", 
            "title": "Diddy's ex 'heartbroken' for Cassie after hotel attack video leak: 'I know exactly how she feels' - Fox News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/22/politics/video/biden-trump-unified-reich-post-reax-ctm-sot-digvid", 
            "description": "President Joe Biden weighs in on a video posted by Donald Trump showing images of a fake newspaper article that references a “unified Reich” if he’s reelected in 2024. The video was removed from Trump’s Truth Social account Tuesday morning.", 
            "title": "‘That’s Hitler’s language’: Biden responds to Trump’s ‘unified Reich’ post - CNN"
        }, 
        {
            "url": "https://www.etonline.com/taylor-swift-rips-open-her-dress-on-stage-in-eras-tour-performance-wardrobe-malfunction-225947", 
            "description": "Taylor Swift handled a sound issue like a pro as she performed in Sweden over the weekend.", 
            "title": "Taylor Swift Rips Open Her Dress on Stage in Eras Tour Performance Wardrobe Malfunction - Entertainment Tonight"
        }, 
        {
            "url": "https://abcnews.go.com/International/1-dead-amid-severe-turbulence-singapore-airlines-flight/story?id=110016611", 
            "description": "Singapore Airlines flight SQ 321 was traveling from London to Singapore.", 
            "title": "1 dead, 6 critically injured amid 'severe' turbulence on Singapore Airlines flight, carrier says - ABC News"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/21/stock-market-today-live-updates.html", 
            "description": "U.S. stock futures slipped Wednesday as investors looked ahead to the widely-anticipated release of Nvidia's latest earnings report.", 
            "title": "Stock futures slip as Nvidia earnings loom: Live updates - CNBC"
        }, 
        {
            "url": "https://www.npr.org/2024/05/22/1252736063/buy-now-pay-later-bnpl-returns-federal-rule-cfpb", 
            "description": "The Consumer Financial Protection Bureau is requiring buy-now, pay-later lenders to provide the same protections to shoppers as credit card companies do.", 
            "title": "Buy-now, pay-later refunds get oversight by CFPB, the consumer watchdog agency - NPR"
        }, 
        {
            "url": "https://www.marketwatch.com/story/targets-stock-dives-after-profit-misses-the-mark-amid-weakness-in-sales-of-discretionary-items-5802a931", 
            "description": "Target’s sales weakness contrasts with Walmart’s growth, but Target sells a much higher percentage of discretionary items", 
            "title": "Target’s stock dives after profit misses the mark, as sales fall again - MarketWatch"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LndpcmVkLmNvbS9zdG9yeS9zY2FybGV0dC1qb2hhbnNzb24tdi1vcGVuYWktY291bGQtbG9vay1saWtlLWluLWNvdXJ0L9IBAA?oc=5", 
            "description": null, 
            "title": "What Scarlett Johansson v. OpenAI Could Look Like in Court - WIRED"
        }, 
        {
            "url": "https://www.ajc.com/politics/fulton-da-willis-easily-defeats-primary-challenger/EDRDKE26CZFNPDLWLI7HUDVUOU/", 
            "description": "", 
            "title": "Fulton DA Willis easily defeats primary challenger -  The Atlanta Journal Constitution"
        }
    ], 
    "last_updated": "2024-05-23 17:00:03"
}