{
    "news": [
        {
            "url": "https://www.reuters.com/world/uk/uk-economy-grows-by-06-first-quarter-ons-data-shows-2024-05-10/", 
            "description": null, 
            "title": "UK exits recession with fastest growth in nearly three years - Reuters UK"
        }, 
        {
            "url": "https://www.bbc.com/news/world-middle-east-68980826", 
            "description": "Israeli leader says his country will \"stand alone\" and \"fight with fingernails\" if shipments are halted.", 
            "title": "Gaza war: Netanyahu says Israel can 'stand alone' if US halts arms shipments - BBC.com"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c51n0p14y1lo", 
            "description": "Pasco has recalled 104,000 packs of sliced bread after rat remains were found in its products.", 
            "title": "Pasco: Rat remains found in Japanese bread triggers recall and refunds - BBC.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/09/us/shenandoah-county-confederate-school-names-reaj/index.html", 
            "description": "School board members in Virginia’s Shenandoah County voted early Friday to restore the names of two schools that previously honored Confederate leaders – four years after those names had been removed.", 
            "title": "Virginia school board votes to restore Confederate names to two schools - CNN"
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-68987594", 
            "description": "Madeleine Westerhout tells ex-president's trial that he liked capitals and exclamation marks.", 
            "title": "Trump's former aide tells how he dictated tweets - BBC.com"
        }, 
        {
            "url": "https://wtop.com/dc/2024/05/police-install-fencing-around-former-gw-encampment-say-11-of-33-arrested-identified-themselves-as-students/", 
            "description": "Pro-Palestinian protesters returned to George Washington University on Thursday night and pitched tents on campus.", 
            "title": "Pro-Palestinian protesters disperse after police presence at GWU campus; at least 1 arrested - WTOP"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=UtIhHhh8VN4", 
            "description": "Tune-in to ESPN to watch the NBA Playoffs presented by Google Pixel9:30 PM ET: Dallas Mavericks/Oklahoma City ThunderNever miss a moment with the latest news...", 
            "title": "Dallas Mavericks @ Oklahoma City Thunder | #NBAplayoffs presented by Google Pixel Live Scoreboard - NBA"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=wExNif-GGXo", 
            "description": null, 
            "title": "Jayson Tatum on Game 2 Loss to Cavs: 'The world thinks we're never supposed to lose' - Bleacher Report"
        }, 
        {
            "url": "https://www.axios.com/2024/05/10/severe-solar-storm-northern-lights", 
            "description": null, 
            "title": "\"Severe\" solar storm could bring Northern Lights to U.S. this weekend - Axios"
        }, 
        {
            "url": "https://9to5mac.com/2024/05/09/controversial-ipad-pro-crush-ad-lg/", 
            "description": "During its “Let Loose” event on Tuesday, Apple introduced the new M4 iPad Pro. However, the product was unveiled with...", 
            "title": "Controversial new iPad Pro ad might have been inspired by LG ad - 9to5Mac"
        }, 
        {
            "url": "https://thehill.com/regulation/court-battles/4655381-stormy-daniels-trolls-trump-after-testifying-in-hush-money-trial/", 
            "description": null, 
            "title": "Stormy Daniels trolls Trump after testifying in hush money trial - The Hill"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/09/us/roger-forston-florida-airman-shot/index.html", 
            "description": "A Florida sheriff’s office publicly released bodycam footage from a deputy who fatally shot a Black airman in his home last week, and disputed claims from the victim’s family that the deputy had gone to the wrong apartment.", 
            "title": "Florida sheriff releases bodycam video of airman fatally shot in apartment, disputes family’s claim deputy went to wrong unit - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/10/tech/cyberattack-ascension-ambulances-hospitals/index.html", 
            "description": "A major US health care system said Thursday that it is diverting ambulances from “several” of its hospitals following a cyberattack this week.", 
            "title": "Cyberattack forces major US health care network to divert ambulances from hospitals - CNN"
        }, 
        {
            "url": "https://www.tmz.com/2024/05/09/drake-toronto-home-house-another-trespasser-second-one-after-shooting/", 
            "description": "Drake's security is working overtime ... because TMZ has learned a person allegedly tried to get into his home yet again this week -- the second such instance since the shooting.", 
            "title": "Drake's Toronto Home Visited By Yet Another Alleged Attempted Trespasser - TMZ"
        }, 
        {
            "url": "http://9to5google.com/2024/05/09/open-ai-google-search-report/", 
            "description": "According to a new report, OpenAI plans to launch its Google Search competitor on May 13, the day before Google I/O.", 
            "title": "Report: OpenAI to launch its AI-powered search engine a day before Google I/O - 9to5Google"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/09/trump-stormy-daniels-trial-testimony-00157192", 
            "description": null, 
            "title": "An angry Trump gathers allies to push against Stormy Daniels - POLITICO"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/09/health/bird-flu-cows-human-receptors/index.html", 
            "description": "Cows have the same kinds of gateways into their cells as humans and birds, a new study shows. The finding suggests that cows could be mixing bowls - hosts that could help H5N1 bird flu learn to spread in humans.", 
            "title": "Cows have human flu receptors, study shows, raising stakes on bird flu outbreak in dairy cattle - CNN"
        }, 
        {
            "url": "https://www.washingtonpost.com/sports/2024/05/09/patrick-beverley-suspended/", 
            "description": "Patrick Beverley threw a ball at fans, rebuffed reporter during and after the Milwaukee Bucks’ season-ending loss", 
            "title": "Patrick Beverley suspended four games for viral incidents - The Washington Post"
        }, 
        {
            "url": "https://www.newsweek.com/nato-country-leader-endorses-chinas-peace-plan-russia-ukraine-war-1899102", 
            "description": "Hungary's prime minister criticized other European leaders for being \"on the side of war.\"", 
            "title": "NATO Country Leader Endorses China's Peace Plan for Russia-Ukraine War - Newsweek"
        }, 
        {
            "url": "https://www.sfchronicle.com/health/article/flirt-variants-summer-covid-wave-19445209.php", 
            "description": "The FLiRT coronavirus variants, KP.1.1 and KP.2, have recently overtaken JN.1 as the dominant omicron offshoot in the U.S. Here’s what you need to know.", 
            "title": "New FLiRT variants could spark summer COVID wave in California - San Francisco Chronicle"
        }
    ], 
    "last_updated": "2024-05-11 12:08:57"
}