{
    "news": [
        {
            "url": "https://apnews.com/article/israel-hamas-war-gaza-aid-us-pier-9414c4148285917f1c858b9590117a84", 
            "description": "The Pentagon says that humanitarian aid will soon begin flowing onto the Gaza shore through the new pier that was anchored to the beach overnight and will reach those in need almost immediately. Trucks will drive the aid into the Palestinian enclave, besieged…", 
            "title": "Israel-Hamas war: US military finishes construction of floating pier for Gaza Strip - The Associated Press"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/francis-ford-coppola-megalopolis-1235900890/", 
            "description": "The legendary filmmaker, 85, last had a film in competition at the fest 45 years ago — 'Apocalypse Now,' for which he was awarded the Palme d'Or for the second time, five years after 'The Conversation' won it.", 
            "title": "Cannes: Francis Ford Coppola's Much-Discussed 'Megalopolis' Receives 10-Minute Standing Ovation - Hollywood Reporter"
        }, 
        {
            "url": "https://apnews.com/article/army-sergeant-murder-parole-black-lives-matter-4b1d0c54b0de451642bcf1e8cd75a7e5", 
            "description": "Texas Gov. Greg Abbott has issued a full pardon to a former U.S. Army sergeant convicted of murder for fatally shooting an armed demonstrator in 2020 during nationwide protests against racial injustice. Abbott had previously ordered the board to review Daniel…", 
            "title": "Texas board recommends pardon for ex-Army sergeant convicted of killing Black Lives Matter protester - The Associated Press"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/16/24158365/quantum-computing-network-aws-amazon-harvard", 
            "description": "Amazon’s AWS partnered with Harvard to test how far a quantum entangled photon could travel. It traveled 35 kilometers under the Boston area.", 
            "title": "Quantum networks are closer to reality - The Verge"
        }, 
        {
            "url": "https://www.bbc.com/news/world-europe-69019121", 
            "description": "Robert Fico's condition is still \"very serious\" after he was shot several times on Wednesday.", 
            "title": "Slovakia PM Robert Fico in stable but serious condition after shooting, doctors say - BBC.com"
        }, 
        {
            "url": "https://variety.com/2024/tv/news/shogun-season-2-development-fx-hulu-1235999171/", 
            "description": "FX, Hulu, and the James Clavell estate are working to develop potentially two more seasons of the critically acclaimed series \"Shogun\"", 
            "title": "‘Shogun’: FX Developing Two New Seasons With Estate of Original Author James Clavell - Variety"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c3g9g63jl17o", 
            "description": "The ICJ ruling has come under intense scrutiny, centring on the word \"plausible\". What did the court mean?", 
            "title": "Israel-Gaza: What did the ICJ ruling really say? - BBC.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/16/politics/house-panels-contempt-garland-biden-audio/index.html", 
            "description": "The House Judiciary Committee voted on Thursday to advance contempt proceedings against Attorney General Merrick Garland for his refusal to turn over audio recordings of President Joe Biden’s interview with special counsel Robert Hur.", 
            "title": "House Judiciary committee votes to advance contempt proceedings against Garland over Biden audio files - CNN"
        }, 
        {
            "url": "https://www.foxnews.com/politics/johnson-rebukes-biden-schumer-blocked-israel-aid-house-votes-force-bomb-deliveries", 
            "description": "Speaker Mike Johnson, R-La., accused President Biden of \"using his authority to defend himself politically\" rather than defend Israel ahead of a House vote.", 
            "title": "Johnson rebukes Biden, Schumer over blocked Israel aid as House votes to force bomb deliveries - Fox News"
        }, 
        {
            "url": "https://www.newsnationnow.com/entertainment-news/jennifer-lopez-ben-affleck-not-divorcing-insiders/", 
            "description": "As they say, where there’s smoke, there’s fire – but, at least with Ben Affleck and Jennifer Lopez, that’s not the case… yet.", 
            "title": "Jennifer Lopez and Ben Affleck not speaking to divorce attorneys: Insiders - NewsNation Now"
        }, 
        {
            "url": "https://www.washingtonpost.com/climate-environment/2024/05/16/coal-leasing-powder-river-basin-climate/", 
            "description": "The Biden administration’s decision ends new leasing in the Powder River Basin in Wyoming and Montana, the nation’s biggest coal-producing region.", 
            "title": "U.S. to end coal leasing in nation's largest coal-producing region - The Washington Post"
        }, 
        {
            "url": "https://www.cbsnews.com/news/nadine-menendez-bob-menendez-wife-corruption-trial-allegations/", 
            "description": "New Jersey Sen. Bob Menendez may argue his wife kept him in the dark about her dealings with three businessmen.", 
            "title": "Who is Nadine Menendez? Sen. Bob Menendez's wife is at center of corruption allegations - CBS News"
        }, 
        {
            "url": "https://techcrunch.com/2024/05/16/microsofts-custom-cobalt-chips-will-come-to-azure-next-week/", 
            "description": "Microsoft will launch its custom Cobalt 100 chips to customers as a public preview at its Build conference next week, TechCrunch has learned. In an", 
            "title": "EXCLUSIVE: Microsoft's custom Cobalt chips will come to Azure next week - TechCrunch"
        }, 
        {
            "url": "https://markets.businessinsider.com/news/stocks/gamestop-keith-gill-roaring-kitty-memes-stocks-gme-reddit-2024-5", 
            "description": "Questions about who is behind the @TheRoaringKitty X account were sparked by a tweet on Monday that claimed Keith Gill had sold his account.", 
            "title": "GameStop Stock: Reddit Users Question If Roaring Kitty Is Really Behind Memes - Markets Insider"
        }, 
        {
            "url": "https://finance.yahoo.com/news/israeli-cabinet-rifts-over-gaza-171533335.html", 
            "description": "Israeli government splits over the war in Gaza broke open this week, after the Defence Minister publicly demanded a clear strategy from Prime Minister...", 
            "title": "Israeli cabinet rifts over Gaza break out into the open - Yahoo Finance"
        }, 
        {
            "url": "https://bleacherreport.com/articles/10121324-bronny-james-rumors-jazz-eye-lebrons-son-amid-lakers-knicks-cavs-nba-draft-buzz", 
            "description": "The Utah Jazz are reportedly interested in selecting Bronny James with the 32nd overall pick in the upcoming NBA draft, according to Krysten Peek of Yahoo…", 
            "title": "Bronny James Rumors: Jazz Eye LeBron's Son amid Lakers, Knicks, Cavs NBA Draft Buzz - Bleacher Report"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://sports.yahoo.com/ranking-nfls-15-best-grudge-matches-from-russell-wilson-vs-sean-payton-to-the-harbaugh-brothers-051815181.html", 
            "description": "From discarded players to discarded coaches, playoff pain to good old regular-season heartbreak, the grudge-match lineup is deep this season.", 
            "title": "Ranking NFL's 15 best grudge matches from Russell Wilson vs. Sean Payton to the Harbaugh brothers - Yahoo Sports"
        }, 
        {
            "url": "https://www.cbssports.com/golf/news/2024-pga-championship-leaderboard-live-coverage-tiger-woods-score-golf-scores-today-in-round-1-at-valhalla/live/", 
            "description": "Live scores, updates and highlights from the first round of action at the 106th PGA Championship", 
            "title": "2024 PGA Championship leaderboard: Live coverage, Tiger Woods score, golf scores today in Round 1 at Valhalla - CBS Sports"
        }, 
        {
            "url": "https://futurism.com/nasa-concerned-billionaire-space-hubble", 
            "description": "Billionaire and private astronaut Jared Isaacman is willing to foot the bill of a maintenance mission to NASA's Hubble telescope.", 
            "title": "NASA Experts Concerned Billionaire Space Tourist Will Accidentally Break Hubble Space Telescope While Trying to Fix It - Futurism"
        }
    ], 
    "last_updated": "2024-05-17 23:00:31"
}