{
    "news": [
        {
            "url": "https://www.cbsnews.com/news/nancy-pelosi-paul-pelosi-victim-statement-david-depape/", 
            "description": "David DePape, convicted of trying to kidnap Pelosi and attacking her husband with a hammer in October 2022, was sentenced Friday to 30 years in prison.", 
            "title": "Nancy Pelosi asks for \"very long\" sentence for David DePape, who attacked husband Paul Pelosi with hammer - CBS News"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/16/stock-market-today-live-updates.html", 
            "description": "The Dow briefly crossed 40,000 for the first time on Thursday.", 
            "title": "Dow rises, nears 40,000 again and heads for five-week advance: Live updates - CNBC"
        }, 
        {
            "url": "https://www.nbcnews.com/news/us-news/trails-carolina-wilderness-camp-boy-died-license-revoked-rcna146296", 
            "description": "Trails Carolina, a wilderness camp for troubled adolescents where a 12-year-old boy died in February, is losing its license.", 
            "title": "North Carolina will revoke license of wilderness camp where boy died - NBC News"
        }, 
        {
            "url": "https://apnews.com/article/israel-hamas-war-gaza-hostages-shani-louk-a37e4fd656b46be36c4c659a9c2aac7d", 
            "description": "The Israeli military says its troops in Gaza found the bodies of three Israeli hostages killed by Hamas in its Oct. 7 attack, including German-Israeli Shani Louk. A photo of Louk’s twisted body in the back of a pickup truck ricocheted around the world, bringi…", 
            "title": "Israeli military finds bodies of 3 hostages in Gaza, including Shani Louk - The Associated Press"
        }, 
        {
            "url": "https://www.cbsnews.com/news/covid-likely-growing-states-cdc-estimates/", 
            "description": "Health authorities are watching for signs the virus might be starting to accelerate again after a springtime lull in COVID rates.", 
            "title": "COVID \"likely growing\" in D.C. and 12 states, CDC estimates - CBS News"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy9hcnRpY2xlcy9jcDNnOGtsOGRkNW_SATJodHRwczovL3d3dy5iYmMuY29tL25ld3MvYXJ0aWNsZXMvY3AzZzhrbDhkZDVvLmFtcA?oc=5", 
            "description": null, 
            "title": "Rouen: Man shot dead after French synagogue set on fire - BBC.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/17/entertainment/sean-combs-cassie-ventura/index.html", 
            "description": "A 2016 surveillance video obtained exclusively by CNN shows Sean “Diddy” Combs grab, shove, drag and kick his then-girlfriend Cassie Ventura during an altercation that matches allegations in a now-settled federal lawsuit filed by Ventura in November.", 
            "title": "Exclusive: Sean ‘Diddy’ Combs seen physically assaulting Cassie Ventura in 2016 surveillance video obtained by CNN - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/17/investing/boeing-shareholders-vote-to-approve-usd33-million-ceo-pay-package/index.html", 
            "description": "Shareholders of embattled airplane maker Boeing have approved a pay package of nearly $33 million for outgoing CEO Dave Calhoun.", 
            "title": "Boeing shareholders vote to approve $33 million CEO pay package - CNN"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/17/campus-protests-on-gaza-call-for-schools-to-divest-from-israelhow-it-would-work.html", 
            "description": "Protesters on campuses nationwide have called on universities to divest from Israel due to the war in Gaza. Here's how divestment would actually work.", 
            "title": "Campus protests have called for schools to divest from Israel. Here's how that would actually work - CNBC"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/17/sport/scottie-scheffler-detained/index.html", 
            "description": "World No. 1 golfer Scottie Scheffler was arrested and charged with a felony and other counts Friday morning outside the PGA Championship in Louisville, Kentucky, after allegedly injuring a police officer while trying to drive around the scene of a fatal crash.", 
            "title": "Scottie Scheffler arrested in alleged assault on police officer outside PGA Championship, then returns to play - CNN"
        }, 
        {
            "url": "https://www.npr.org/2024/05/17/1252095266/rafah-is-running-out-of-food-even-as-the-u-s-pier-starts-operating-in-gaza", 
            "description": "The first trucks of aid entered Gaza via a pier built by the U.S. But it's challenging to move aid around Gaza, and humanitarian groups operating in Rafah warn they don't have food to distribute.", 
            "title": "Rafah is running out of food, even as the U.S. pier starts operating in Gaza - NPR"
        }, 
        {
            "url": "https://nypost.com/2024/05/17/entertainment/what-ben-affleck-refused-to-do-in-jennifer-lopez-marriage-before-split-rumors/", 
            "description": "Amid the rumors that Ben Affleck  and Jennifer Lopez are on the rocks, a Prime Video documentary covers how Affleck had one demand when they rekindled their romance.", 
            "title": "What Ben Affleck refused to do in Jennifer Lopez marriage before split rumors - New York Post "
        }, 
        {
            "url": "https://abcnews.go.com/Politics/photo-upside-flag-supreme-court-justice-samuel-alitos/story?id=110339877", 
            "description": "Sen. Dick Durbin called on Alito to recuse himself from election 2020 cases.", 
            "title": "Photo of upside-down flag at Supreme Court Justice Samuel Alito's house raises concerns: Report - ABC News"
        }, 
        {
            "url": "https://techcrunch.com/2024/05/17/slack-under-attack-over-sneaky-ai-training-policy/", 
            "description": "Slack is making it difficult for its customers if they want the company to stop using its data for model training.", 
            "title": "Slack under attack over sneaky AI training policy - TechCrunch"
        }, 
        {
            "url": "https://www.reuters.com/world/europe/russias-tuapse-oil-refinery-halted-after-ukrainian-drone-attack-sources-say-2024-05-17/", 
            "description": null, 
            "title": "Russia's Tuapse oil refinery halted after Ukrainian drone attack, sources say - Reuters"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=lIyyg6VoOE8", 
            "description": "On First Take, Stephen A. Smith, Monica McNutt and Tim Legler react to the Minnesota Timberwolves forcing a Game 7 after 115-70 blowout win in Game 6.#firstt...", 
            "title": "JOKIC IS COMING! 🗣️ - Stephen A. WARNS Anthony Edwards ahead of Game 7 👀 | First Take - ESPN"
        }, 
        {
            "url": "https://www.macrumors.com/2024/05/17/m4-ipad-pro-teardown/", 
            "description": "YouTube channel Phone Repair Guru has shared a teardown video for the new 13-inch iPad Pro with the M4 chip, providing a first look at the...", 
            "title": "New iPad Pro Teardown Reveals Internal Design Changes, Including Apple Logo With Copper - MacRumors"
        }, 
        {
            "url": "https://www.ign.com/articles/young-sheldon-iain-armitage-bids-farewell-show-ends-7-seasons", 
            "description": "Young Sheldon star Iain Armitage has shared a heartfelt Instagram post marking the end of the series and his run as the show's titular boy genius.", 
            "title": "Young Sheldon Actor Iain Armitage Bids Farewell as Show Ends After 7 Seasons - IGN"
        }, 
        {
            "url": "https://www.livescience.com/planet-earth/plants/bizarre-evolutionary-roots-of-africas-iconic-upside-down-baobab-trees-revealed", 
            "description": "The baobab tree evolved on the island of Madagascar before eventually spreading to Africa and Australia, new research suggests.", 
            "title": "Bizarre evolutionary roots of Africa's iconic upside-down baobab trees revealed - Livescience.com"
        }
    ], 
    "last_updated": "2024-05-18 21:30:23"
}