{
    "news": [
        {
            "url": "https://www.washingtonpost.com/business/2024/05/22/live-nation-doj-antitrust/", 
            "description": "Live Nation is the parent company of Ticketmaster and also owns concert venues and promotes shows.", 
            "title": "DOJ to announce antitrust lawsuit against Live Nation as soon as Thursday - The Washington Post"
        }, 
        {
            "url": "https://sports.yahoo.com/mvp-nikola-jokic-headlines-all-nba-teams-alongside-shai-gilgeous-alexander-luka-doncic-235645290.html", 
            "description": "The All-NBA selection was the sixth for Jokić, who was awarded his third MVP trophy in four seasons on May 8.", 
            "title": "MVP Nikola Jokić headlines All-NBA teams alongside Shai Gilgeous-Alexander, Luka Dončić - Yahoo Sports"
        }, 
        {
            "url": "https://www.cbsnews.com/news/graceland-sale-halted-judge-tennessee-elvis-presley-granddaughter-alleges-fraud/", 
            "description": "A company claimed Elvis Presley's estate failed to repay a loan that used the Graceland property as collateral.", 
            "title": "Graceland sale halted by judge in Tennessee after Elvis Presley's granddaughter alleges fraud - CBS News"
        }, 
        {
            "url": "https://www.cbsnews.com/news/ireland-spain-norway-recognizing-palestinian-state/", 
            "description": "Ireland, Spain and Norway are recognizing a Palestinian state, the three announced in rapid succession. The move will take effect May 28.", 
            "title": "Ireland, Spain and Norway recognizing a Palestinian state - CBS News"
        }, 
        {
            "url": "https://www.foxbusiness.com/economy/sheer-terror-passengers-singapore-airlines-flight-describe-nightmare-after-plane-hit-severe-turbulence", 
            "description": "Passengers on the Singapore Airlines flight that descended sharply after encountering severe turbulence described the “sheer terror\" of the aircraft \"shuddering\" midair.", 
            "title": "Passengers describe 'sheer terror' after Singapore-bound flight hits turbulence - Fox Business"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cgrr70zm41mo", 
            "description": "A clash with the actor has echoes of the macho tech giants of the past, says Zoe Kleinman.", 
            "title": "Scarlett Johansson's AI row has echoes of Silicon Valley's bad old days - BBC.com"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/22/stock-market-today-live-updates.html", 
            "description": "Stocks are coming off a losing session Wednesday, and Wall Street is assessing the latest quarterly results from market bellwether Nvidia.", 
            "title": "Nasdaq 100 futures rise after Nvidia posts quarterly earnings beat: Live updates - CNBC"
        }, 
        {
            "url": "https://www.desmoinesregister.com/story/weather/2024/05/22/iowa-may-21-tornado-ratings-ef-scale-greenfield-nevada/73804505007/", 
            "description": "National Weather Service teams are conducting surveys Wednesday after tornadoes hit Iowa. An initial survey showed at least EF3 damage in Greenfield.", 
            "title": "Two tornadoes confirmed in Iowa: EF3 in Greenfield, EF2 in Johnston - Des Moines Register"
        }, 
        {
            "url": "https://www.startribune.com/timberwolves-mavericks-western-conference-playoffs-target-center-game-one/600367978/", 
            "description": "The Wolves knocked off the Suns in four and the Nuggets in seven to get within a step of the NBA Finals.", 
            "title": "Live from Game 1: Timberwolves, Mavericks meet at Target Center in opener of Western Conference finals - Star Tribune"
        }, 
        {
            "url": "https://apnews.com/article/supreme-court-flag-stop-steal-alito-trump-1842c40b833637c981c59c3f39bc4669", 
            "description": "A second flag of a type carried by rioters during the attack on the U.S. Capitol on Jan. 6, 2021, was displayed outside a house owned by Supreme Court Justice Samuel Alito. That's according to a report published Wednesday by The New York Times. An “Appeal to …", 
            "title": "Second flag carried by Jan. 6 rioters displayed outside house owned by Justice Alito, report says - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/22/politics/nikki-haley-donald-trump/index.html", 
            "description": "Former South Carolina Gov. Nikki Haley is supporting former President Donald Trump’s 2024 bid, she said Wednesday in her first public remarks since exiting the Republican presidential primary more than two months ago.", 
            "title": "Nikki Haley says she’s voting for Trump in November - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/22/world/sun-magnetic-field-scn/index.html", 
            "description": "The sun’s powerful magnetic field has long puzzled scientists. A new study suggests the source of its magnetic field is nearer the surface than first thought.", 
            "title": "Scientists say they’ve found where the sun’s magnetic field originates - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/22/health/ultraprocessed-food-stroke-cognitive-decline-wellness/index.html", 
            "description": "Ultraprocessed foods have been linked to poor health and early death. A new study bolsters those findings by showing a link to stroke and cognitive decline.", 
            "title": "Healthy diets with only 10% ultraprocessed foods may raise risk of cognitive decline, stroke - CNN"
        }, 
        {
            "url": "https://abcnews.go.com/US/garbage-argument-classified-docs-hearing-gets-heated-charges/story?id=110467763", 
            "description": "Nauta is accused of obstructing the government's classified documents probe.", 
            "title": "'Garbage argument': Classified docs hearing gets heated over charges against Trump co-defendant Walt Nauta - ABC News"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=Ev5eS8fsosM", 
            "description": "NBA Today’s Malika Andrews, Chiney Ogwumike, Kendrick Perkins and Richard Jefferson debate what the Boston Celtics Game 1 OT win over the Indiana Pacers prov...", 
            "title": "The Celtics WERE NOT PREPARED for the Pacers! – Perk reacts to Game 1 of the ECF | NBA Today - ESPN"
        }, 
        {
            "url": "https://www.nbcnews.com/business/consumer/target-mcdonalds-others-are-offering-value-lose-ground-bargain-hunters-rcna153584", 
            "description": "Target’s weak quarterly earnings underscored why it cut prices on thousands of household staples: it’s struggling to win over bargain hunters.", 
            "title": "Target, McDonald's and others are offering value as they lose ground with bargain hunters - NBC News"
        }, 
        {
            "url": "https://www.yahoo.com/entertainment/jennifer-lopez-ben-affleck-living-191628295.html", 
            "description": "A source confirms to Fox News Digital that Ben Affleck and Jennifer Lopez are living separately, nearly two years after tying the knot.", 
            "title": "Jennifer Lopez, Ben Affleck living separately as 'whirlwind of love' is over and 'real life' sets in: source - Yahoo Entertainment"
        }, 
        {
            "url": "https://www.usatoday.com/story/money/food/2024/05/22/red-lobster-closings-full-list/73802650007/", 
            "description": "Red Lobster's website lists 99 restaurant locations as closed. Here's a full list, including a state-by-state breakdown, of closed locations.", 
            "title": "Red Lobster location closures: See full list of 99 closed restaurants - USA TODAY"
        }, 
        {
            "url": "https://thehill.com/policy/healthcare/4679900-fish-oil-may-increase-risk-of-stroke-heart-conditions-study/", 
            "description": "Fish oil may increase the risk of stroke and heart conditions like atrial fibrillation, a new study found. The study, published Tuesday in the journal BMJ Medicine, followed more than 400,000 people in the United Kingdom aged 40 to 69 for 12 years. Those peop…", 
            "title": "Fish oil may increase risk of stroke, heart conditions: Study - The Hill"
        }
    ], 
    "last_updated": "2024-05-24 04:00:55"
}