{
    "news": [
        {
            "url": "https://www.cnbc.com/2024/05/13/stock-market-today-live-updates.html", 
            "description": "Traders reacted to Aprils producer price index reading, which was released on Tuesday morning.", 
            "title": "Stock futures fall after hotter-than-expected producer price report: Live updates - CNBC"
        }, 
        {
            "url": "https://www.cbsnews.com/news/amc-blackberry-gamestop-meme-stocks-roaring-kitty-wallstreetbets/", 
            "description": null, 
            "title": "AMC, BlackBerry shares surge along with GameStop. Here's why meme stocks are back. - CBS News"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ob21lLWRlcG90LWVhcm5pbmdzLXNob3ctc2lnbnMtb2YtYS1jb25zdW1lci1wdWxsYmFjay0xMjA3MDM4OTAuaHRtbNIBAA?oc=5", 
            "description": null, 
            "title": "Home Depot earnings show signs of a consumer pullback - Yahoo Finance"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/14/is-russias-new-defence-minister-more-bad-news-for-ukraine", 
            "description": "Analysts predict Andrei Belousov will boost Russia’s military-industrial complex as Kyiv’s forces struggle on the front.", 
            "title": "Russia’s defence rejig: ‘Unfortunately for Ukraine, a very effective move’ - Al Jazeera English"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/14/sport/lebron-james-courtside-cleveland-cavaliers-boston-celtics-spt-intl/index.html", 
            "description": "LeBron James sat courtside for the Cleveland Cavaliers’ 102-109 defeat to the Boston Celtics in Game 4 of the Eastern Conference semifinals on Monday.", 
            "title": "LeBron James courtside for Cleveland Cavaliers defeat to Boston Celtics - CNN"
        }, 
        {
            "url": "https://www.tomsguide.com/news/live/google-io-2024-keynote", 
            "description": "Get all the latest news from Google I/O", 
            "title": "Google I/O 2024 live blog — all the Gemini AI and Android 15 news as it happens - Tom's Guide"
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-69004872", 
            "description": "In court, Michael Cohen also said Trump had warned 'a lot of women' would make claims against him.", 
            "title": "Ex-lawyer Michael Cohen says he paid hush money at Trump's direction - BBC.com"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=ied2AkpfswI", 
            "description": null, 
            "title": "OpenAI's new version of Chat-GPT can teach maths and flirt | BBC News - BBC News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/14/china/xi-putin-china-summit-intl-hnk/index.html", 
            "description": "Chinese leader Xi Jinping will welcome Vladimir Putin to China this week for the Russian President’s second visit in less than a year – the latest sign of their growing alignment amid hardening global fault lines as conflict devastates Gaza and Ukraine.", 
            "title": "Putin to meet Xi in Beijing as world convulses from global conflicts - CNN"
        }, 
        {
            "url": "https://apnews.com/article/india-mumbai-rains-billboard-collapse-deaths-3e370788d5071f65f9a1c0f7e88ae3da", 
            "description": "A large billboard that collapsed amid raging thunderstorms in Mumbai killed at least 14 people and injured 75 others, reports said on Tuesday. A rescue operation was ongoing Tuesday morning, and authorities told the Press Trust of India news agency that 89 pe…", 
            "title": "Mumbai Billboard collapse: At least 14 killed, 74 injured - The Associated Press"
        }, 
        {
            "url": "https://nypost.com/2024/05/14/entertainment/kelly-clarkson-admits-to-using-weight-loss-drug-after-losing-60-pounds/", 
            "description": "While the “American Idol” alum didn’t disclose the name of the weight loss drug she’s been taking, she insisted it was not Ozempic.", 
            "title": "Kelly Clarkson admits to using weight loss drug after losing 60 pounds - New York Post "
        }, 
        {
            "url": "https://wccftech.com/m4-ipad-pro-models-worse-battery-life-than-m1-mini-led-version/", 
            "description": "An early battery life test of the M4 iPad Pro models reveals that the latest tablets have reduced runtime compared to earlier iterations", 
            "title": "Apple’s Latest M4 iPad Pro Models Have Worse Battery Life Than The M1 mini-LED Version In Early Runtime Tests, Despite Switching To OLED Technology - Wccftech"
        }, 
        {
            "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/wegovy-weight-loss-sustained-four-years-trial-novo-nordisk-says-2024-05-13/", 
            "description": "Patients taking Novo Nordisk's Wegovy obesity treatment maintained an average of 10% weight loss after four years, potentially boosting the drugmaker's case to insurers and governments to cover the cost of the effective but expensive drug.", 
            "title": "Wegovy weight loss sustained for four years in trial, Novo Nordisk says - Reuters"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c88zz55p5q7o", 
            "description": "The announcement comes after Anglo American rejected a £34bn takeover bid from rival BHP.", 
            "title": "UK mining giant Anglo American to offload De Beers diamond firm - BBC.com"
        }, 
        {
            "url": "https://www.bbc.com/news/world-europe-69007465", 
            "description": "The bill targets civil society organisations and independent media that receive foreign funding.", 
            "title": "Georgia to vote on controversial law that sparked mass protests - BBC.com"
        }, 
        {
            "url": "https://www.foxnews.com/world/blinken-makes-unannounced-diplomatic-trip-ukraine-after-congress-approves-military-aid", 
            "description": "U.S. Secretary of State Antony Blinken took off from the Andrews Air Force Base in Maryland on Monday and took an unannounced trip to Ukraine, landing on Tuesday local time.", 
            "title": "Blinken makes unannounced diplomatic trip to Ukraine after Congress approves $60B in military aid - Fox News"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LnJldXRlcnMuY29tL3dvcmxkL3VrL3VrLWJ1aWxkLXNpeC1uZXctd2Fyc2hpcHMtcm95YWwtbWFyaW5lcy0yMDI0LTA1LTE0L9IBAA?oc=5", 
            "description": null, 
            "title": "UK confirms it will build six new warships for Royal Marines - Reuters UK"
        }, 
        {
            "url": "https://www.espn.com/nba/story/_/id/40143162/thunder-rally-mavs-final-minutes-even-series", 
            "description": "In \"probably the most meaningful game I've played in my career,\" Thunder superstar Shai Gilgeous-Alexander took over down the stretch to lead Oklahoma City to a series-tying Game 4 win in Dallas on Monday night.", 
            "title": "Shai Gilgeous-Alexander rallies Thunder to Game 4 win vs. Mavs - ESPN"
        }, 
        {
            "url": "https://apnews.com/article/westminster-kennel-club-dog-show-5f3a2f287021645f84fb437ef9419a54", 
            "description": "The 148th Westminster Kennel Club dog show is underway. Monday marked the start of the traditional judging that leads to the best in show prize, to be awarded Tuesday night at the USTA Billie Jean King National Tennis Center in New York. Semifinals began Mond…", 
            "title": "At Westminster dog show, a display of dogs and devotion - The Associated Press"
        }
    ], 
    "last_updated": "2024-05-15 16:38:00"
}