{
    "news": [
        {
            "url": "https://nypost.com/2024/05/19/world-news/meteor-lights-up-sky-bright-blue-over-spain-portugal/", 
            "description": "The celestial object was seen streaking across the atmosphere, illuminating the clouds with a bright neon blue color for about 7 seconds.", 
            "title": "Meteor lights up sky bright blue over Spain, Portugal - New York Post "
        }, 
        {
            "url": "http://9to5google.com/2024/05/19/android-on-device-ai/", 
            "description": "On-device AI is a big priority for Android going forward, and Google shared more developer resources at I/O 2024...", 
            "title": "Google on what on-device AI is good at, more Android apps that use Gemini Nano coming - 9to5Google"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/19/trump-vaccine-rfk-jr-00158743", 
            "description": null, 
            "title": "Trump amps up his vaccine rhetoric, guarding against RFK Jr. - POLITICO"
        }, 
        {
            "url": "https://www.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-05-19-24/index.html", 
            "description": "Gaza faces a \"dire\" food situation as barely more than 300 aid trucks have entered the strip since Israel began its offensive in Rafah, a UN agency said in a report published Friday. Follow live updates.", 
            "title": "Devastation in Gaza as Israel wages war on Hamas: Live updates - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/19/politics/biden-morehouse-commencement/index.html", 
            "description": "President Joe Biden on Sunday delivers his first commencement address of the 2024 season at Morehouse College, where the president may for the first time in months have to confront the angst that’s been percolating on college campuses nationwide toward his ad…", 
            "title": "Biden to deliver commencement at Morehouse College amid campus division over his presence - CNN"
        }, 
        {
            "url": "https://abcnews.go.com/US/ed-dwight-nasas-1st-black-astronaut-candidate-finally/story?id=110365447", 
            "description": "Ed Dwight, 90, will also be the oldest man to travel to space.", 
            "title": "Ed Dwight, NASA's 1st Black astronaut candidate, finally set to go to space on Blue Origin - ABC News"
        }, 
        {
            "url": "https://www.usatoday.com/story/news/world/2024/05/19/ukraine-losing-war-with-russia/73730454007/", 
            "description": null, 
            "title": "Russia opens new front in Ukraine war. Is Ukraine losing the war with Russia? - USA TODAY"
        }, 
        {
            "url": "https://www.bbc.com/news/health-69027421", 
            "description": "More than 12,000 people asked for tests in England after the BBC found 1,700 cases are undiagnosed.", 
            "title": "Infected blood scandal: Surge in hepatitis C tests - BBC.com"
        }, 
        {
            "url": "http://www.nbcchicago.com/news/local/bridgeview-man-arturo-cantu-shot-and-killed-by-girlfriends-lover-prosecutors-say-both-face-charges/3440898/", 
            "description": "Bridgeview woman, lover charged after plotting to kill her boyfriend: prosecutors", 
            "title": "Bridgeview man shot and killed by girlfriend's lover, both face charges: prosecutors - NBC Chicago"
        }, 
        {
            "url": "https://www.thecrimson.com/article/2024/5/19/alice-stewart-iop-obituary/", 
            "description": "Alice Stewart, a Republican political adviser and CNN commentator who was best known at Harvard for her dedication to undergraduate students as a member of the Institute of Politics Senior Advisory Committee, died early Saturday morning. She was 58.", 
            "title": "Alice Stewart, CNN Political Commentator and Harvard Institute of Politics Board Member, Dead At 58 | News - Harvard Crimson"
        }, 
        {
            "url": "https://sports.yahoo.com/the-mavericks-major-gambles-pay-off-as-luka-doncic-kyrie-irving-lead-charge-to-west-finals-065927340.html", 
            "description": "Shrewd moves and timely deals have the aggressive Mavericks moving on in the postseason — and perhaps to an even better tomorrow.", 
            "title": "The Mavericks' major gambles pay off as Luka Dončić, Kyrie Irving lead charge to West finals - Yahoo Sports"
        }, 
        {
            "url": "https://apnews.com/article/wikileaks-julian-assange-espionage-extradition-london-appeal-f46adda2a71c9f2bdd88eb16d8e606f7", 
            "description": "WikiLeaks founder Julian Assange faces what could be his final court hearing in England over whether he should be extradited to the United States to face spying charges. The High Court will hear arguments Monday over whether Assange can seek an appeals court …", 
            "title": "WikiLeaks founder Julian Assange facing pivotal moment in long fight to stay out of US court - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/alzheimers-risk-test-sanjay-gupta/index.html", 
            "description": "For the documentary “The Last Alzheimer’s Patient”, Dr. Sanjay Gupta underwent intensive testing of his own body and brain to understand his risk of dementia.", 
            "title": "I have a family history of Alzheimer’s disease. I wanted to understand my own risk - CNN"
        }, 
        {
            "url": "https://chicago.suntimes.com/horoscopes/2024/05/19/horoscopes-today-sunday-may-19-2024", 
            "description": null, 
            "title": "Horoscope for Sunday, May 19, 2024 - Chicago Sun-Times"
        }, 
        {
            "url": "https://variety.com/2024/tv/news/snl-trump-trial-vp-picks-1236009284/", 
            "description": "In the cold open for the 'SNL' Season 49 finale, James Austin Johnson portrayed former president Donald Trump at his NYC trial.", 
            "title": "‘SNL’ Cold Open Riffs on Trump Trial and His VP Picks - Variety"
        }, 
        {
            "url": "https://www.reuters.com/technology/musk-arrives-indonesias-bali-planned-starlink-launch-2024-05-19/", 
            "description": "Elon Musk and Indonesian Health Minister Budi Gunadi Sadikin launched SpaceX's satellite internet service for the nation's health sector on Sunday, aiming to improve access in remote parts of the sprawling archipelago.", 
            "title": "Musk arrives in Indonesia's Bali for planned Starlink launch - Reuters"
        }, 
        {
            "url": "https://thehill.com/homenews/house/4672547-elise-stefanik-joe-biden-israel-weapons-hold-denouncement/", 
            "description": null, 
            "title": "Stefanik to slam Biden’s weapons hold in remarks before Israel’s government - The Hill"
        }, 
        {
            "url": "https://www.cbsnews.com/news/rudy-giuliani-served-indictment-arizona-fake-elector-case/", 
            "description": "The former New York mayor was served after his 80th birthday celebration as he was walking to the car, a political adviser said.", 
            "title": "Rudy Giuliani served indictment in Arizona fake elector case - CBS News"
        }, 
        {
            "url": "https://www.usatoday.com/story/sports/columnist/dan-wolken/2024/05/18/preakness-2024-d-wayne-lukas-trainer-seize-the-grey/73755462007/", 
            "description": "Legendary trainer D. Wayne Lukas, a few months shy of his 89th birthday, wins his 15th Triple Crown race Saturday at the Preakness.", 
            "title": "D. Wayne Lukas, legendary Thoroughbred trainer, has still got it at 88 - USA TODAY"
        }, 
        {
            "url": "https://golf.com/news/pga-championship-melee-guys-missing/", 
            "description": "Three guys went missing from the PGA Championship on Saturday. But a list of compelling contenders promises good chaos come Sunday.", 
            "title": "The PGA is a wide-open brawl. But 3 guys are missing - Golf.com"
        }
    ], 
    "last_updated": "2024-05-20 17:00:03"
}