{
    "news": [
        {
            "url": "https://www.reuters.com/world/europe/western-aid-ukraine-too-slow-risks-us-election-limited-zelenskiy-2024-05-20/", 
            "description": null, 
            "title": "Exclusive: Ukraine's Zelenskiy pushes allies to step up aid and involvement in war - Reuters"
        }, 
        {
            "url": "https://apnews.com/live/helicopter-iranian-president-crash", 
            "description": "Supreme Leader Ayatollah Ali Khamenei announced that Iran’s first vice president, Mohammad Mokhber, would serve as the country’s acting president until elections are held.", 
            "title": "Live updates: Iran's president killed in helicopter crash, election set for next month - The Associated Press"
        }, 
        {
            "url": "https://arstechnica.com/gadgets/2024/05/m4-ipad-pro-teardown-finds-easier-to-access-battery-glimpses-of-tandem-oled-design/", 
            "description": "Straightforward tablet teardown is followed by a comically difficult Pencil one.", 
            "title": "M4 iPad Pro teardown finds easier-to-access battery, glimpses of Tandem OLED design - Ars Technica"
        }, 
        {
            "url": "https://www.houstonchronicle.com/business/energy/article/centerpoint-power-outage-monday-19467639.php", 
            "description": null, 
            "title": "CenterPoint: 216K customers without power in the Houston area Monday - Houston Chronicle "
        }, 
        {
            "url": "https://www.cnn.com/2024/05/20/climate/doomsday-glacier-melt-antarctica-climate-intl/index.html", 
            "description": "Ocean water is pushing miles beneath Antarctica’s “Doomsday Glacier” on a daily basis making it more vulnerable to melting than previously thought, according to new research, which used radar data from space to perform an X-ray of the crucial glacier.", 
            "title": "Ocean water is rushing miles underneath the ‘Doomsday Glacier’ with potentially dire impacts on sea level rise - CNN"
        }, 
        {
            "url": "http://deadline.com/2024/05/the-apprentice-trump-movie-ovation-cannes-1235924376/", 
            "description": "Ali Abbasi’s The Apprentice, a Donald Trump origin story of sorts, world premiered in competition at the Cannes Film Festival on May 20.", 
            "title": "Donald Trump Origin Tale ‘The Apprentice’ Gets 11-Minute Ovation At Its Cannes World Premiere - Deadline"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://abcnews.go.com/US/golfer-scottie-scheffler-charges-arraignment/story?id=110401748", 
            "description": "Scheffler faces charges including second-degree assault of a police officer.", 
            "title": "Star golfer Scottie Scheffler's arraignment postponed after arrest during PGA Championship - ABC News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/20/us/baltimore-bridge-collapse-ship-relocation/index.html", 
            "description": "After 55 days stuck in the Patapsco River, the Dali cargo ship was hauled away from the site of its catastrophic crash into the Francis Scott Key Bridge – a crucial step toward fully reopening the busy Port of Baltimore.", 
            "title": "Almost 2 months after it destroyed Baltimore’s Key Bridge, the Dali cargo ship has been moved and docked. Here’s what’s next - CNN"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/20/jpmorgan-ceo-jamie-dimon-retirement-approaching.html", 
            "description": "The ambiguity of Dimon's plans has made succession timing at JPMorgan one of the persistent questions for the bank's investors and analysts. He is 68.", 
            "title": "JPMorgan CEO Jamie Dimon signals retirement is closer than ever - CNBC"
        }, 
        {
            "url": "https://bleacherreport.com/articles/10121666-victor-wembanyama-chet-holmgren-headline-2023-24-nba-all-rookie-team", 
            "description": "The NBA honored the top first-year stars from the 2023-24 season, with the San Antonio Spurs' Victor Wembanyama and Oklahoma City Thunder's Chet Holmgren…", 
            "title": "Victor Wembanyama, Chet Holmgren Headline 2023-24 NBA All-Rookie Team - Bleacher Report"
        }, 
        {
            "url": "https://www.washingtonpost.com/wellness/2024/05/20/heart-tests-echocardiograms-stress-test/", 
            "description": "Some tests have been found to be used far too often, at little benefit.", 
            "title": "Echocardiograms, cardiac calcium tests: Should you get these checkups? - The Washington Post"
        }, 
        {
            "url": "https://www.anandtech.com/show/21404/lenovo-unveils-yoga-slim-7x-14-gen-14-and-thinkpad-t14-gen-6-notebooks-powered-by-qualcomm-snapdragon-x-elite", 
            "description": "While we&#39;ve been expecting the availability of the Qualcomm Snapdragon X Elite processor to be around the middle of this year, Lenovo has announced...", 
            "title": "Lenovo Unveils Yoga Slim 7x 14 Gen 14 and ThinkPad T14 Gen 6 Notebooks Powered By Qualcomm Snapdragon X Elite - AnandTech"
        }, 
        {
            "url": "https://www.reuters.com/world/us/donald-trump-foreign-policy-advisers-met-israeli-pm-netanyahu-source-says-2024-05-20/", 
            "description": null, 
            "title": "Exclusive: Donald Trump foreign policy advisers met Israeli PM Netanyahu, source says - Reuters"
        }, 
        {
            "url": "https://www.ign.com/articles/esa-is-investigating-a-dramatic-fireball-that-exploded-over-spain-this-weekend", 
            "description": "The European Space Agency’s Planetary Defence Office is investigating the appearance of an enormous fireball that lit up the sky above Spain and Portugal late last week.", 
            "title": "Social Media Flooded With Videos of a Dramatic Fireball Over Spain and Portugal - IGN"
        }, 
        {
            "url": "https://nypost.com/2024/05/20/us-news/t-d-jakes-blasts-sean-diddy-combs-over-abuse-video/", 
            "description": "“When I saw the images that have been floating all over the news all week, it became difficult to watch … The atrocious, degrading, demeaning debauchery,” Jakes told his congregat…", 
            "title": "Sean 'Diddy' Combs blasted by ex-spiritual adviser T.D. Jakes over leaked abuse video: 'Atrocious, degrading, demeaning' - New York Post "
        }, 
        {
            "url": "https://www.foxsports.com/stories/nascar/ricky-stenhouse-jr-kyle-busch-fight-fallout-nascar-punishment", 
            "description": "Following Sunday's postrace melee between Ricky Stenhouse Jr. and Kyle Busch, NASCAR must now decide whether to hand out penalties.", 
            "title": "Ricky Stenhouse Jr.-Kyle Busch fight fallout: How will NASCAR handle punishment? - FOX Sports"
        }, 
        {
            "url": "https://www.reuters.com/world/us/trump-has-chance-testify-hush-money-trial-if-he-so-chooses-2024-05-20/", 
            "description": null, 
            "title": "Stealing from Trump was 'self-help,' Cohen testifies at hush money trial - Reuters"
        }, 
        {
            "url": "https://nypost.com/2024/05/20/business/target-to-slash-prices-on-5000-frequently-bought-products/", 
            "description": "Shoppers who flock to Target will end up paying less for products such as milk, meat, bread, soda, fresh fruit and vegetables, according to the firm.", 
            "title": "Target to slash prices on 5,000 frequently bought items to lure inflation-weary customers - New York Post "
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/kevin-costner-horizon-yellowstone-1235904037/", 
            "description": "During a career-spanning chat with Scott Feinberg, the Oscar-winning filmmaker opened up about a life-changing encounter with Richard Burton, what really happened with 'Waterworld' and investing chunks of his \"pile\" in films he believes in.", 
            "title": "Cannes: Kevin Costner Talks Passion Project ‘Horizon,’ ‘Yellowstone’ Standoff at Lively ‘Awards Chatter’ Podcast Taping - Hollywood Reporter"
        }
    ], 
    "last_updated": "2024-05-21 23:17:52"
}