{
    "news": [
        {
            "url": "https://www.cnn.com/2024/05/30/business/boeing-safety-plan-faa/index.html", 
            "description": "Boeing executives presented sweeping changes to the company’s production process and safety systems in a three-hour meeting with the Federal Aviation Administration on Thursday. The plan is meant to reassure the public, airline customers and regulators that t…", 
            "title": "3-hour meeting ends with FAA saying Boeing can’t increase Max plane production until quality is fixed - CNN"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cy770l9llnzo", 
            "description": "The US gives Ukraine permission to use US-supplied weapons to strike targets in Russia, but only near Kharkiv.", 
            "title": "Ukraine allowed to hit some targets in Russia with US weapons - BBC.com"
        }, 
        {
            "url": "https://www.wsj.com/articles/national-rifle-association-v-maria-vullo-supreme-court-first-amendment-sonia-sotomayor-acdb890d", 
            "description": null, 
            "title": "Opinion | A Unanimous Supreme Court Backs the NRA Against a Thuggish Regulator - The Wall Street Journal"
        }, 
        {
            "url": "https://www.sfgate.com/bayarea/article/bay-area-judge-scott-peterson-latest-defense-19486304.php", 
            "description": null, 
            "title": "Bay Area judge wipes out Scott Peterson's latest defense tactic - SFGATE"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/30/24168175/ios-18-ai-siri-apple-apps", 
            "description": "Apple is planning a big AI update for Siri that could let you control specific app features with your voice, according to Bloomberg.", 
            "title": "iOS 18 (and AI) will give Siri much more control over your apps - The Verge"
        }, 
        {
            "url": "https://www.chicagobears.com/news/chicago-bears-nfl-films-and-hbo-announce-hard-knocks-training-camp-with-the-chicago-bears", 
            "description": "Remaining a fixture in the national spotlight, Hard Knocks: Training Camp with the Chicago Bears debuts Tuesday, August 6th at 9 p.m. ET / 8 p.m. CT.", 
            "title": "NFL Films and HBO announce Hard Knocks: Training Camp with the Chicago Bears - ChicagoBears.com"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmhvbGx5d29vZHJlcG9ydGVyLmNvbS9tb3ZpZXMvbW92aWUtbmV3cy9jaHJpcy1oZW1zd29ydGgtZy1pLWpvZS10cmFuc2Zvcm1lcnMtY3Jvc3NvdmVyLW1vdmllLTEyMzU5MTIxNjQv0gF4aHR0cHM6Ly93d3cuaG9sbHl3b29kcmVwb3J0ZXIuY29tL21vdmllcy9tb3ZpZS1uZXdzL2NocmlzLWhlbXN3b3J0aC1nLWktam9lLXRyYW5zZm9ybWVycy1jcm9zc292ZXItbW92aWUtMTIzNTkxMjE2NC9hbXAv?oc=5", 
            "description": null, 
            "title": "Chris Hemsworth in Talks to Lead G.I. Joe-Transformers Crossover Movie for Paramount and Hasbro - Hollywood Reporter"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/30/gap-gps-earnings-q1-2024.html", 
            "description": "Gap has been in the midst of a turnaround under CEO Richard Dickson, who has focused on better marketing and storytelling for the company's portfolio of brands.", 
            "title": "Gap shares pop 15% as earnings beat on sales growth at all four brands - CNBC"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/30/us/jury-deliberations-murder-trial-chad-daybell/index.html", 
            "description": "Chad Daybell was found guilty Thursday of murder and conspiracy charges in the deaths of his first wife and the two children of his second wife in a case Idaho prosecutors claim was fueled by power, sex, money and apocalyptic spiritual beliefs. Daybell could …", 
            "title": "Chad Daybell found guilty of killing first wife and second wife’s 2 children - CNN"
        }, 
        {
            "url": "https://www.washingtonpost.com/technology/2024/05/30/openai-disinfo-influence-operations-china-russia/", 
            "description": "Covert propagandists have already begun using generative artificial intelligence to boost their influence operations.", 
            "title": "OpenAI finds Russian and Chinese groups used its tech for propaganda campaigns - The Washington Post"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/30/entertainment/lenny-kravitz-celibate/index.html", 
            "description": "Lenny Kravitz’s leather pants continue to stay on.", 
            "title": "Lenny Kravitz is still all about being celibate as he waits for the right person - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/30/politics/john-roberts-ethics-alito-flag-supreme-court-durbin/index.html", 
            "description": "Chief Justice John Roberts on Thursday rejected a meeting request from Democratic lawmakers who wanted to discuss two provocative flags hoisted at Justice Samuel Alito’s properties.", 
            "title": "Chief Justice John Roberts declines to meet with Democratic lawmakers about ethics flap and Alito’s flags - CNN"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.espn.com/mlb/story/_/id/40245841/mets-dfa-jorge-lopez-reliever-throws-glove-stands-following-ejection", 
            "description": "Jorge López has been designated for assignment by the struggling New York Mets, a day after the reliever threw his glove into the stands following his ejection at Citi Field.", 
            "title": "Mets DFA Jorge López after reliever throws glove into stands following ejection - ESPN"
        }, 
        {
            "url": "https://www.cbssports.com/nba/news/timberwolves-vs-mavericks-odds-prediction-2024-nba-western-conference-finals-game-5-picks-from-proven-model/", 
            "description": "SportsLine's model has made its NBA picks, predictions and best bets for Game 5 of Minnesota Timberwolves vs. Dallas Mavericks in the 2024 Western Conference finals on Thursday", 
            "title": "Timberwolves vs. Mavericks odds, prediction: 2024 NBA Western Conference finals Game 5 picks from proven model - CBS Sports"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=_VS7OPampF8", 
            "description": "Dustin Poirier will step into the #UFC octagon this Saturday in what will likely be his final chance to become an undisputed world champion. To pull it off, ...", 
            "title": "BTL | Poirier's Last Chance vs. Makhachev at UFC 302, Strickland vs. Costa, Garry vs. MVP - MMAFightingonSBN"
        }, 
        {
            "url": "https://www.space.com/boeing-starliner-rolls-out-launch-pad-second-time-photos", 
            "description": "It was Starliner's second trip to the launch pad in less than a month.", 
            "title": "Boeing's Starliner rolls out to pad for June 1 astronaut launch (photos) - Space.com"
        }, 
        {
            "url": "https://www.cdc.gov/media/releases/2024/p0530-h5-human-case-michigan.html", 
            "description": "Press releases, advisories, telebriefings, transcripts and archives.", 
            "title": "CDC Confirms Second Human H5 Bird Flu Case in Michigan; Third Case Tied to Dairy Outbreak | CDC Online Newsroom - CDC"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }
    ], 
    "last_updated": "2024-06-01 01:21:12"
}