{
    "news": [
        {
            "url": "https://finance.yahoo.com/news/live/stock-market-today-stocks-tread-water-with-dow-poised-for-another-bid-for-40000-133352953.html", 
            "description": "Stocks trod water as investors assess the chances of the Dow succeeding in another bid to cross 40,000 for the first time.", 
            "title": "Stock market today: Stocks tread water with Dow poised for another bid for 40,000 - Yahoo Finance"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjQvMDUvMTcvd29ybGQvZXVyb3BlL3NldmFzdG9wb2wtdWtyYWluZS1jcmltZWEtcnVzc2lhLmh0bWzSAQA?oc=5", 
            "description": null, 
            "title": "Ukraine Hits Sevastopol Power Station With Huge Drone Attack, Russia Says - The New York Times"
        }, 
        {
            "url": "https://www.macrumors.com/2024/05/17/oled-ipad-pro-grainy-display-reports/", 
            "description": "Some new M4 iPad Pro models are exhibiting a visible static grain pattern across the OLED display, according to several user reports on Reddit (1, 2,...", 
            "title": "OLED iPad Pro Users Report 'Grainy' Displays, But It May Not Be a Defect - MacRumors"
        }, 
        {
            "url": "https://apnews.com/article/vatican-apparitions-pope-lourdes-fatima-f9b5659e2947e7eb966db2e491e17267", 
            "description": "The Vatican has radically reformed its process for evaluating alleged visions of the Virgin Mary, weeping statues and other seemingly supernatural phenomena. The Vatican’s doctrine office overhauled norms first issued in 1978, arguing that they were no longer…", 
            "title": "Vatican revamps norms to evaluate visions of Mary as it adapts to internet age and combats hoaxers - The Associated Press"
        }, 
        {
            "url": "http://deadline.com/2024/05/megalopolis-donald-trump-francis-ford-coppola-jon-voight-cannes-1235920285/", 
            "description": "\"To do a Roman epic set in modern America, I had no idea that the politics of today would make that so relevant,\" Francis Coppola said on Megalopolis.", 
            "title": "Francis Ford Coppola Says “Men Like Donald Trump Are Not At The Moment In Charge”; Filmmaker Pulls Jon Voight Into Political Convo At ‘Megalopolis’ Cannes Presser - Deadline"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://scitechdaily.com/nasas-juno-spacecraft-reveals-dynamic-shifts-on-europas-frozen-surface/", 
            "description": "NASA’s Juno has provided images that support the theory of true polar wander on Europa, showing the moon’s ice shell has shifted. Images from the solar-powered spacecraft revealed intriguing features on the ice-encased Jovian moon, including geological disrup…", 
            "title": "NASA's Juno Spacecraft Reveals Dynamic Shifts on Europa's Frozen Surface - SciTechDaily"
        }, 
        {
            "url": "https://www.click2houston.com/news/local/2024/05/17/house-committee-meeting-devolves-into-chaos-amid-insults-between-rep-jasmine-crockett-rep-marjorie-taylor-greene/", 
            "description": "The hearing was derailed when Rep. Marjorie Taylor Greene, R-Ga., responded to a question from Rep. Jasmine Crockett, D-Texas, by saying, “I think your fake eyelashes are messing up what you’re reading.”", 
            "title": "House committee meeting devolves into chaos amid insults between Rep. Jasmine Crockett, Rep. Marjorie Taylor Greene - KPRC Click2Houston"
        }, 
        {
            "url": "https://www.formula1.com/en/latest/article/fp1-leclerc-leads-russell-and-sainz-during-first-practice-in-imola-as-albon.6YL4VSwWu9cBlkwgnOMLiZ", 
            "description": "Charles Leclerc topped the timesheets during the opening practice session of the Emilia-Romagna Grand Prix weekend, with the Monegasque leading the way from George Russell and Carlos Sainz in a busy hour on track.", 
            "title": "FP1: Leclerc leads Russell and Sainz during first practice in Imola as Albon brings out red flags | Formula 1® - Formula 1"
        }, 
        {
            "url": "https://apnews.com/article/airman-shot-florida-deputy-roger-fortson-6decf235d8acee616daaa5b9a08f85c9", 
            "description": "A funeral has begun for a Black U.S. Air Force senior airman who was shot and killed in his Florida home by a sheriff’s deputy. Friday's funeral for Airman Roger Fortson, who died at age 23, comes a day after his mother vowed during an emotional news conferen…", 
            "title": "Funeral set for Roger Fortson, the Black US Air Force member killed in his home by Florida deputy - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/17/europe/france-armed-man-synagogue-rouen-intl-hnk/index.html", 
            "description": "Police shot dead an armed attacker trying to set fire to a synagogue in the northern French city of Rouen on Friday, according to a spokesman for the country’s interior ministry.", 
            "title": "Police shoot dead armed attacker who started fire in Rouen synagogue - CNN"
        }, 
        {
            "url": "https://www.espn.com/golf/story/_/id/40162983/scottie-scheffler-detained-police-prior-start-pga-championship", 
            "description": "World No. 1 golfer Scottie Scheffler was arrested by Louisville Metro Police on Friday morning after trying to drive into the entrance of Valhalla Golf Club, the site of this week's PGA Championship.", 
            "title": "Scottie Scheffler arrested before start of PGA Championship - ESPN"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cgrwlewjn7do", 
            "description": "The latest instalment of the hugely popular series will be released in autumn 2025, its publisher says.", 
            "title": "GTA 6: Countdown begins as Take Two firms up release date - BBC.com"
        }, 
        {
            "url": "https://www.reuters.com/technology/reddit-stock-jumps-after-openai-partnership-2024-05-17/", 
            "description": null, 
            "title": "Reddit stock jumps after OpenAI partnership - Reuters"
        }, 
        {
            "url": "https://www.theringer.com/music/2024/5/17/24158566/i-saw-the-tv-glow-soundtrack-barbie-movie-music-phoebe-bridgers-caroline-polachek", 
            "description": "On Jane Schoenbrun’s new A24 film and the long-lost art of the compilation soundtrack", 
            "title": "‘I Saw the TV Glow’ Will Make You Care About Movie Soundtracks Again - The Ringer"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/17/sport/minnesota-timberwolves-blow-out-denver-nuggets-force-game-7-spt-intl/index.html", 
            "description": "The Minnesota Timberwolves avoided elimination from the NBA playoffs in spectacular fashion on Thursday, blowing out defending champions the Denver Nuggets 115-70 to force a Game 7 back in Colorado.", 
            "title": "How a ‘hype video’ led to Minnesota Timberwolves blowing out Denver Nuggets to force Game 7 - CNN"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yZXZpdmFsLW1lbWUtc3RvY2stZnJlbnp5LXBvaW50cy0xMDAwMjQyMDIuaHRtbNIBAA?oc=5", 
            "description": null, 
            "title": "Revival of Meme-Stock Frenzy Points to a Frothy US Stock Market - Yahoo Finance"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/17/biden-trump-debate-2024-demands-00158586", 
            "description": null, 
            "title": "Biden's team had a few demands for a Trump debate. A major one: No crowd. - POLITICO"
        }, 
        {
            "url": "https://www.livescience.com/space/black-holes/scientists-discover-bizarre-region-around-black-holes-that-proves-einstein-right-yet-again", 
            "description": "Einstein's general theory of relativity predicted that so-called 'plunging regions' around black holes would accelerate matter into them at the speed of light. Now, X-ray observations of a remote black hole have proved him right.", 
            "title": "Scientists discover bizarre region around black holes that proves Einstein right yet again - Livescience.com"
        }, 
        {
            "url": "https://www.axios.com/2024/05/16/greg-abbott-pardon-daniel-perry", 
            "description": null, 
            "title": "Gov. Greg Abbott pardons ex-U.S. sergeant who killed BLM protester - Axios"
        }
    ], 
    "last_updated": "2024-05-18 19:00:12"
}