{
    "news": [
        {
            "url": "http://deadline.com/2024/05/kerry-washington-wake-up-dead-man-a-knives-out-mystery-1235942921/", 
            "description": "Kerry Washington joins Daniel Craig in Netflix's 'Wake Up Dead Man: A Knives Out Mystery'", 
            "title": "Kerry Washington Joins Daniel Craig In ‘Wake Up Dead Man: A Knives Out Mystery’ - Deadline"
        }, 
        {
            "url": "https://nypost.com/2024/05/29/sports/scottie-scheffler-charges-expected-to-be-dropped-after-arrest/", 
            "description": "Scheffler was charged with second-degree assault of a police officer, third-degree criminal mischief, reckless driving and disregarding signals from officer directing traffic in a May 17 incident b…", 
            "title": "Scottie Scheffler charges expected to be dropped after arrest - New York Post "
        }, 
        {
            "url": "https://www.wsj.com/business/energy-oil/conocophillips-to-acquire-marathon-oil-in-22-5b-all-stock-deal-743cc8ba", 
            "description": null, 
            "title": "ConocoPhillips to Acquire Marathon Oil in $17.1 Billion All-Stock Deal - The Wall Street Journal"
        }, 
        {
            "url": "https://finance.yahoo.com/video/too-much-capacity-fueled-american-150216541.html", 
            "description": "American Airlines (AAL) has slashed its second quarter guidance and announced the departure of its chief commercial officer, Vasu Raja. This double whammy...", 
            "title": "'Too much capacity' fueled American Airlines' Q2 guidance cut: Analyst - Yahoo Finance"
        }, 
        {
            "url": "https://gizmodo.com/former-openai-board-member-sam-altman-chatgpt-1851506252", 
            "description": "It's finally revealed why Sam Altman was temporarily fired from the company.", 
            "title": "Former OpenAI Board Member Says Sam Altman Created a Culture of 'Psychological Abuse' - Gizmodo"
        }, 
        {
            "url": "https://variety.com/2024/tv/news/matt-smith-house-of-the-dragon-season-2-weaker-daemon-1236017805/", 
            "description": "Matt Smith pulls back the curtain on 'House of the Dragon' Season 2, from losing showrunner Miguel Sapochnik to playing a 'weaker' Daemon in crisis.", 
            "title": "Matt Smith Pulls Back the Curtain on ‘House of the Dragon’ Season 2, From Losing a Showrunner to Playing a ‘Much Weaker’ Daemon in Crisis - Variety"
        }, 
        {
            "url": "https://finance.yahoo.com/video/expect-apples-developers-conference-143925727.html", 
            "description": null, 
            "title": "What to expect from Apple's Developers Conference - Yahoo Finance"
        }, 
        {
            "url": "https://apnews.com/article/negro-leagues-statistics-4a204a3cac0527ab5be750783fd411df", 
            "description": "Josh Gibson became Major League Baseball’s career leader with a .372 batting average, surpassing Ty Cobb’s .367, when records of the Negro Leagues for more than 2,300 players were incorporated after a three-year research project. Gibson’s .466 average for the…", 
            "title": "Josh Gibson becomes MLB career and season batting leader as Negro Leagues statistics incorporated - The Associated Press"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmZveHdlYXRoZXIuY29tL2V4dHJlbWUtd2VhdGhlci9pY2VsYW5kLXZvbGNhbm8tZXJ1cHRzLWdyaW5kYXZpay1tYXktMjAyNNIBAA?oc=5", 
            "description": null, 
            "title": "Volcano erupts in Iceland sending lava closer to Grindavik - Fox Weather "
        }, 
        {
            "url": "https://www.theverge.com/2024/5/29/24166168/fitbit-ace-lte-kids-smartwatch-wearables", 
            "description": "The $229.95 Fitbit Ace LTE is a fresh take on a smartwatch for children, with collectible wristbands, games, and built-in LTE connectivity for parents.", 
            "title": "The Fitbit Ace LTE is like a Nintendo smartwatch for kids - The Verge"
        }, 
        {
            "url": "https://www.cbsnews.com/news/millions-chickens-to-be-killed-bird-flu-detected-iowa-farm/", 
            "description": "The steep loss from the top egg-producing state triggered a disaster proclamation from Iowa's governor.", 
            "title": "More than 4 million chickens to be killed in Iowa after officials detect bird flu on farm - CBS News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/29/us/social-media-children-influencers-cec/index.html", 
            "description": "Cam Barrett knows the precise date of her first menstrual period. Her mother posted the news on Facebook. Barrett, who lives in Illinois, is part of a growing movement of young people who are urging lawmakers to protect children whose parents monetize their p…", 
            "title": "The first social media babies are adults now. Some are pushing for laws to protect kids from their parents’ oversharing - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/29/africa/south-africa-elections-polls-open-intl/index.html", 
            "description": "Millions of South Africans are voting in what is expected to be the most pivotal general election since the end of apartheid.", 
            "title": "South Africans go to the polls in election seen as biggest test yet to ANC’s 30 years in power - CNN"
        }, 
        {
            "url": "https://www.newsweek.com/ukraine-nato-joe-bien-world-war-iii-red-line-russia-1905755", 
            "description": "Kyiv wants to use American weapons to strike inside Russia, but the White House fears a wider and more destructive war.", 
            "title": "Ukraine, NATO allies urge Joe Biden to drop \"World War III\" red line - Newsweek"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c033m529ry0o", 
            "description": "It is unclear when the US military's floating pier off Gaza's coast will resume operations.", 
            "title": "US military Gaza pier knocked out of action by heavy seas - BBC.com"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.cnet.com/tech/services-and-software/dancing-for-the-devil-is-the-tiktok-cult-doc-you-have-to-see-to-believe/", 
            "description": "Netflix's new docuseries puts management company 7M Films -- and its associated church -- in the spotlight.", 
            "title": "'Dancing for the Devil' Is the 'TikTok Cult' Doc You Have to See to Believe - CNET"
        }, 
        {
            "url": "https://www.foxnews.com/politics/biden-campaign-seeks-halt-slide-black-voters-new-initiative", 
            "description": "The Biden-Harris campaign on Wednesday launched a new \"Black Voters for Biden-Harris\" initiative to reach out to Black voters as polls show Biden is losing ground with that group.", 
            "title": "Biden campaign seeks to halt slide with Black voters with new initiative - Fox News"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c166xxd4y36o", 
            "description": "Several parts of northern and central India have recorded soaring temperatures this summer.", 
            "title": "Summer 2024: Temperatures cross 50C in northern India - BBC.com"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-deliberations-jury-judge-verdict-390f045e9e8a37f069e82576edd7a842", 
            "description": "Jurors in Donald Trump’s New York hush money trial are expected to begin deliberations after receiving instructions from the judge on the law and the factors they may consider as they strive to reach a verdict in the first criminal case against a former Ameri…", 
            "title": "Trump hush money trial: Jury begin deliberations after marathon closing arguments - The Associated Press"
        }
    ], 
    "last_updated": "2024-05-30 19:13:35"
}