{
    "news": [
        {
            "url": "https://www.washingtonpost.com/world/2024/05/13/israel-hamas-war-news-gaza-palestine/", 
            "description": "Secretary of State Antony Blinken says Israeli success in Rafah is “not sustainable” without a postwar plan for Gaza. It’s Memorial Day in Israel.", 
            "title": "Middle East conflict live updates: Israel renews fight in north Gaza, advances on Rafah in south - The Washington Post"
        }, 
        {
            "url": "https://finance.yahoo.com/news/bidens-coming-new-tariffs-on-china-reflect-lessons-learned-130114807.html", 
            "description": "A sweeping White House move on China tariffs that is expected to be unveiled early next week \"reflects lessons learned,\" according to a former official who...", 
            "title": "Biden's coming new tariffs on China reflect 'lessons learned' - Yahoo Finance"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-stormy-daniels-michael-cohen-hush-money-f96dd7289cf952145cdd6737b29add3d", 
            "description": "The star prosecution witness in Donald Trump’s hush money trial is set to take the stand with testimony that could help shape the outcome of the first criminal case against an American president. Michael Cohen, Trump’s former lawyer and personal fixer, is by …", 
            "title": "Trump hush money trial: Star witness Michael Cohen set to testify - The Associated Press"
        }, 
        {
            "url": "https://newatlas.com/medical/pig-kidney-transplant-death/", 
            "description": "The first successful transplant of a genetically modified pig kidney into a human recipient is still being regarded as a medical milestone and success, even though the recipient has sadly passed away.", 
            "title": "World-first pig kidney transplant recipient has died - New Atlas"
        }, 
        {
            "url": "https://www.bbc.com/news/uk-politics-69000303", 
            "description": "The PM will argue in a speech that the UK is facing some of its \"most transformational\" years.", 
            "title": "Rishi Sunak to warn next few years 'most dangerous' for UK in major speech - BBC.com"
        }, 
        {
            "url": "https://www.axios.com/2024/05/13/jerry-seinfeld-duke-college-protests-israel", 
            "description": null, 
            "title": "Jerry Seinfeld speech prompts Duke pro-Palestinian protest walkout - Axios"
        }, 
        {
            "url": "https://nypost.com/2024/05/13/us-news/antony-blinken-delivers-strongest-public-rebuke-of-israel-yet-get-out-of-gaza/", 
            "description": "Blinken also directly addressed the U.S. withholding high payload bombs to Israel.", 
            "title": "Blinken delivers strongest public rebuke of Israel yet: 'Get out of Gaza' - New York Post "
        }, 
        {
            "url": "https://www.reuters.com/world/asia-pacific/indonesias-mt-ibu-erupts-spewing-ash-clouds-2024-05-13/", 
            "description": null, 
            "title": "Indonesia's Mt Ibu erupts, spewing ash clouds - Reuters"
        }, 
        {
            "url": "https://www.reuters.com/world/europe/catalans-vote-election-that-offers-new-chance-exiled-separatist-leader-2024-05-12/", 
            "description": null, 
            "title": "Spain's Socialists hail 'new era' in Catalonia as separatist support dims in elections - Reuters"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://apnews.com/article/china-byd-auto-seagull-auto-ev-cae20c92432b74e95c234d93ec1df400", 
            "description": "A tiny, low-priced electric vehicle called the Seagull has American automakers and politicians trembling. The car, launched last year by Chinese automaker BYD, sells for around $12,000 in China. But it drives well and is put together with craftsmanship that r…", 
            "title": "Small, well-built Chinese EV called the Seagull poses a big threat to the US auto industry - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/12/europe/sergei-shoigu-putin-replaces-defense-minister-intl-latam/index.html", 
            "description": "Russian President Vladimir Putin has replaced his defense minister and close ally Sergei Shoigu with a civilian economist, a major reshuffle of military leadership more than two-years after Moscow’s grinding war against Ukraine has sent defense spending soari…", 
            "title": "Putin replaces Russia’s defense minister with a civilian as Ukraine war rages and defense spending spirals - CNN"
        }, 
        {
            "url": "http://deadline.com/2024/05/john-oliver-eurovision-windows95man-champion-1235913452/", 
            "description": "John Oliver took the first part of Last Week Tonight to talk about the Eurovision Song Contest and highlighted the act from Finland, known as Windows95man.", 
            "title": "John Oliver Calls Eurovision’s Windows95man His Champion - Deadline"
        }, 
        {
            "url": "https://apnews.com/article/israel-gaza-war-fallen-soldiers-memorial-9e5e35ef6352c79ab59e7f3b8a7f7a1b", 
            "description": "Memorial Day is always a somber occasion in Israel. But it has taken on a profound and raw sadness coupled with percolating anger in the aftermath of Oct. 7. Families of the fallen and broad segments of the public are demanding accountability from Israeli lea…", 
            "title": "Profound sadness, anger grips Israel on Memorial Day - The Associated Press"
        }, 
        {
            "url": "https://www.forexlive.com/centralbank/this-week-brings-the-most-crucial-cpi-reading-of-2024-a-mini-super-bowl-20240513/", 
            "description": "Dow Jones / Marekt Watch (gated) on this week's CPI report coming from the US: . 'When the Fed says it is data-dependent, every time there is a data release, it is potentially a market-moving event...", 
            "title": "This week brings the 'most crucial CPI reading of 2024', a 'mini Super Bowl' - ForexLive"
        }, 
        {
            "url": "https://www.cbssports.com/nba/news/nuggets-vs-timberwolves-score-dominant-nikola-jokic-near-perfect-aaron-gordon-lift-denver-to-game-4-win/live/", 
            "description": "The reigning champs evened the series after falling into an 0-2 hole", 
            "title": "Nuggets vs. Timberwolves score: Dominant Nikola Jokic, near-perfect Aaron Gordon lift Denver to Game 4 win - CBS Sports"
        }, 
        {
            "url": "https://www.wbaltv.com/article/explosive-precision-cuts-at-key-bridge-collapse-site-postponed/60769239", 
            "description": "This is the second time the Unified Command has postponed the demolition of the remaining truss on the Dali cargo ship.", 
            "title": "Officials postpone explosive precision cuts of Key Bridge - WBAL TV Baltimore"
        }, 
        {
            "url": "https://www.pushsquare.com/news/2024/05/sony-delists-ghost-of-tsushima-pc-from-steam-regions-in-line-with-helldivers-2", 
            "description": "Where it stops, nobody knows", 
            "title": "Sony Delists Ghost of Tsushima PC from Steam Regions in Line with Helldivers 2 - Push Square"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.space.com/spacex-starlink-launch-group-6-58", 
            "description": "Liftoff occurred at 8:53 p.m. ET on Sunday (May 12).", 
            "title": "SpaceX launches 23 Starlink satellites from Florida - Space.com"
        }
    ], 
    "last_updated": "2024-05-14 11:29:15"
}