{
    "news": [
        {
            "url": "https://sports.yahoo.com/ncaa-power-five-conferences-vote-to-approve-28b-settlement-in-house-hubbard-and-carter-cases-001736810.html", 
            "description": "In a landmark agreement that will transform the course of major college athletics, the NCAA has left behind its archaic rules and changed the way it's going ...", 
            "title": "NCAA, Power Five conferences vote to approve $2.8B settlement in House, Hubbard and Carter cases - Yahoo Sports"
        }, 
        {
            "url": "https://www.cbsnews.com/video/justice-department-files-sweeping-antitrust-lawsuit-against-live-nation/", 
            "description": "The Justice Department on Thursday filed an antitrust lawsuit against Ticketmaster and its parent company Live Nation, accusing the concert giant of running an illegal monopoly and driving up prices. The lawsuit, which seeks to break up Live Nation, also accu…", 
            "title": "Justice Department files sweeping antitrust lawsuit against Live Nation - CBS News"
        }, 
        {
            "url": "https://apnews.com/article/trump-bronx-rally-minority-voters-00fae754f78333111c508d6e740a3610", 
            "description": "Former President Donald Trump is campaigning in one of the most Democratic counties in the nation Thursday, holding a rally in the South Bronx. He's hoping to woo minority voters by appearing in one of the most diverse and impoverished neighborhoods in the ci…", 
            "title": "Election 2024: Trump campaigns in the South Bronx, trying to woo Black and Hispanic voters - The Associated Press"
        }, 
        {
            "url": "https://www.cbssports.com/nba/news/celtics-vs-pacers-odds-prediction-2024-nba-eastern-conference-finals-picks-game-2-bets-by-proven-model/", 
            "description": "SportsLine's model has made its NBA picks and predictions for Game 2 of Indiana Pacers vs. Boston Celtics in the 2024 Eastern Conference finals on Thursday", 
            "title": "Celtics vs. Pacers odds, prediction: 2024 NBA Eastern Conference finals picks, Game 2 bets by proven model - CBS Sports"
        }, 
        {
            "url": "https://www.foxnews.com/health/fish-oil-supplements-linked-greater-first-time-heart-attack-risk-not-universally-good-bad", 
            "description": "Taking fish oil supplements could raise the risk of heart attack and stroke, a new study suggests. A cardiologist and two dietitians discuss the potential effects.", 
            "title": "Fish oil supplements linked to greater first-time heart attack risk in study: ‘Not universally good or bad' - Fox News"
        }, 
        {
            "url": "https://www.washingtonpost.com/politics/2024/05/23/ohio-biden-ballot/", 
            "description": "The Republican governor took the move after fellow GOP members in the state assembly were at an impasse to ensure President Biden would be on the November election ballot in his state.", 
            "title": "Ohio governor calls special session to ensure Biden gets on ballot - The Washington Post"
        }, 
        {
            "url": "https://www.foxnews.com/world/us-service-members-injured-working-gaza-humanitarian-aid-critical-condition-defense-officials", 
            "description": "One U.S. service member is in critical condition, while two others sustained injuries unrelated to combat while working a mission to provide humanitarian aid to Gaza.", 
            "title": "3 US service members injured on Gaza humanitarian aid mission, 1 in critical condition: Defense officials - Fox News"
        }, 
        {
            "url": "https://people.com/kelly-rowland-explains-viral-confrontation-cannes-red-carpet-8653403", 
            "description": "\"I have a boundary, and I stand by those boundaries, and that is it,\" said Kelly Rowland regarding recent footage of her in a heated exchange with security at the 2024 Cannes Film Festival.", 
            "title": "Kelly Rowland Explains Viral Confrontation with Security on Cannes Red Carpet: 'I Stood My Ground' - PEOPLE"
        }, 
        {
            "url": "https://www.washingtonpost.com/entertainment/2024/05/23/cassie-response-diddy-hotel-assault-video/", 
            "description": "Cassie Ventura posted a statement to Instagram on Thursday, days after the release of 2016 footage that showed her being brutally assaulted by Sean “Diddy” Combs.", 
            "title": "Cassie speaks out after Diddy assault video: ‘Domestic violence is THE issue’ - The Washington Post"
        }, 
        {
            "url": "https://apnews.com/article/cavaliers-bickerstaff-fired-e1dbec3e48892d523f30484307183918", 
            "description": "J.B. Bickerstaff has been fired as Cleveland’s coach despite leading the Cavaliers through a major rebuild, an injury-ravaged season and into the second round of the NBA playoffs. Bickerstaff’s dismissal came one week after the Cavs were eliminated in five ga…", 
            "title": "Cavaliers fire coach J.B. Bickerstaff despite back-to-back playoff appearances and steady progress - The Associated Press"
        }, 
        {
            "url": "https://arstechnica.com/gadgets/2024/05/pleas-for-open-sourcing-refunds-as-spotify-plans-to-brick-car-thing-devices/", 
            "description": "Spotify stopped making Car Things in July 2022 but kept selling them.", 
            "title": "“Unacceptable”: Spotify bricking Car Thing devices in Dec. without refunds - Ars Technica"
        }, 
        {
            "url": "https://www.cbsnews.com/news/flags-alitos-houses-political-backlash-supreme-court-nears-end-of-term/", 
            "description": "Justice Samuel Alito has come under scrutiny after the New York Times reported two instances of controversial flags flown outside his Virginia and New Jersey houses.", 
            "title": "Flags outside of Alito's houses spark political backlash as Supreme Court nears end of term - CBS News"
        }, 
        {
            "url": "https://nypost.com/2024/05/23/business/dow-plunges-over-600-points-as-chance-of-fed-rate-cut-diminishes/", 
            "description": "The Dow had its worst day of 2024. The weakness was widespread and overshadowed another blowout profit report from market heavyweight Nvidia.", 
            "title": "Dow plunges over 600 points as chance of Fed rate cut diminishes - New York Post "
        }, 
        {
            "url": "https://ktla.com/news/local-news/watch-live-police-work-to-clear-new-pro-palestinian-protest-encampment-at-ucla/", 
            "description": "Law enforcement officers in riot gear took quick action to dismantle another encampment built by pro-Palestinian demonstrators on the campus of UCLA on Thursday. Sky5 aerial footage showed the encampment on Kerckhoff Patio, which involved wood barricades and …", 
            "title": "WATCH LIVE: Police work to clear new pro-Palestinian protest encampment at UCLA - KTLA Los Angeles"
        }, 
        {
            "url": "https://finance.yahoo.com/news/nvidia-stock-pops-9-tops-1000-after-earnings-beat-forecasts-announces-stock-split-and-dividend-hike-202405060.html", 
            "description": "Nvidia reported its fiscal first quarter earnings after the bell on Wednesday, beating analysts' expectations on the top and bottom lines while raising its...", 
            "title": "Nvidia stock pops 9%, tops $1,000 after earnings beat forecasts, announces stock split and dividend hike - Yahoo Finance"
        }, 
        {
            "url": "https://www.axios.com/2024/05/23/clarence-thomas-supreme-court-racial-segregation", 
            "description": null, 
            "title": "Clarence Thomas attacks Brown v. Board ruling in South Carolina voting map opinion - Axios"
        }, 
        {
            "url": "https://apnews.com/article/biden-robocalls-ai-new-hampshire-charges-fines-9e9cc63a71eb9c78b9bb0d1ec2aa6e9c", 
            "description": "A former New Hampshire Democratic Party chair whose phone number was spoofed in artificial intelligence-generated robocalls mimicking President Joe Biden's voice ahead of New Hampshire's presidential primary says today's charges related to the case show the s…", 
            "title": "Political consultant behind fake Biden robocalls faces $6 million fine and criminal charges - The Associated Press"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c900qz4wll4o", 
            "description": "Russia's president seems to be acting on the late Wagner chief's warnings, but in his own time.", 
            "title": "Rosenberg: Russian President Putin's military purge echoes Prigozhin's call to act - BBC.com"
        }, 
        {
            "url": "https://www.espn.com/nfl/story/_/id/40204970/giants-daniel-jones-no-doubt-ready-week-1", 
            "description": "Giants quarterback Daniel Jones is already back on the field practicing during OTAs and has no doubt he will be ready for Week 1 against the Vikings.", 
            "title": "Giants' Daniel Jones has no doubt he'll be ready for Week 1 - ESPN"
        }
    ], 
    "last_updated": "2024-05-25 04:00:48"
}