{
    "news": [
        {
            "url": "https://www.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-05-19-24/index.html", 
            "description": "An Israeli airstrike on a refugee camp in central Gaza has killed at least 35 people, including seven children, according to hospital officials. Meanwhile, Israeli war cabinet divisions are spilling into the open. Follow live updates.", 
            "title": "Devastation in Gaza as Israel wages war on Hamas: Live updates - CNN"
        }, 
        {
            "url": "https://www.motorsport.com/f1/news/mclaren-unsure-norris-could-have-passed-verstappen-to-win-f1-imola-gp/10612986/", 
            "description": "McLaren Formula 1 team principal Andrea Stella says he's unsure if he agrees that with a few more laps Lando Norris would have passed Max Verstappen to win in Imola.", 
            "title": "McLaren unsure Norris could have passed Verstappen to win F1 Imola GP - Motorsport.com"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cyrr61417ylo", 
            "description": "His statement comes after CCTV appeared to show him attacking singer Casandra \"Cassie\" Ventura.", 
            "title": "Sean 'Diddy' Combs apologises for 'inexcusable' behaviour - BBC.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/19/world/blue-origin-rocket-ns-25-mission-scn/index.html", 
            "description": "The NS-25 mission lifted off on Sunday, ending a lengthy hiatus from crewed launches prompted by a failed uncrewed test flight in 2022.", 
            "title": "Blue Origin launches six tourists to the edge of space after nearly two-year hiatus - CNN"
        }, 
        {
            "url": "https://www.aljazeera.com/sports/liveblog/2024/5/19/live-manchester-city-vs-west-ham-united-english-premier-league-football", 
            "description": "Follow our build-up, team news and text commentary as Manchester City seek to secure a fourth successive Premier League.", 
            "title": "LIVE: Manchester City vs West Ham United – English Premier League football - Al Jazeera English"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/19/biden-gets-mild-applause-but-no-jeers-in-commencement-speech-describing-heartbreaking-situation-in-gaza-00158794", 
            "description": null, 
            "title": "Biden gets mild applause but no jeers in commencement speech describing 'heartbreaking' situation in Gaza - POLITICO"
        }, 
        {
            "url": "https://variety.com/2024/film/box-office/box-office-if-film-opening-weekend-underperform-john-krasinski-1236009476/", 
            "description": "John Krasinski's \"IF\" fell slightly short of box office expectations but still topped the North American charts.", 
            "title": "Box Office: John Krasinski’s ‘IF’ Debuts at No. 1 With Soft $35 Million - Variety"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/19/jasmine-crockett-backs-claim-calling-mtg-racist-00158792", 
            "description": null, 
            "title": "Jasmine Crockett backs claim calling Marjorie Taylor Greene 'racist' - POLITICO"
        }, 
        {
            "url": "https://apnews.com/article/iran-helicopter-raisi-b483ba75e4339cfb0fe00c7349d023b8", 
            "description": "Iranian officials say a rescue operation is underway after a helicopter carrying Iranian President Ebrahim Raisi suffered a “hard landing.\" Raisi was traveling Sunday in Iran’s East Azerbaijan province. State TV said the incident happening near Jolfa, a city …", 
            "title": "Helicopter carrying Iran's president suffers a 'hard landing,' state TV says, and rescue is underway - The Associated Press"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.foxnews.com/world/netanyahu-rival-threatens-quit-war-cabinet-gaza-strategy", 
            "description": "Israeli Prime Minister Benjamin Netanyahu is facing a revolt from members of his war cabinet, with Benny Gantz demanding a new strategy by June 8.", 
            "title": "Netanyahu rival threatens to quit war cabinet over Gaza strategy - Fox News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/19/sport/oleksandr-usyk-tyson-fury-reaction-spt-intl/index.html", 
            "description": "Once the immediate shock and joy at becoming the undisputed heavyweight world champion had subsided, Oleksandr Usyk’s thoughts turned to his late father who passed away in 2012.", 
            "title": "Oleksandr Usyk pays tearful tribute to late father after becoming undisputed heavyweight world champion - CNN"
        }, 
        {
            "url": "https://www.businessinsider.com/ukraine-bombs-port-where-russias-navy-took-refuge-crimea-attacks-2024-5", 
            "description": "Ukraine missiles and drones hit the  Novorossiysk where Russia's Black Sea fleet took refuge after repeated attacks on its Crimea base, reports said.", 
            "title": "Ukraine bombs port where Russia's navy took refuge after Crimea attacks: report - Business Insider"
        }, 
        {
            "url": "https://www.space.com/meteor-green-fireball-spain-portugal-may-19-2024", 
            "description": "The bright green fireball has stunned the internet and social media users.", 
            "title": "Bright green fireball lights up the skies over Portugal and Spain (photos) - Space.com"
        }, 
        {
            "url": "https://www.wsj.com/world/middle-east/leading-republican-lawmaker-chastises-biden-in-israels-parliament-92e15964", 
            "description": null, 
            "title": "Leading Republican Lawmaker Chastises Biden in Israel's Parliament - The Wall Street Journal"
        }, 
        {
            "url": "http://9to5google.com/2024/05/19/android-on-device-ai/", 
            "description": "On-device AI is a big priority for Android going forward, and Google shared more developer resources at I/O 2024...", 
            "title": "Google on what on-device AI is good at, more Android apps that use Gemini Nano coming - 9to5Google"
        }, 
        {
            "url": "https://www.hindustantimes.com/world-news/us-news/houston-power-outages-thousands-remain-without-electricity-amid-scorching-heat-after-deadly-storm-101716117421602.html", 
            "description": "In addition to the heat, the Houston area could face poor air quality during the weekend.", 
            "title": "Houston power outages: Thousands remain without electricity amid scorching heat after deadly storm - Hindustan Times"
        }, 
        {
            "url": "https://www.businessinsider.com/giuliani-boasted-he-would-avoid-indictment-officials-struck-at-his-80th-bday-party-2024-5", 
            "description": "While celebrating his 80th birthday, Rudy Giuliani was served an indictment notice related to alleged efforts in Arizona to overturn the 2020 election.", 
            "title": "Giuliani boasted he would avoid indictment — officials struck at his 80th b'day party - Business Insider"
        }, 
        {
            "url": "https://www.reuters.com/world/uk/uk-spend-127-bln-compensation-infected-blood-scandal-2024-05-19/", 
            "description": null, 
            "title": "UK to spend $12.7 billion on compensation in infected-blood scandal - Reuters"
        }, 
        {
            "url": "https://www.space.com/nasa-pulsed-plasma-rocket-mars-2-months-howe-industries", 
            "description": "\"The PPR enables a whole new era in space exploration.\"", 
            "title": "NASA-funded pulsed plasma rocket concept aims to send astronauts to Mars in 2 months - Space.com"
        }
    ], 
    "last_updated": "2024-05-20 18:30:09"
}