{
    "news": [
        {
            "url": "https://www.cnbc.com/2024/05/13/nrf-rejects-shein-membership-as-retailer-pursues-us-ipo.html", 
            "description": "If Shein gets a stamp of approval from the NRF, it could help legitimize the retailer in the eyes of lawmakers and clear its path to a U.S. IPO.", 
            "title": "Shein's U.S. charm offensive and IPO could hinge on NRF membership. So far, it's been rejected - CNBC"
        }, 
        {
            "url": "https://www.wsj.com/finance/investing/investors-crowd-into-soft-landing-trade-ahead-of-crucial-inflation-data-b7cf5049", 
            "description": "Stocks and bonds have rallied ahead of Wednesday’s consumer-price index report", 
            "title": "Investors Crowd Into Soft-Landing Trade Ahead of Crucial Inflation Data - The Wall Street Journal"
        }, 
        {
            "url": "https://finance.yahoo.com/news/bidens-coming-new-tariffs-on-china-reflect-lessons-learned-130114807.html", 
            "description": "A sweeping White House move on China tariffs that is expected to be unveiled early next week \"reflects lessons learned,\" according to a former official who...", 
            "title": "Biden's coming new tariffs on China reflect 'lessons learned' - Yahoo Finance"
        }, 
        {
            "url": "https://www.reuters.com/world/middle-east/israeli-forces-step-up-attacks-jabalia-camp-rafah-gaza-2024-05-13/", 
            "description": null, 
            "title": "Israeli forces step up attacks on Jabalia camp and Rafah in Gaza - Reuters"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-stormy-daniels-michael-cohen-hush-money-f96dd7289cf952145cdd6737b29add3d", 
            "description": "The star prosecution witness in Donald Trump’s hush money trial is set to take the stand with testimony that could help shape the outcome of the first criminal case against an American president. Michael Cohen, Trump’s former lawyer and personal fixer, is by …", 
            "title": "Trump hush money trial: Star witness Michael Cohen set to testify - The Associated Press"
        }, 
        {
            "url": "https://newatlas.com/medical/pig-kidney-transplant-death/", 
            "description": "The first successful transplant of a genetically modified pig kidney into a human recipient is still being regarded as a medical milestone and success, even though the recipient has sadly passed away.", 
            "title": "World-first pig kidney transplant recipient has died - New Atlas"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cy9xzzy57lyo", 
            "description": "Heavy rains washed volcanic debris and pebbles down Mount Marapi in Indonesia.", 
            "title": "Indonesia: Floods and cold lava from Marapi volcano kill 41 - BBC.com"
        }, 
        {
            "url": "https://nypost.com/2024/05/13/us-news/antony-blinken-delivers-strongest-public-rebuke-of-israel-yet-get-out-of-gaza/", 
            "description": "Blinken also directly addressed the U.S. withholding high payload bombs to Israel.", 
            "title": "Blinken delivers strongest public rebuke of Israel yet: 'Get out of Gaza' - New York Post "
        }, 
        {
            "url": "https://www.reuters.com/world/asia-pacific/indonesias-mt-ibu-erupts-spewing-ash-clouds-2024-05-13/", 
            "description": "Indonesia's Ibu volcano erupted on Monday morning, spewing thick columns of grey ash several kilometres into the sky, the country's volcanology agency said.", 
            "title": "Indonesia's Mt Ibu erupts, spewing ash clouds - Reuters"
        }, 
        {
            "url": "https://www.reuters.com/world/europe/catalans-vote-election-that-offers-new-chance-exiled-separatist-leader-2024-05-12/", 
            "description": "The result dealt a serious blow to dreams of independence in the wealthy northeastern region.", 
            "title": "Spain's Socialists hail 'new era' in Catalonia as separatist support dims in elections - Reuters"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.espn.com/nba/story/_/id/40136186/denver-nuggets-even-series-minnesota-timberwolves-2-2", 
            "description": "In a span of 20 dizzying seconds of the second quarter, the Nuggets scored eight points to sprint into halftime of Game 4 up by 15, setting the stage for a pivotal 115-107 victory over the Timberwolves that evened series at 2-2.", 
            "title": "Denver Nuggets even series with Minnesota Timberwolves 2-2 - ESPN"
        }, 
        {
            "url": "https://chicago.suntimes.com/horoscopes/2024/05/13/horoscopes-today-monday-may-13-2024", 
            "description": null, 
            "title": "Horoscope for Monday, May 13, 2024 - Chicago Sun-Times"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/12/europe/sergei-shoigu-putin-replaces-defense-minister-intl-latam/index.html", 
            "description": "Russian President Vladimir Putin has replaced his defense minister and close ally Sergei Shoigu with a civilian economist, a major reshuffle of military leadership more than two-years after Moscow’s grinding war against Ukraine has sent defense spending soari…", 
            "title": "Putin replaces Russia’s defense minister with a civilian as Ukraine war rages and defense spending spirals - CNN"
        }, 
        {
            "url": "http://deadline.com/2024/05/john-oliver-eurovision-windows95man-champion-1235913452/", 
            "description": "John Oliver took the first part of Last Week Tonight to talk about the Eurovision Song Contest and highlighted the act from Finland, known as Windows95man.", 
            "title": "John Oliver Calls Eurovision’s Windows95man His Champion - Deadline"
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-12/morgan-stanley-to-add-100-jobs-in-paris-hub-le-maire-says", 
            "description": "Amazon.com Inc., Pfizer Inc., Microsoft Corp. and Morgan Stanley are among the companies poised to boost their presence in France, with a flurry of new foreign investments to be unveiled Monday.", 
            "title": "Amazon, Morgan Stanley, Pfizer to Announce French Projects - Bloomberg"
        }, 
        {
            "url": "https://apnews.com/article/israel-gaza-war-fallen-soldiers-memorial-9e5e35ef6352c79ab59e7f3b8a7f7a1b", 
            "description": "Memorial Day is always a somber occasion in Israel. But it has taken on a profound and raw sadness coupled with percolating anger in the aftermath of Oct. 7. Families of the fallen and broad segments of the public are demanding accountability from Israeli lea…", 
            "title": "Profound sadness, anger grips Israel on Memorial Day - The Associated Press"
        }, 
        {
            "url": "https://www.pushsquare.com/news/2024/05/sony-delists-ghost-of-tsushima-pc-from-steam-regions-in-line-with-helldivers-2", 
            "description": "Where it stops, nobody knows", 
            "title": "Sony Delists Ghost of Tsushima PC from Steam Regions in Line with Helldivers 2 - Push Square"
        }, 
        {
            "url": "https://www.indystar.com/story/sports/nba/pacers/2024/05/12/why-the-pacers-didnt-want-to-talk-about-shutting-down-knicks-brunson/73585867007/", 
            "description": "After giving up 119 points per game against the Knicks in Games 1-3, the Pacers had one of their best defensive performances of the year in Game 4.", 
            "title": "Why the Pacers defense shut down Knicks, Jalen Brunson but didn't want to talk about it - IndyStar"
        }
    ], 
    "last_updated": "2024-05-14 13:29:24"
}