{
    "news": [
        {
            "url": "https://apnews.com/article/india-mumbai-rains-billboard-collapse-deaths-3e370788d5071f65f9a1c0f7e88ae3da", 
            "description": "A large billboard that collapsed amid raging thunderstorms in Mumbai killed at least 14 people and injured 75 others, reports said on Tuesday. A rescue operation was ongoing Tuesday morning, and authorities told the Press Trust of India news agency that 89 pe…", 
            "title": "Mumbai Billboard collapse: At least 14 killed, 74 injured - The Associated Press"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/14/home-depot-hd-q1-2024-earnings-.html", 
            "description": "Home Depot reported first-quarter earnings as it tries to grow sales with home professionals in a tough housing market.", 
            "title": "Home Depot misses on revenue, as high interest rates hurt sales - CNBC"
        }, 
        {
            "url": "https://nypost.com/2024/05/14/entertainment/kelly-clarkson-admits-to-using-weight-loss-drug-after-losing-60-pounds/", 
            "description": "While the “American Idol” alum didn’t disclose the name of the weight loss drug she’s been taking, she insisted it was not Ozempic.", 
            "title": "Kelly Clarkson admits to using weight loss drug after losing 60 pounds - New York Post "
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/14/anglo-american-to-spin-off-de-beers-as-bhp-takeover-pressure-mounts.html", 
            "description": "Anglo American shares fell over 3% early Tuesday after it announced plans to spin off its highly prized De Beers diamond business.", 
            "title": "Diamond giant De Beers faces spin-off amid wider restructuring as Anglo American takeover pressure mounts - CNBC"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/14/maryland-democratic-senate-primary-larry-hogan-00157399", 
            "description": null, 
            "title": "Dems' ugliest Senate primary ends with a bad grand prize: Facing Larry Hogan - POLITICO"
        }, 
        {
            "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/wegovy-weight-loss-sustained-four-years-trial-novo-nordisk-says-2024-05-13/", 
            "description": null, 
            "title": "Wegovy weight loss sustained for four years in trial, Novo Nordisk says - Reuters"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy93b3JsZC1ldXJvcGUtNjkwMDc0NjXSATJodHRwczovL3d3dy5iYmMuY29tL25ld3Mvd29ybGQtZXVyb3BlLTY5MDA3NDY1LmFtcA?oc=5", 
            "description": null, 
            "title": "Georgia to vote on controversial law that sparked mass protests - BBC.com"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cg300jek94zo", 
            "description": "Unverified video shows protesters throwing food packages onto the ground before stomping on them.", 
            "title": "Israeli protesters attack Gaza aid trucks in West Bank - BBC.com"
        }, 
        {
            "url": "https://apnews.com/article/russia-ukraine-war-blinken-us-military-aid-41df75260903f6b9527fbf3a1a44c815", 
            "description": "U.S. Secretary of State Antony Blinken has arrived in Kyiv on an unannounced diplomatic mission to reassure Ukraine that it has American support as it struggles to defend against increasingly intense Russian attacks. The two-day visit starting Tuesday comes l…", 
            "title": "Russia-Ukraine war: Blinken visits Ukraine to affirm US support for Kyiv - The Associated Press"
        }, 
        {
            "url": "https://thehackernews.com/2024/05/apple-and-google-launch-cross-platform.html", 
            "description": "pple and Google just rolled out a cross-platform feature called \"Detecting Unwanted Location Trackers\" (DULT) on iOS and Android to protect users.", 
            "title": "Apple and Google Launch Cross-Platform Feature to Detect Unwanted Bluetooth Tracking Devices - The Hacker News"
        }, 
        {
            "url": "https://www.espn.com/nba/story/_/id/40143162/thunder-rally-mavs-final-minutes-even-series", 
            "description": "In \"probably the most meaningful game I've played in my career,\" Thunder superstar Shai Gilgeous-Alexander took over down the stretch to lead Oklahoma City to a series-tying Game 4 win in Dallas on Monday night.", 
            "title": "Shai Gilgeous-Alexander rallies Thunder to Game 4 win vs. Mavs - ESPN"
        }, 
        {
            "url": "https://www.axios.com/2024/05/13/michael-cohen-new-york-criminal-trial-2024", 
            "description": null, 
            "title": "\"Just do it\": Michael Cohen says Trump told him, on Stormy Daniels payment - Axios"
        }, 
        {
            "url": "https://apnews.com/article/westminster-kennel-club-dog-show-5f3a2f287021645f84fb437ef9419a54", 
            "description": "The 148th Westminster Kennel Club dog show is underway. Monday marked the start of the traditional judging that leads to the best in show prize, to be awarded Tuesday night at the USTA Billie Jean King National Tennis Center in New York. Semifinals began Mond…", 
            "title": "At Westminster dog show, a display of dogs and devotion - The Associated Press"
        }, 
        {
            "url": "https://www.ksl.com/article/51011167/utah-senators-blast-pause-in-weapons-to-israel-as-reprehensible-dithering", 
            "description": "Utah Sens. Mike Lee and Mitt Romney have criticized the White House over its decision to withhold some military aid to Israel.", 
            "title": "Utah senators blast pause in weapons to Israel as 'reprehensible,' 'dithering' - KSL.com"
        }, 
        {
            "url": "https://www.axios.com/2024/05/13/wildfire-canada-evacuations-air-quality-us-states", 
            "description": null, 
            "title": "Canada wildfires hit northern U.S. air quality - Axios"
        }, 
        {
            "url": "https://www.prideofdetroit.com/2024/5/13/24155973/video-detroit-lions-quarterback-jared-goff-paid-contract-extension", 
            "description": "Meko and Morgan discuss the Detroit Lions extending quarterback Jared Goff on the Pride of Detroit YouTube Channel.", 
            "title": "Instant reactions to Detroit Lions quarterback Jared Goff getting PAID - Pride Of Detroit"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=qAIPoCgnLlo", 
            "description": "Travis Kelce supports his ladylove, Taylor Swift, in the City of Lights! The NFL star watched the singer's fourth and final night of her Eras tour stop in Pa...", 
            "title": "Travis Kelce REACTS to Taylor Swift Performing TTPD Songs Rumored About Him - Entertainment Tonight"
        }, 
        {
            "url": "https://www.cbsnews.com/news/biden-to-announce-new-100-tariffs-on-chinese-evs/", 
            "description": "The tariff on electric vehicles from China is currently 25%.", 
            "title": "Biden to announce new 100% tariffs on Chinese EVs - CBS News"
        }, 
        {
            "url": "https://apnews.com/article/whitey-bulger-prison-killing-plea-change-8f9ee1b9d16989bd69e144c80225b1a0", 
            "description": "Three men charged in the 2018 prison killing of notorious Boston gangster James “Whitey” Bulger have reached plea deals with prosecutors. The plea deals for Fotios “Freddy” Geas, Paul J. DeCologero and Sean McKinnon were disclosed Monday in court filings near…", 
            "title": "3 men charged in Whitey Bulger's 2018 prison killing have plea deals, prosecutors say - The Associated Press"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/13/24155982/sony-playstation-co-ceo-hermen-hulst-hideaki-nishino", 
            "description": "Sony has appointed co-CEOs to lead its PlayStation business. Hermen Hulst and Hideaki Nishino will takeover on June 1st, months after Jim Ryan retired.", 
            "title": "Sony names new PlayStation leaders following Jim Ryan's retirement - The Verge"
        }
    ], 
    "last_updated": "2024-05-15 12:07:38"
}