{
    "news": [
        {
            "url": "https://thehill.com/homenews/campaign/4672445-joe-biden-donald-trump-atlanta-campaign-stop-remarks/", 
            "description": "President Biden during a campaign reception in Atlanta urged his supporters to stand up against former President Trump, as the two party front-runners head toward a rematch in November. Biden in remarks Saturday at Mary Mac’s Tea Room, argued that Trump is on…", 
            "title": "Biden urges Atlanta voters to stand up against Trump: ‘He’s running for revenge’ - The Hill"
        }, 
        {
            "url": "https://sports.yahoo.com/live/pga-championship-round-3-live-updates-leaderboard-morikawa-schauffele-share-lead-after-wild-moving-day-at-valhalla-125427676.html", 
            "description": "Xander Schauffele held a one-shot lead entering play on Saturday at Valhalla.", 
            "title": "PGA Championship Round 3 live updates, leaderboard: Morikawa, Schauffele share lead after wild Moving Day at Valhalla - Yahoo Sports"
        }, 
        {
            "url": "https://www.espn.com/horse-racing/story/_/id/40173905/seize-grey-wins-preakness-stakes-denies-mystik-dan", 
            "description": "Seize the Grey won the 149th running of the Preakness Stakes on Saturday, denying Kentucky Derby winner Mystik Dan a Triple Crown bid.", 
            "title": "Seize the Grey wins Preakness, denies Mystik Dan - ESPN"
        }, 
        {
            "url": "http://www.nbcchicago.com/news/local/driver-struck-killed-glenview-teenager-was-going-122-mph-time-fatal-crash-court-docs/3440754/", 
            "description": "A 21-year-old Northbrook man charged in a Glenview fatal crash that left a 17-year-old high school student dead was ordered to remain detained in a bond court hearing Saturday, as court documents revealed troubling details on the moments leading up to the cra…", 
            "title": "Driver who struck and killed Glenview teenager was going 122 mph at time of fatal crash: court docs - NBC Chicago"
        }, 
        {
            "url": "https://www.etonline.com/kristin-chenoweth-says-she-was-severely-abused-in-the-past-after-posting-about-sean-diddy-combs", 
            "description": "The actress shared that she was 'deeply injured physically and spiritually' in a past relationship.", 
            "title": "Kristin Chenoweth Says She Was 'Severely Abused' After Posting About Sean 'Diddy' Combs Video - Entertainment Tonight"
        }, 
        {
            "url": "https://www.bbc.com/news/videos/cv2xgdynp91o", 
            "description": null, 
            "title": "Ros Atkins on... Georgia's protests, Russia and the West - BBC.com"
        }, 
        {
            "url": "https://www.startribune.com/in-a-surprise-minnesota-republicans-back-royce-white-to-run-against-amy-klobuchar/600366972/", 
            "description": "The former basketball star-turned-activist was introduced by former Trump adviser Steve Bannon.", 
            "title": "In a surprise, Minnesota Republicans back Royce White to run against Amy Klobuchar - Star Tribune"
        }, 
        {
            "url": "https://ambcrypto.com/memecoins-just-better-gme-amc-drop-raises-questions/", 
            "description": "GameStop and AMC's volatility prompts market behavior discussions as memecoins potentially overshadow meme stocks.", 
            "title": "Memecoins ‘just better’: GME, AMC drop raises questions - AMBCrypto News"
        }, 
        {
            "url": "https://www.cbsnews.com/news/multiple-fatalities-shooting-columbus-ohio-italian-village-neighborhood/", 
            "description": "Columbus Deputy Chief Gregory Bodker told reporters that officers arrived to find a \"very chaotic scene.\"", 
            "title": "3 killed, 3 wounded in early-morning shooting in Columbus, Ohio - CBS News"
        }, 
        {
            "url": "http://www.nydailynews.com/2024/05/18/ben-affleck-without-wedding-ring-moves-out-jlo-separated/", 
            "description": "Ben Affleck has officially been spotted without his wedding ring amid reported “issues” with wife Jennifer Lopez — including living under separate roofs.", 
            "title": "Ben Affleck seen without wedding ring amid J.Lo split rumors - New York Daily News"
        }, 
        {
            "url": "https://www.washingtonpost.com/nation/2024/05/18/pelosi-attacker-depape-sentence/", 
            "description": "Prosecutors say the judge should have given the attacker, David DePape, a chance to speak in court before he was sentenced to 30 years in prison.", 
            "title": "Prosecutors ask to reopen sentencing so Paul Pelosi's attacker may speak - The Washington Post"
        }, 
        {
            "url": "https://variety.com/2024/film/festivals/selena-gomez-emilia-perez-cannes-standing-ovation-1236008254/", 
            "description": "‘Emilia Perez,’ starring Zoe Saldaña, Selena Gomez and Karla Sofía Gascón, earned a standing ovation at the 2024 Cannes Film Festival.", 
            "title": "Selena Gomez Weeps as ‘Emilia Pérez’ Earns Biggest Cannes Standing Ovation So Far at 9 Minutes - Variety"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/18/politics/rudy-giuliani-served-arizona-indictment/index.html", 
            "description": "Rudy Giuliani was served Friday with notice of his indictment related to an alleged scheme to overturn the 2020 election results in Arizona, according to Arizona Attorney General Kris Mayes.", 
            "title": "Rudy Giuliani served with Arizona indictment at 80th birthday bash - CNN"
        }, 
        {
            "url": "https://www.businessinsider.com/idf-claims-hezbollah-hit-israels-missile-detecting-airship-report-2024-5", 
            "description": "The sytem was designed to add to Israel's air defenses by detecting incoming missiles and drones, officials have said, per The Times of Israel.", 
            "title": "IDF claims Hezbollah hit Israel's missile-detecting airship: report - Business Insider"
        }, 
        {
            "url": "https://www.courier-journal.com/story/news/local/2024/05/18/scottie-scheffler-arrest-louisville-mayor-says-no-body-cam-of-incident/73748175007/", 
            "description": "The mayor said other footage shot from another angle will be released in the coming days.", 
            "title": "Scottie Scheffler arrest: Louisville mayor says no body cam of incident - Courier Journal"
        }, 
        {
            "url": "https://www.newsweek.com/lauren-boebert-blasts-marjorie-taylor-greene-after-viral-hearing-1902193", 
            "description": "A House committee hearing erupted into chaos on Thursday night after a squabble between Greene and Representative Jasmine Crockett.", 
            "title": "Lauren Boebert Puts Marjorie Taylor Greene on Blast After Viral Hearing - Newsweek"
        }, 
        {
            "url": "https://abcnews.go.com/International/wireStory/yemens-houthi-rebels-launch-missile-strikes-oil-tanker-110363563", 
            "description": "Ballistic missile damaged a Panama-flagged, Greek-owned vessel.", 
            "title": "Yemen's Houthi rebels launch a missile that strikes an oil tanker in the Red Sea, US military says - ABC News"
        }, 
        {
            "url": "https://www.espn.com/boxing/story/_/id/40152003/tyson-fury-vs-oleksandr-usyk-live-boxing-results-analysis", 
            "description": "Fury and Usyk fight Saturday to crown the first undisputed heavyweight champ in the four-belt era. Follow live.", 
            "title": "Tyson Fury vs. Oleksandr Usyk live results and analysis - ESPN"
        }, 
        {
            "url": "https://www.thewrap.com/emma-stone-sex-scenes-kinds-of-kindness-press-conference-cannes/", 
            "description": "Emma Stone was bombarded with questions about sex scenes in her new film \"Kinds of Kindness\" at the uneasy press conference for the film in Cannes.", 
            "title": "Emma Stone Bombarded With Sex Scenes Questions at Cannes - TheWrap"
        }, 
        {
            "url": "https://www.space.com/nasa-prefire-polar-climate-cubesats", 
            "description": "Heat emissions from Earth's poles are something we know surprisingly little about.", 
            "title": "NASA's PREFIRE mission is ready to unlock the mysteries of Earth's poles - Space.com"
        }
    ], 
    "last_updated": "2024-05-20 01:30:43"
}