{
    "news": [
        {
            "url": "https://www.washingtonpost.com/wellness/2024/05/08/screening-mammograms-insurance/", 
            "description": "A national health panel has recommended that women start getting routine screening mammograms every two years at age 40. But that doesn’t mean you can’t get them more often.", 
            "title": "Here’s what the new screening mammogram guidelines mean for women - The Washington Post"
        }, 
        {
            "url": "https://www.cbssports.com/nfl/news/2024-nfl-schedule-release-tentatively-set-for-may-15-how-to-watch-stream-plus-what-we-know-about-the-games/", 
            "description": "The release of the 2024 NFL schedule is less than 10 days away", 
            "title": "2024 NFL schedule release tentatively set for May 15: How to watch, stream plus top games and what we know - CBS Sports"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LnJldXRlcnMuY29tL3dvcmxkL3VzL2ZpdmUtdGFrZWF3YXlzLXN0b3JteS1kYW5pZWxzLXRlc3RpbW9ueS1kb25hbGQtdHJ1bXBzLXRyaWFsLTIwMjQtMDUtMDgv0gEA?oc=5", 
            "description": null, 
            "title": "Stormy Daniels' testimony at Donald Trump's trial: Five takeaways - Reuters"
        }, 
        {
            "url": "https://apnews.com/article/israel-hamas-war-news-05-08-2024-495e6dabfdddc5587bd20e71b6ad421d", 
            "description": "The Israeli military says it has reopened the Kerem Shalom crossing into Gaza but a United Nations agency says no aid has yet entered. The key terminal for the entry of humanitarian aid was closed over the weekend after a Hamas rocket attack killed four Israe…", 
            "title": "Israel-Hamas war: Kerem Shalom crossing into Gaza reopens after rocket attack - The Associated Press"
        }, 
        {
            "url": "https://finance.yahoo.com/news/stock-market-today-us-futures-slip-amid-earnings-rush-fed-teeters-121113734.html", 
            "description": null, 
            "title": "Stock market today: US futures slip amid earnings rush, Fed teeters - Yahoo Finance"
        }, 
        {
            "url": "https://nypost.com/2024/05/08/entertainment/prince-harry-wont-see-king-charles-after-making-certain-demands-expert/", 
            "description": "The Duke of Sussex’s reps confirmed to The Post that he will not be meeting up with his estranged father in London.", 
            "title": "'Very difficult' Prince Harry won't see King Charles after making 'certain demands': expert - New York Post "
        }, 
        {
            "url": "https://www.koco.com/article/thunder-okc-mavericks-game-1-semifinals-sga/60725901", 
            "description": "Gilgeous-Alexander got the best of the matchup with Dallas’ Luka Doncic, a fellow MVP finalist", 
            "title": "Gilgeous-Alexander has 29 points to help Thunder roll past Mavericks in Game 1 of West semifinals - KOCO Oklahoma City"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c72pqlgqe4jo", 
            "description": "TikTok said the measure was an \"extraordinary intrusion on free speech rights\".", 
            "title": "TikTok sues to block US law which could ban app - BBC.com"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/8/russia-unleashes-massive-barrage-targeting-ukrainian-energy-infrastructur", 
            "description": "Ukraine continues to call for more weapons as Russia seeks to batter industry and resistance.", 
            "title": "Russia unleashes ‘massive’ barrage targeting Ukraine energy infrastructure - Al Jazeera English"
        }, 
        {
            "url": "https://www.rockpapershotgun.com/disgruntled-helldivers-2-fans-start-petition-to-bring-back-fired-community-manager", 
            "description": "Fans of Helldivers 2 have started a petition asking developers Arrowhead to reinstate a fired employee in charge of community management.", 
            "title": "Disgruntled Helldivers 2 fans start petition to bring back fired community manager - Rock Paper Shotgun"
        }, 
        {
            "url": "https://www.cbsnews.com/news/cruise-ship-worker-stabbings-scissors-norwegian-encore-alaska/", 
            "description": "The worker stabbed a woman and two guards who tried to intervene before being subdued and held in a \"shipboard jail,\" the affidavit says.", 
            "title": "Cruise worker accused of stabbing woman and 2 security guards with scissors on ship headed to Alaska - CBS News"
        }, 
        {
            "url": "https://www.bostonglobe.com/2024/05/08/metro/bird-flu-human-spillover-risk-h5n1/", 
            "description": "As a highly pathogenic strain of avian influenza spreads through the nation’s farms, local scientists are racing to answer that key question.", 
            "title": "What is the risk of bird flu spillover in humans? - The Boston Globe"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/08/ftx-bankruptcy-most-customers-of-crypto-firm-will-get-all-money-back.html", 
            "description": "FTX estimates that it owes creditors around $11.2 billion. FTX said it has between $14.5 billion and $16.3 billion to distribute to creditors.", 
            "title": "FTX says most customers of the bankrupt crypto exchange will get all their money back - CNBC"
        }, 
        {
            "url": "https://www.washingtonpost.com/dc-md-va/2024/05/08/gwu-protest-encampment-dc-police-arrests/", 
            "description": "D.C.’s police chief and mayor are scheduled to testify on Capitol Hill about the previous refusal of police to move on the demonstrators.", 
            "title": "D.C. police begin clearing GWU protest encampment - The Washington Post"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3Lm5wci5vcmcvMjAyNC8wNS8wOC8xMjQ5NTkxNTU0L3ZlbnVzLWVhcnRoLW1hcnMtcGxhbmV0LXNpYmxpbmdz0gEA?oc=5", 
            "description": null, 
            "title": "Venus looked a lot like Earth when they first formed - NPR"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cm54pp11x3go", 
            "description": "Serbia has been deepening its relationship with China while continuing talks to join the EU.", 
            "title": "China's Xi Jinping gets red-carpet welcome in Serbia - BBC.com"
        }, 
        {
            "url": "https://www.foxnews.com/politics/biden-administration-confirms-paused-shipment-bombs-israel-over-opposition-operation-rafah", 
            "description": "The Biden administration has paused shipments of two types of precision bombs to Israel because of the administration's opposition to Israel's operation in Rafah.", 
            "title": "Biden administration confirms paused shipment of bombs to Israel over opposition to operation in Rafah - Fox News"
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-68972255", 
            "description": "The former US president's federal trial in Florida is now unlikely to begin before the 2024 election.", 
            "title": "Trump's classified documents trial in Florida indefinitely postponed - BBC.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/08/weather/tornadoes-michigan-tuesday-storms-wednesday/index.html", 
            "description": "Powerful tornadoes and storms swept through southwestern Michigan Tuesday evening, destroying homes and businesses and injuring several residents, scenes that could play out once again in the central and eastern US Wednesday.", 
            "title": "Destructive tornadoes and storms pummel Michigan Tuesday, and millions more face a severe weather threat Wednesday - CNN"
        }, 
        {
            "url": "https://www.sciencealert.com/a-spoonful-of-olive-oil-a-day-could-lower-risk-of-dementia-related-death-by-28", 
            "description": "Mounting evidence suggests adding just a spoonful of olive oil to your diet each day can have powerful health benefits.", 
            "title": "A Spoonful of Olive Oil a Day Could Lower Risk of Dementia-Related Death by 28% - ScienceAlert"
        }
    ], 
    "last_updated": "2024-05-09 14:08:02"
}