{
    "news": [
        {
            "url": "https://www.freep.com/story/news/local/michigan/2024/05/08/tornadoes-tear-through-midwest-with-at-least-2-ripping-west-michigan/73610750007/", 
            "description": "For the first time in Michigan, the National Weather Service issued a tornado emergency, as the storms hit the Kalamazoo area and state's west side.", 
            "title": "Michigan tornadoes damage areas in Portage, Branch and St. Joseph - Detroit Free Press"
        }, 
        {
            "url": "https://www.nbcnews.com/politics/congress/rep-marjorie-taylor-greene-forcing-vote-oust-speaker-johnson-ukraine-a-rcna148389", 
            "description": "Far-right Rep. Majorie Taylor Greene made good on her threat Wednesday and filed a motion to oust Republican Speaker Mike Johnson from power over his decision to pass billions of dollars in military aid for Ukraine.", 
            "title": "House votes overwhelmingly to save Speaker Johnson from Marjorie Taylor Greene's push to oust him - NBC News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/08/politics/joe-biden-interview-cnntv/index.html", 
            "description": "President Joe Biden said for the first time Wednesday he would halt shipments of American weapons to Israel – which he acknowledged have been used to kill civilians in Gaza – if Prime Minister Benjamin Netanyahu orders a major invasion of the city of Rafah.", 
            "title": "Biden says he will stop sending bombs and artillery shells to Israel if they launch major invasion of Rafah - CNN"
        }, 
        {
            "url": "https://www.nbcnews.com/news/sports/shohei-ohtanis-former-translator-plead-guilty-transferring-17-million-rcna151363", 
            "description": "The former translator for Los Angeles Dodgers superstar Shohei Ohtani has agreed to plead guilty to illegally transferring $17 million out of Ohtani's account without his knowledge, authorities said Wednesday.", 
            "title": "Shohei Ohtani’s former translator to plead guilty to transferring $17M from MLB star’s bank account - NBC News"
        }, 
        {
            "url": "https://www.nbcnews.com/news/us-news/4-flight-attendants-arrested-accused-taking-millions-drug-money-domini-rcna151312", 
            "description": "Four flight attendants abused “their privileges as airline employees” and smuggled “millions of dollars of drug money” out of New York City to the Dominican Republic, federal authorities said Wednesday.", 
            "title": "4 flight attendants arrested, accused of taking millions in drug money to Dominican Republic - NBC News"
        }, 
        {
            "url": "https://www.mlb.com/news/paul-skenes-called-up-by-pirates", 
            "description": null, 
            "title": "Paul Skenes called up by Pirates for MLB debut - MLB.com"
        }, 
        {
            "url": "https://spaceflightnow.com/2024/05/08/live-coverage-spacex-to-launch-23-starlink-satellites-on-falcon-9-rocket-from-florida/", 
            "description": null, 
            "title": "SpaceX breaks Space Shuttle pad record with Falcon 9 Starlink mission – Spaceflight Now - Spaceflight Now"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cm54pp11x3go", 
            "description": "Serbia has been deepening its relationship with China while continuing talks to join the EU.", 
            "title": "China's Xi Jinping gets red-carpet welcome in Serbia - BBC.com"
        }, 
        {
            "url": "https://www.huffpost.com/entry/prince-harry-princess-diana-siblings_n_66396555e4b0f72991a74651", 
            "description": "The Duke of Sussex received a warm welcome from the public during his engagement in London on Wednesday.", 
            "title": "2 Of Prince Harry's Family Members Showed Up To Support Him At UK Service - Yahoo Entertainment"
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-08/arm-shares-slip-after-chip-designer-gives-tepid-annual-forecast", 
            "description": "Arm Holdings Plc shares tumbled after the chip designer gave a lukewarm revenue forecast for the fiscal year, raising concerns that the tech industry’s artificial intelligence spending spree is slowing.", 
            "title": "Arm Shares Slip After Chip Designer Gives Tepid Annual Forecast - Bloomberg"
        }, 
        {
            "url": "https://apnews.com/article/antisemitism-congress-public-schools-gaza-acf92208a9ea0ef4878c6ba993ed1d83", 
            "description": "Leaders of three large public school systems strongly denied allegations that they let antisemitism run rampant. They told a congressional panel Wednesday that they’re fighting it with education and, when necessary, discipline. As part of a series of hearings…", 
            "title": "K-12 school leaders reject allegations that they let antisemitism run rampant - The Associated Press"
        }, 
        {
            "url": "https://www.cbsnews.com/news/immigration-us-asylum-migrants-new-regulation/", 
            "description": "The Biden administration is planning to announce a new regulation designed to allow immigration officials to deport migrants ineligible for U.S. asylum earlier in the process.", 
            "title": "U.S. to empower asylum officials to reject more migrants earlier in process - CBS News"
        }, 
        {
            "url": "https://www.teslarati.com/united-launch-alliance-delays-first-crewed-boeing-starliner-launch/", 
            "description": "United Launch Alliance has delayed the launch of the first crewed Starliner launch to no earlier than May 17th at 6:16 pm ET.", 
            "title": "United Launch Alliance delays the first crewed Boeing Starliner launch - TESLARATI"
        }, 
        {
            "url": "https://www.cbsnews.com/news/super-earth-exoplanet-atmosphere-55-cancri-e/", 
            "description": "The so-called super Earth — known as 55 Cancri e — is among the few rocky planets outside our solar system with a significant atmosphere.", 
            "title": "Thick atmosphere detected around scorching, rocky planet that's twice as big as Earth - CBS News"
        }, 
        {
            "url": "https://nypost.com/2024/05/08/sports/jalen-brunson-has-second-highest-points-prop-in-nba-playoffs-history/", 
            "description": "Jalen Brunson is reaching historic levels of scoring dominance for the Knicks in the NBA playoffs.", 
            "title": "Jalen Brunson has second-highest points prop in NBA playoffs history - New York Post "
        }, 
        {
            "url": "http://deadline.com/2024/05/ipad-ad-backlash-crushinghugh-grant-justine-bateman-1235909002/", 
            "description": "Tim Cook may be praising the new iPad & the ad accompanying it, but the tech giant CEO seems to be alone there", 
            "title": "Apple’s Crushing iPad Ad Trashed By Hugh Grant, Justine Bateman & Almost Everyone Else - Deadline"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/8/24151342/google-pixel-8a-lego-icons-tiny-plants-deal-sale", 
            "description": "Amazon and other retailers are already offering Google’s next midrange phone with a $100 gift card. You can also save on the Beats Studio Buds and Lego’s Tiny Plants set.", 
            "title": "You can get a $100 gift card when you preorder Google's Pixel 8A - The Verge"
        }, 
        {
            "url": "https://www.usatoday.com/story/travel/news/2024/05/08/fedex-plane-landing-gear-fails-video/73613871007/", 
            "description": null, 
            "title": "Video shows FedEx cargo plane land on its nose in Istanbul after landing gear fails - USA TODAY"
        }, 
        {
            "url": "https://apnews.com/article/cdc-dog-import-rules-rabies-572fa077a00afec3b2c13ab412f641ef", 
            "description": "New U.S. rules require all dogs coming into the U.S. to be at least 6 months old and microchipped to help prevent the spread of rabies. The new rules published Wednesday require vaccination for dogs that have been in countries where rabies is common. The regu…", 
            "title": "Traveling with dogs to the US? The new rules you'll need to follow - The Associated Press"
        }, 
        {
            "url": "https://arstechnica.com/gadgets/2024/05/m4-ipad-pro-cpu-cores-and-ram-amount-are-tied-to-storage-capacity/", 
            "description": "Apple has tied RAM to storage capacity in older iPads; it's a first for the CPU.", 
            "title": "M4 iPad Pro CPU cores and RAM amount are tied to storage capacity - Ars Technica"
        }
    ], 
    "last_updated": "2024-05-10 00:38:49"
}