{
    "news": [
        {
            "url": "https://www.etonline.com/gallery/2024-acm-awards-red-carpet-arrivals-225529", 
            "description": "See all the celebrities going to the big event -- the 2024 ACM Awards!", 
            "title": "2024 ACM Awards: Red Carpet Arrivals - Entertainment Tonight"
        }, 
        {
            "url": "https://www.usatoday.com/story/sports/wnba/2024/05/16/indiana-new-york-caitlin-clark-wnba-home-game-score-highlights/73708087007/", 
            "description": "Caitlin Clark and the Indiana Fever play their WNBA home opener Thursday night against the New York Liberty. Follow along with USA TODAY Sports.", 
            "title": "Liberty-Fever live score, updates: Caitlin Clark stats, highlights - USA TODAY"
        }, 
        {
            "url": "https://www.washingtonpost.com/nation/2024/05/16/census-population-cities-pandemic/", 
            "description": "More U.S. cities are either growing faster, making gains instead of declines, or experienced less severe shrinking -- all signs of possible progress.", 
            "title": "U.S. cities see more post-pandemic population improvement, census shows - The Washington Post"
        }, 
        {
            "url": "https://www.eonline.com/news/1401827/ben-affleck-and-jennifer-lopez-step-out-with-wedding-rings-amid-breakup-rumors", 
            "description": "Ben Affleck and Jennifer Lopez were both seen wearing their wedding rings as they stepped out in Los Angeles May 16, amid rumors the couple was breaking up after two years of marriage.", 
            "title": "Ben Affleck and Jennifer Lopez Step Out With Wedding Rings Amid Breakup Rumors - E! Online - E! NEWS"
        }, 
        {
            "url": "https://www.politico.com/live-updates/2024/05/16/trump-hush-money-criminal-trial/trump-appeals-gag-order-00158308", 
            "description": null, 
            "title": "Trump has appealed his gag order to New York's top court - POLITICO"
        }, 
        {
            "url": "https://www.cbssports.com/nfl/news/2024-nfl-schedule-teams-with-easiest-road-to-playoffs-based-on-schedule-kirk-cousins-falcons-set-up-best/", 
            "description": "A look at the teams with the most -- and least -- favorable schedules", 
            "title": "2024 NFL schedule: Teams with easiest road to playoffs based on schedule; Kirk Cousins' Falcons set up best - CBS Sports"
        }, 
        {
            "url": "https://abcnews.go.com/GMA/Family/kansas-city-chiefs-player-faces-backlash-graduation-speech/story?id=110262999", 
            "description": "Harrison Butker delivered the commencement address at Benedictine College.", 
            "title": "Kansas City Chiefs player faces backlash for graduation speech criticizing working women, calling Pride a 'deadly sin' - ABC News"
        }, 
        {
            "url": "https://www.foxnews.com/health/cdc-webmd-give-update-current-bird-flu-outbreak-alert-not-alarmed", 
            "description": "As bird flu continues to spread among cattle in the U.S., the CDC and WebMD joined forces on Thursday to present a live-streamed briefing on the status of the outbreak.", 
            "title": "CDC, WebMD give update on current bird flu outbreak: 'Be alert, not alarmed' - Fox News"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "http://deadline.com/2024/05/kevin-spacey-documentary-reaction-1235919627/", 
            "description": "Having already achieved a number of wins in court the House of Cards star has received some big name support in the UK", 
            "title": "Kevin Spacey Praised & Defended By Liam Neeson, Sharon Stone, & Stephen Fry In Wake Of Biting UK Documentary & New Trial; “Our Industry Needs Him,” Says ‘Taken’ Star - Deadline"
        }, 
        {
            "url": "https://www.wsj.com/politics/policy/republicans-force-democrats-to-take-sides-on-bidens-israel-policy-61e84646", 
            "description": null, 
            "title": "Republicans Force Democrats to Take Sides on Biden's Israel Policy - The Wall Street Journal"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-hush-money-michael-cohen-ec08be1219703deb3cd10604844deacb", 
            "description": "Donald Trump’s lawyers have sought to portray the star prosecution witness in his hush money trial as a serial fabulist who is bent on seeing the presumptive Republican presidential nominee behind bars. During hours of cross-examination on Thursday, defense a…", 
            "title": "Michael Cohen pressed on his crimes and lies as defense attacks key Trump hush money trial witness - The Associated Press"
        }, 
        {
            "url": "https://www.foxbusiness.com/real-estate/iconic-mirage-casino-las-vegas-closing-rebranding-guitar-shaped-hard-rock-hotel", 
            "description": "The Mirage hotel-casino in Las Vegas, which ushered in a wave of megaresorts, will close its doors in July and it will then be refurbished and rebranded as a Hard Rock.", 
            "title": "Iconic Mirage casino in Las Vegas closing, rebranding with guitar-shaped Hard Rock Hotel - Fox Business"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/16/24158510/gta-6-release-date-fall-2025", 
            "description": "Rockstar Games’ parent company, Take-Two, has confirmed the next Grand Theft Auto game will arrive toward the end of 2025, 12 years after the last new GTA game.", 
            "title": "GTA 6 will be released in fall 2025 - The Verge"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/16/us/daniel-perry-texas-pardon-recommendation/index.html", 
            "description": "The Texas Board of Pardons has recommended a full pardon to Daniel Perry, a US Army sergeant who was sentenced to 25 years in prison after being convicted of murdering a protester at a Black Lives Matter rally in 2020.", 
            "title": "Gov. Abbott pardons Daniel Perry for 2020 fatal Black Lives Matter protest shooting after recommendation from pardons board - CNN"
        }, 
        {
            "url": "https://apnews.com/article/megalopolis-cannes-francis-ford-coppola-d965352b9f0f5d78d6c470beb801f6f8", 
            "description": "Francis Ford Coppola on Thursday premiered his self-financed opus “Megalopolis” at the Cannes Film Festival, unveiling a wildly ambitious passion project the 85-year-old director has been pondering for decades. Reactions ranged from “a folly of gargantuan pro…", 
            "title": "Francis Ford Coppola debuts 'Megalopolis' in Cannes, and the reviews are in - The Associated Press"
        }, 
        {
            "url": "https://finance.yahoo.com/video/walmart-market-cap-tops-500b-195303479.html", 
            "description": "Shares of Walmart (WMT) are trading higher Thursday, boosted by the company's first quarter earnings beat, which signaled consumer resilience on spending...", 
            "title": "Walmart market cap tops $500B post Q1 results - Yahoo Finance"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/16/24158365/quantum-computing-network-aws-amazon-harvard", 
            "description": "Amazon’s AWS partnered with Harvard to test how far a quantum entangled photon could travel. It traveled 35 kilometers under the Boston area.", 
            "title": "Quantum networks are closer to reality - The Verge"
        }, 
        {
            "url": "https://abc7.com/post/uc-irvine-classes-go-remote-thursday-after-police-clear-pro-palestinian-encampment-arrest-protesters/14826137/", 
            "description": "Fifty people were arrested after police cleared a pro-Palestinian encampment on the UC Irvine campus Wednesday. Students and staff were informed classes will meet remotely Thursday.", 
            "title": "UC Irvine classes go remote after police clear pro-Palestinian encampment; 50 protesters arrested - KABC-TV"
        }, 
        {
            "url": "https://www.bbc.com/news/world-middle-east-69019655", 
            "description": "The reported friendly-fire incident in Jabalia is one of the deadliest since the war began.", 
            "title": "Gaza war: Israeli tank fire kills five soldiers in north Gaza, military says - BBC.com"
        }
    ], 
    "last_updated": "2024-05-18 03:49:02"
}