{
    "news": [
        {
            "url": "https://www.cnn.com/2024/05/07/europe/putin-inauguration-russia-president-fifth-term-intl/index.html", 
            "description": "Vladimir Putin has formally begun his fifth term as Russia’s president in a carefully choreographed inauguration ceremony, in a country he has shaped in his image after first taking office nearly a quarter of a century ago.", 
            "title": "Putin inaugurated as president for fifth term with Russia under tight grip - CNN"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-hush-money-gag-order-d853768fff5fafbdee55623579889140", 
            "description": "An attorney for porn actor Stormy Daniels says she's expected to appear as a witness in Donald Trump’s hush money trial Tuesday. Clark Brewster tells The Associated Press that Daniels is “likely” to be called as a witness in the trial Tuesday. Trump says he w…", 
            "title": "Hush money trial: Trump faces jail threat over gag violations as testimony continues - The Associated Press"
        }, 
        {
            "url": "https://www.bbc.com/news/world-europe-68968256", 
            "description": "Two Ukrainian security officials are held over a Russian plot to assassinate the president, Ukraine says.", 
            "title": "Russian plot to kill Zelensky foiled, Kyiv says - BBC.com"
        }, 
        {
            "url": "https://www.nba.com/news/nuggets-timberwolves-takeaways-game-2-2024-nba-playoffs", 
            "description": "Even without Rudy Gobert in the mix, the Timberwolves hold the Nuggets to 80 points and forge a 2-0 series lead.", 
            "title": "Nuggets-Timberwolves: 5 takeaways from Minnesota's defensive masterclass in Game 2 - NBA.com"
        }, 
        {
            "url": "https://www.cbsnews.com/news/tornado-northeast-oklahoma-trail-of-damage-barnsdall-bartlesville/", 
            "description": "A tornado destroyed homes and toppled trees and power lines when it roared through a small northeast Oklahoma city, one of several twisters that erupted in the central United States​ amid a series of powerful storms.", 
            "title": "Tornado tears through northeast Oklahoma, leaves trail of damage - CBS News"
        }, 
        {
            "url": "https://www.reuters.com/world/middle-east/israeli-military-take-control-vital-rafah-crossing-gaza-into-egypt-2024-05-07/", 
            "description": null, 
            "title": "Israeli military takes control of vital Rafah crossing from Gaza into Egypt - Reuters.com"
        }, 
        {
            "url": "https://www.wsj.com/science/space-astronomy/nasa-boeing-starliner-launch-38d85279", 
            "description": "Spacecraft was due to take its inaugural crewed flight Monday, carrying NASA astronauts to the International Space Station", 
            "title": "Boeing's Starliner Launch Delayed After Issue Identified With Rocket Valve - The Wall Street Journal"
        }, 
        {
            "url": "https://www.npr.org/2024/05/07/1249463072/after-years-in-a-syrian-camp-a-ten-person-american-family-is-back-in-the-u-s", 
            "description": "The complex deal also brought home two sons of a Minnesota man who fought for ISIS", 
            "title": "After years in a Syrian ISIS camp, a ten-person American family is back in the U.S. - NPR"
        }, 
        {
            "url": "https://apnews.com/article/serbia-china-nato-bombing-embassy-5b13db499f39721faf9c82b9f88f4dfa", 
            "description": "Chinese leader Xi Jinping’s visit to European ally Serbia starting Tuesday falls on a symbolic date: the 25th anniversary of the bombing of the Chinese Embassy during NATO’s air war over Kosovo. U.S. jets dropped five bombs on the Chinese Embassy compound in …", 
            "title": "Xi to begin Serbia visit on the 25th anniversary of NATO's bombing of the Chinese Embassy - The Associated Press"
        }, 
        {
            "url": "http://deadline.com/2024/05/disney-quarterly-earnings-streaming-profitability-1235906698/", 
            "description": "Disney topped Wall Street forecasts for its fiscal second quarter and inched closer to the long-awaited milestone of streaming profitability.", 
            "title": "Disney Posts Better-Than-Expected Quarterly Results, Nears Streaming Profitability Goal - Deadline"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/7/uk-defence-ministry-targeted-in-cyberattack-minister", 
            "description": "Third-party payroll system with names and bank details of armed forces staff hacked, reports say.", 
            "title": "UK Defence Ministry targeted in cyberattack: Minister - Al Jazeera English"
        }, 
        {
            "url": "https://www.businessinsider.com/blackstone-breit-commercial-real-estate-fund-misled-investors-private-equity-2024-5", 
            "description": "Blackstone's real-estate fund, BREIT, boasts assets of $114 billion. But is it a house of cards?", 
            "title": "Inside the Growing Alarm Over Blackstone's BREIT Real-Estate Fund - Business Insider"
        }, 
        {
            "url": "https://www.foxnews.com/health/seniors-breast-cancer-why-arent-older-women-told-get-mammograms", 
            "description": "The U.S. Preventive Services Task Force recommends that women between the ages of 40 and 74 should get mammograms every other year, but some experts object to the older cut-off age.", 
            "title": "Seniors and breast cancer: Why aren’t older women told to get mammograms? - Fox News"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.bbc.com/news/entertainment-arts-68938637", 
            "description": "Zendaya, Sabrina Carpenter and Gigi Hadid were among the stars walking the red carpet in New York.", 
            "title": "Met Gala 2024: Zendaya, Tyla and Sabrina Carpenter lead eye-catching looks - BBC.com"
        }, 
        {
            "url": "https://www.sciencealert.com/nasas-stunning-new-simulation-sends-you-diving-into-a-black-hole", 
            "description": "It's a question that has dogged humanity since we first learned about black holes a little over a century ago: What the heck would it be like to plunge beyond the point of no return? We still don't have an answer, but a new supercomputer simulation is...", 
            "title": "NASA's Stunning New Simulation Sends You Diving Into a Black Hole - ScienceAlert"
        }, 
        {
            "url": "https://nypost.com/2024/05/07/entertainment/tom-selleck-risks-losing-california-ranch-with-cancelation-of-blue-bloods/", 
            "description": "The beloved actor, 79, has been starring in the popular CBS crime drama since 2010.", 
            "title": "Tom Selleck risks losing California ranch with cancelation of 'Blue Bloods' - New York Post "
        }, 
        {
            "url": "https://sports.yahoo.com/nba-playoffs-officials-admit-they-flubbed-critical-kick-ball-call-in-controversial-final-minute-of-pacers-knicks-033802997.html", 
            "description": "Tuesday's last-2-minute report should be interesting.", 
            "title": "NBA playoffs: Officials admit they flubbed critical kick-ball call in controversial final minute of Pacers-Knicks - Yahoo Sports"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/07/amazons-aws-to-invest-nearly-9-billion-in-singapore.html", 
            "description": "This comes after AWS pumped over SG$11 billion through 2023 into Singapore's cloud infrastructure and ecosystem.", 
            "title": "Amazon's AWS to invest an additional $9 billion in Singapore - CNBC"
        }
    ]
}