{
    "news": [
        {
            "url": "https://apnews.com/article/papua-new-guinea-landslide-3e1444634d8859b1f2378b334c6a0d41", 
            "description": "A Papua New Guinea government official has told the United Nations more than 2,000 people are believed to have been buried alive by a landslide Friday. The official formally asked for international help. The government figure is roughly triple a U.N. estimate…", 
            "title": "PNG landslide: More than 2,000 killed, government says - The Associated Press"
        }, 
        {
            "url": "https://www.tmz.com/2024/05/27/diddy-sean-john-pull-america-best-contacts-eyeglasses-frames/", 
            "description": "Diddy's wallet's about to take a hit ... 'cause his famed Sean John frames are out at a huge eyewear retailer while his legal troubles mount.", 
            "title": "Diddy's Sean John Frames Pulled From America's Best Contacts and Eyeglasses - TMZ"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/27/china-calls-on-japan-and-south-korea-to-reject-protectionism-.html", 
            "description": "This is the first meeting between the three leaders in more than four years.", 
            "title": "China calls on Japan and South Korea to reject 'protectionism' in trilateral summit - CNBC"
        }, 
        {
            "url": "https://www.reuters.com/technology/china-sets-up-475-bln-state-fund-boost-semiconductor-industry-2024-05-27/", 
            "description": null, 
            "title": "China sets up third fund with $47.5 bln to boost semiconductor sector - Reuters"
        }, 
        {
            "url": "https://www.autosport.com/indycar/news/indy-500-newgarden/10616310/", 
            "description": "Team Penske’s Josef Newgarden fought off Pato O’Ward in a last-lap showdown to take back-to-back Indianapolis 500 victories.", 
            "title": "Indy 500: Newgarden beats O'Ward for back-to-back wins - Autosport"
        }, 
        {
            "url": "https://techcrunch.com/2024/05/26/elon-musks-xai-raises-6b-from-valor-a16z-and-sequoia/", 
            "description": "Elon Musk's AI startup, xAI, has raised $6 billion in a new funding round, it said today, in one of the largest deals in the red-hot nascent space, as he Elon Musk's AI startup, xAI, has raised $6 billion in a new funding round in one of the largest deals in …", 
            "title": "Elon Musk's xAI raises $6B from Valor, a16z, and Sequoia - TechCrunch"
        }, 
        {
            "url": "https://chicago.suntimes.com/horoscopes/2024/05/27/horoscopes-today-monday-may-27-2024", 
            "description": null, 
            "title": "Horoscope for Monday, May 27, 2024 - Chicago Sun-Times"
        }, 
        {
            "url": "https://www.washingtonpost.com/politics/2024/05/26/chase-oliver-libertarian-party-nominee/", 
            "description": "The nomination came after seven rounds of voting over a long, contentious day as factions of the party feuded over the process and party leadership positions.", 
            "title": "Chase Oliver is nominated as Libertarian Pary candidate for president - The Washington Post"
        }, 
        {
            "url": "https://apnews.com/article/south-africa-election-anc-apartheid-9215778b4184e2fcb02a9008f3558975", 
            "description": "South Africans will vote Wednesday to decide whether their country takes its most significant political step since it brought down apartheid and achieved democracy 30 years ago. This national election will not be as momentous as the one South Africa held in 1…", 
            "title": "South Africa's election could bring the biggest political shift since it became a democracy in 1994 - The Associated Press"
        }, 
        {
            "url": "https://www.kait8.com/2024/05/27/e-911-director-storm-damage-reported-paragould/", 
            "description": "Severe storms and overnight tornadoes made its way through Greene County.", 
            "title": "E-911 Director: Storm damage reported in Paragould - KAIT"
        }, 
        {
            "url": "https://www.usatoday.com/story/sports/nba/playoffs/2024/05/26/mavericks-win-game-3-of-nba-playoff-series-vs-timberwolves/73866855007/", 
            "description": null, 
            "title": "Dallas Mavericks take control of series vs. Minnesota Timberwolves with Game 3 win - USA TODAY"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/26/india/cyclone-remal-india-bangladesh-landfall-intl-hnk/index.html", 
            "description": "Tropical Cyclone Remal made landfall in Bangladesh on Sunday, bringing torrential rain and heavy winds as it continues moves inland across eastern India, toppling trees, turning roads into rivers and causing large-scale destruction.", 
            "title": "Over 1 million evacuated as Cyclone Remal brings heavy rain to Bangladesh and India - CNN"
        }, 
        {
            "url": "https://www.wdsu.com/article/tangipahoa-parish-4-escaped-inmates/60909735", 
            "description": "In a news release, the sheriff said the four inmates were able to escape the perimeter fence of the jail while participating in their recreational time.", 
            "title": "Tangipahoa Parish deputies searching for 4 escaped inmates - WDSU New Orleans"
        }, 
        {
            "url": "https://www.wsaz.com/2024/05/27/tornado-watch-issued-part-region/", 
            "description": "The tornado watch will remain in effect until 6 a.m., according to the NWS.", 
            "title": "Tornado Watch issued for part of the region - WSAZ"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cxxxp1w6e2ro", 
            "description": "Powerful storms devastate areas in Texas, Arkansas and Oklahoma and leave hundreds of thousands without power.", 
            "title": "Tornadoes and storms leave 15 dead across central US - BBC.com"
        }, 
        {
            "url": "https://www.bbc.com/news/av/world-europe-69064916", 
            "description": "People from a Dublin-bound plane from Doha describe scenes on board during severe turbulence.", 
            "title": "Dublin passengers recall 'panic' as Doha plane hit turbulence - BBC.com"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cmj66r4lvzzo", 
            "description": "The US housing market has changed dramatically since the pandemic - an issue looming over the election.", 
            "title": "Trying to buy a house is 'playing a game you can't win' - BBC.com"
        }, 
        {
            "url": "https://variety.com/2024/music/news/beach-boys-documentary-interview-frank-marshall-1236016901/", 
            "description": "Mike Love and Al Jardine and director Frank Marshall talk about the Disney+ doc 'The Beach Boys' and subjects like their friendly Beatles rivalry.", 
            "title": "The Beach Boys and Director Frank Marshall on the Band’s Disney+ Doc: ‘We May Not Have Been Great Surfers, but We Sang About It Really Well’ - Variety"
        }, 
        {
            "url": "https://www.axios.com/2024/05/26/rafah-tent-camp-israel-airstrike", 
            "description": null, 
            "title": "Israeli airstrike kills dozens in Rafah tent camp, Gaza authorities say - Axios"
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-26/asian-stocks-to-climb-as-risk-sentiment-rebounds-markets-wrap", 
            "description": "Asian shares climbed while the dollar weakened Monday on expectations of a Federal Reserve rate cut this year, with US inflation data due this week likely indicating easing price pressure.", 
            "title": "Stock Market Today: Updates for May 27 - Bloomberg"
        }
    ], 
    "last_updated": "2024-05-28 13:18:34"
}