{
    "news": [
        {
            "url": "https://apnews.com/article/iran-president-ebrahim-raisi-426c6f4ae2dd1f0801c73875bb696f48", 
            "description": "Iranian President Ebrahim Raisi and the country’s foreign minister have been found dead hours after their helicopter crashed in fog. That leaves the Islamic Republic without two key leaders as extraordinary tensions grip the wider Middle East. Supreme Leader …", 
            "title": "Iran helicopter crash: Mohammad Mokhber becomes acting president - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/20/politics/trump-trial-takeaways/index.html", 
            "description": "The prosecution rested their case against Donald J. Trump on Monday in the former president’s hush money trial, which is barreling toward a conclusion as soon as next week.", 
            "title": "Takeaways from a tense Day 19 of the Trump hush money trial - CNN"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=sAewmh-Lu8U", 
            "description": "Manchester City made history as we became the first ever men’s team to win four titles in a row following our 3-1 win over West Ham United.Phil Foden took ju...", 
            "title": "EXTENDED HIGHLIGHTS | 4-IN-A-ROW | Man City 3-1 West Ham | Premier League History Makers - Man City"
        }, 
        {
            "url": "https://www.reuters.com/business/red-lobster-probes-endless-shrimp-losses-after-bankruptcy-filing-2024-05-20/", 
            "description": "Red Lobster, which filed for Chapter 11 bankruptcy in Florida on Sunday night, is investigating the role its majority owner Thai Union played in the restaurant chain's \"endless shrimp\" promotion that caused $11 million in losses, court documents showed.", 
            "title": "Red Lobster probes \"endless shrimp\" losses after bankruptcy filing - Reuters"
        }, 
        {
            "url": "https://www.macrumors.com/2024/05/20/microsoft-surface-pro-faster-macbook-air/", 
            "description": "Microsoft is going all in on AI, today introducing a series of Copilot+ PCs that have AI-focused hardware. The new Surface Pro is one of the first...", 
            "title": "Microsoft Says New Surface Pro is Faster Than 15\" M3 MacBook Air - MacRumors"
        }, 
        {
            "url": "https://www.mprnews.org/story/2024/05/20/severe-risk-and-flood-watch-tuesday", 
            "description": "An unseasonably deep low-pressure storm is heading for Minnesota. Multiple waves of rain and thunderstorms will sweep across Minnesota from late Monday night through Tuesday.", 
            "title": "Severe risk and flood watch Tuesday - MPR News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/20/economy/fdic-chair-gruenberg-resigns/index.html", 
            "description": "Martin Gruenberg, head of the Federal Deposit Insurance Corporation, will step down following a scathing independent investigation detailing pervasive sexual harassment, discrimination and bullying at the agency charged with regulating the banking sector.", 
            "title": "FDIC Chair Martin Gruenberg will resign following a scathing investigation that detailed a toxic workplace - CNN"
        }, 
        {
            "url": "https://abcnews.go.com/US/black-astronauts-90-year-ed-dwights-1st-trip/story?id=110406706", 
            "description": "\"I needed to finish it,\" Dwight said.", 
            "title": "Black astronauts say 90-year-old Ed Dwight's 1st trip to space was 'justice' - Yahoo! Voices"
        }, 
        {
            "url": "https://variety.com/2024/digital/news/trump-truth-social-media-q1-2024-revenue-net-loss-1236010937/", 
            "description": "Trump Media and Technology Group reported $770,500 in revenue for the first quarter of 2024 and a net loss of $327.6 million.", 
            "title": "Trump’s Social Media Company Posts Q1 Revenue of $770,500 and Net Loss of $327.6 Million - Variety"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-hush-money-michael-cohen-363a86879b97d2367831b1392f42689d", 
            "description": "The judge overseeing Donald Trump’s hush money trial briefly closed the courtroom, forcing reporters into the hallway after he admonished a defense witness for his behavior on the witness stand. It happened minutes into the testimony of Robert Costello, a for…", 
            "title": "Judge admonishes defense witness for his behavior after prosecution rests in Trump hush money trial - The Associated Press"
        }, 
        {
            "url": "https://www.etonline.com/zac-browns-estranged-wife-kelly-yazdi-speaks-out-after-he-gets-temporary-restraining-order-225733", 
            "description": "The couple announced their separation in December 2023 and last week, Brown was granted a temporary restraining order.", 
            "title": "Zac Brown's Estranged Wife Kelly Yazdi Speaks Out After He Gets Temporary Restraining Order - Entertainment Tonight"
        }, 
        {
            "url": "https://www.wkyt.com/2024/05/20/lfchd-declares-whooping-cough-an-outbreak/", 
            "description": "The Lexington-Fayette County Health Department has declared pertussis or whooping cough in outbreak status.", 
            "title": "LFCHD declares whooping cough an outbreak - WKYT"
        }, 
        {
            "url": "https://www.businessinsider.com/eminem-daughter-hailie-jade-scott-wedding-photos-2024-5", 
            "description": "Eminem fans know his daughter Hailie Jade Scott as the featured artist on \"My Dad's Gone Crazy\" and the subject of \"Hailie's Song.\" Now, the podcaster is married.", 
            "title": "Eminem's daughter Hailie Jade Scott is married: wedding photos - Business Insider"
        }, 
        {
            "url": "https://www.nhl.com/news/edmonton-oilers-vancouver-canucks-game-7-preview", 
            "description": "Vancouver needs to score without Boeser, Edmonton counting on Skinner to lead way", 
            "title": "3 Keys: Oilers at Canucks, Game 7 of Western 2nd Round - NHL.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/20/climate/doomsday-glacier-melt-antarctica-climate-intl/index.html", 
            "description": "Ocean water is pushing miles beneath Antarctica’s “Doomsday Glacier” on a daily basis making it more vulnerable to melting than previously thought, according to new research, which used radar data from space to perform an X-ray of the crucial glacier.", 
            "title": "Ocean water is rushing miles underneath the ‘Doomsday Glacier’ with potentially dire impacts on sea level rise - CNN"
        }, 
        {
            "url": "https://www.ign.com/articles/ninja-theory-studio-head-sends-heartfelt-message-to-hellblade-2-fans", 
            "description": "A day before Hellblade 2 releases, Ninja Theory Studio head Dom Matthews shared a heartfelt message to fans for their support and excitement to play the next chapter in the Hellblade franchise.", 
            "title": "Ninja Theory Studio Head Sends Heartfelt Message to Hellblade 2 Fans - IGN"
        }, 
        {
            "url": "https://www.espn.com/nba/story/_/id/40186394/victor-wembanyama-chet-holmgren-headline-nba-all-rookie-team", 
            "description": "The Spurs' Victor Wembanyama and Thunder's Chet Holmgren were unanimous selections for the NBA's All-Rookie team.", 
            "title": "Victor Wembanyama, Chet Holmgren headline NBA All-Rookie team - ESPN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/20/us/baltimore-bridge-collapse-ship-relocation/index.html", 
            "description": "After 55 days stuck in the Patapsco River, the Dali cargo ship was hauled away from the site of its catastrophic crash into the Francis Scott Key Bridge – a crucial step toward fully reopening the busy Port of Baltimore.", 
            "title": "Almost 2 months after it destroyed Baltimore’s Key Bridge, the Dali cargo ship has been moved and docked. Here’s what’s next - CNN"
        }, 
        {
            "url": "https://www.bbc.com/news/health-69037200", 
            "description": "PM truly sorry as inquiry finds authorities covered up scandal and exposed victims to unacceptable risks.", 
            "title": "PM apologises after infected blood scandal cover-up - BBC.com"
        }, 
        {
            "url": "https://www.anandtech.com/show/21404/lenovo-unveils-yoga-slim-7x-14-gen-14-and-thinkpad-t14-gen-6-notebooks-powered-by-qualcomm-snapdragon-x-elite", 
            "description": "While we&#39;ve been expecting the availability of the Qualcomm Snapdragon X Elite processor to be around the middle of this year, Lenovo has announced...", 
            "title": "Lenovo Unveils Yoga Slim 7x 14 Gen 14 and ThinkPad T14 Gen 6 Notebooks Powered By Qualcomm Snapdragon X Elite - AnandTech"
        }
    ], 
    "last_updated": "2024-05-22 02:18:07"
}