{
    "news": [
        {
            "url": "https://apnews.com/article/meme-roaring-kitty-gamestop-amc-stocks-401916acd3715d35cc0220143b26b2ac", 
            "description": "The man at the center of the pandemic meme stock craze returned to the social platform X for the first time in three years and sent prices of those stocks surging overnight. Keith Gill, better known as “Roaring Kitty,” posted an image Sunday of a man sitting …", 
            "title": "GameStop, AMC stocks surge as Roaring Kitty returns - The Associated Press"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/13/stock-market-today-live-updates.html", 
            "description": "The first of two inflation reports will be issued Tuesday morning: April's reading of the producer price index.", 
            "title": "Stock futures are little changed as investors brace for key inflation reports: Live updates - CNBC"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=ob68AbVQv7o", 
            "description": null, 
            "title": "Boston Celtics @ Cleveland Cavaliers | #NBAPlayoffs presented by Google Pixel Live Scoreboard - NBA"
        }, 
        {
            "url": "https://foreignpolicy.com/2024/05/13/georgian-dream-party-foreign-agents-bill-russia-protests/", 
            "description": "Lawmakers are expected to greenlight the Russian-modeled legislation on Tuesday despite mass protests in the capital.", 
            "title": "Georgia Set to Approve Controversial Foreign Agents Bill - Foreign Policy"
        }, 
        {
            "url": "https://arstechnica.com/science/2024/05/anti-pasteurization-crowd-reaffirms-love-of-raw-milk-despite-bird-flu-outbreak/", 
            "description": "Raw milk fans called warnings \"fear mongering,\" despite 52% fatality rate in humans.", 
            "title": "Anti-pasteurization crowd reaffirms love of raw milk despite bird flu outbreak - Ars Technica"
        }, 
        {
            "url": "https://abcnews.go.com/US/wireStory/melinda-french-gates-resigns-gates-foundation-chair-3-110180418", 
            "description": "Melinda French Gates announced Monday that she will step down as co-chair of the Bill & Melinda Gates Foundation", 
            "title": "Melinda French Gates resigns as Gates Foundation co-chair, 3 years after her divorce from Bill Gates - ABC News"
        }, 
        {
            "url": "https://9to5mac.com/2024/05/13/first-m4-ipad-pro-reviews/", 
            "description": "Apple last week announced a new generation iPad Pro with the M4 chip, which is now available for pre-order. While...", 
            "title": "M4 iPad Pro reviews praise OLED display; criticize price, software - 9to5Mac"
        }, 
        {
            "url": "https://www.foxsports.com/stories/nfl/exclusive-cowboys-will-face-browns-in-week-1-to-mark-tom-bradys-fox-sports-debut", 
            "description": "The Cowboys' Sept. 8 matchup vs. the Browns on FOX will be the first America's Game of the Week of 2024 — and mark Tom Brady's debut as FOX Sports' lead NFL analyst.", 
            "title": "Exclusive: Cowboys will face Browns in Week 1 to mark Tom Brady's FOX Sports debut - FOX Sports"
        }, 
        {
            "url": "https://www.businessinsider.com/chatgpt-4o-sam-altman-apple-siri-tim-cook-compared-how-2024-5", 
            "description": "Tim Cook must be super jealous of Sam Altman's new ChatGPT-4o voice assistant. Siri is far behind — but Apple still has one big advantage.", 
            "title": "OpenAI's new voice assistant ChatGPT-4o smokes Apple's Siri - Business Insider"
        }, 
        {
            "url": "https://www.espn.com/nfl/story/_/id/40140300/sources-lions-signing-qb-jared-goff-4-year-212m-extension", 
            "description": "The Lions are signing quarterback Jared Goff to a four-year, $212 million contract extension that includes $170 million guaranteed, sources told ESPN's Adam Schefter on Monday.", 
            "title": "Sources - Lions signing QB Jared Goff to 4-year, $212M extension - ESPN"
        }, 
        {
            "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-kharkiv-donetzk-397dd892f936726bd1acbd45991a18a6", 
            "description": "Ukrainian officials and commanders say Russian troops are locked in intense battles with Ukrainian soldiers in the embattled town of Vovchansk and are pushing ahead with a ground offensive that opened a new front to put pressure on overstretched Ukrainian for…", 
            "title": "Russia-Ukraine war: Army locked in 'fierce' border battles amid Russian assault, Zelenskyy says - The Associated Press"
        }, 
        {
            "url": "https://nypost.com/2024/05/13/business/archegos-bill-hwang-lied-to-become-wall-street-legend-causing-36b-fund-to-collapse-prosecutors/", 
            "description": "Archegos’ collapse caused more than $100 billion in shareholder losses at companies in its portfolio, harming investors who sold shares after their scheme collapsed, prosecutors also allege.", 
            "title": "Archegos' Bill Hwang lied to become Wall Street legend, causing $36B fund to collapse: prosecutors - New York Post "
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.bbc.com/news/world-middle-east-69001835", 
            "description": "Fierce fighting is reported as Israel says it is targeting areas of where Hamas has regrouped.", 
            "title": "Gaza war: Palestinians flee as Israeli forces go back into Jabalia - BBC.com"
        }, 
        {
            "url": "https://www.bbc.com/news/world-europe-69006046", 
            "description": "Steve Rosenberg considers possible reasons behind Sergei Shoigu's replacement in the middle of a war.", 
            "title": "Why has Putin removed ally Sergei Shoigu as Russia's defence minister? - BBC.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/13/us/baltimore-bridge-collapse-demolition-monday/index.html", 
            "description": "The planned demolition of a key portion of the collapsed Francis Scott Key Bridge is set to begin Monday evening after inclement weather, including lightning, forced the operation to be postponed over the weekend.", 
            "title": "Demolition of a key section of Baltimore’s Francis Scott Key Bridge set for this afternoon after weekend weather delays - CNN"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.foxnews.com/entertainment/chris-pratt-shares-wife-katherine-schwarzenegger-hall-pass", 
            "description": "Katherine Schwarzenegger revealed an undying devotion to her favorite R&B singing sensation, Usher, which husband Chris Pratt simply couldn't blame her for.", 
            "title": "Chris Pratt shares wife Katherine Schwarzenegger's 'hall pass' - Fox News"
        }, 
        {
            "url": "https://nypost.com/2024/05/13/us-news/brave-parishioners-stop-armed-teen-from-entering-church-service-packed-with-children-video/", 
            "description": "Parishioners spotted the teen and swarmed him — holding him outside until police arrived and arrested him.", 
            "title": "Video shows panic in church packed with kids after teen armed with rifle tries to storm service - New York Post "
        }, 
        {
            "url": "https://gizmodo.com/not-just-auroras-heres-the-tech-that-got-hit-by-this-w-1851472838", 
            "description": "SpaceX's Elon Musk said the company's Starlink satellites were \"under a lot of pressure\" from the incoming radiation.", 
            "title": "Not Just Auroras: Here's the Tech That Got Hit by This Weekend's Solar Storm - Gizmodo"
        }
    ], 
    "last_updated": "2024-05-15 03:30:29"
}