{
    "news": [
        {
            "url": "https://www.detroitnews.com/story/business/autos/2024/05/24/uaw-asks-nlrb-to-reject-mercedes-vote-results-order-new-election/73840811007/", 
            "description": "The Detroit-based union argues that the German automaker fired four pro-union workers and committed other discriminatory actions.", 
            "title": "UAW asks NLRB to reject Mercedes vote results, order new election - Detroit News"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/24/biden-trump-trial-verdict-00159981", 
            "description": null, 
            "title": "Biden has stayed silent on Trump's trial. The verdict will change that. - POLITICO"
        }, 
        {
            "url": "https://www.ft.com/content/c0cab874-2a84-493e-af48-6ec0aec0e560", 
            "description": "Billionaire’s endorsement could lead to more Wall Street money for the former president’s campaign", 
            "title": "Blackstone chief Stephen Schwarzman backs Donald Trump - Financial Times"
        }, 
        {
            "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/settlements-are-the-beginning-not-the-end-of-college-sports-antitrust-reckoning", 
            "description": "Without a real solution, there will be more lawsuits.", 
            "title": "Settlements are the beginning, not the end, of college sports' antitrust reckoning - NBC Sports"
        }, 
        {
            "url": "https://www.texastribune.org/2024/05/24/uvalde-shooting-lawsuits-gunmaker-instagram-texas/", 
            "description": "The lawsuit accuses Daniel Defense, the manufacturer of the shooter’s weapon, of marketing its products to young people.", 
            "title": "Uvalde families sue gun manufacturer, Instagram, Activision - The Texas Tribune"
        }, 
        {
            "url": "https://thehill.com/policy/healthcare/4684914-colon-cancer-early-signs-young-adults-diagnosis-delayed/", 
            "description": "Experts are warning that more and more people younger than 40 years are being diagnosed with colon cancer, saying they could be missing the early signs. A study released Friday in the medical journal JAMA Network Open said the most common warning sign for the…", 
            "title": "Why younger adults are missing early signs of colon cancer - The Hill"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=pHlrkNTcnP8", 
            "description": "Aaron Rodgers said that the New York Jets will be “must-watch TV” in an interview. Jason McIntyre and Chase Daniel discuss the expectations on the Jets this ...", 
            "title": "Jets are ‘must-watch TV’, Chiefs early bye week, Can Jim Harbaugh develop Herbert? | NFL | THE HERD - The Herd with Colin Cowherd"
        }, 
        {
            "url": "https://www.reuters.com/world/uk/more-uk-conservative-lawmakers-set-quit-than-before-1997-election-defeat-2024-05-24/", 
            "description": null, 
            "title": "More UK Conservative lawmakers set to quit than before 1997 election defeat - Reuters UK"
        }, 
        {
            "url": "https://www.eonline.com/news/1402371/millie-bobby-brown-marries-jake-bongiovi-in-private-ceremony", 
            "description": "Stranger Things actress Millie Bobby Brown married Jake Bongiovi, the son of singer Jon Bon Jovi, during a private ceremony one year after getting engaged.", 
            "title": "Millie Bobby Brown Marries Jake Bongiovi in Private Ceremony - E! NEWS"
        }, 
        {
            "url": "https://www.cbsnews.com/news/planetary-alignment-what-to-know-june-3-2024/", 
            "description": "The orbits of six planets will bring them to the same side of the sun to create a \"planetary parade\" in early June.", 
            "title": "A rare 6-planet alignment will occur next month. Here's what to know. - CBS News"
        }, 
        {
            "url": "https://www.livescience.com/technology/artificial-intelligence/googles-ai-tells-users-to-add-glue-to-their-pizza-eat-rocks-and-make-chlorine-gas", 
            "description": "Social media has been flooded with bizarre and dangerous advice that appears to have been made by Google's new AI feature.", 
            "title": "Google's AI tells users to add glue to their pizza, eat rocks and make chlorine gas - Livescience.com"
        }, 
        {
            "url": "https://arstechnica.com/space/2024/05/spacex-sets-next-starship-flight-date-will-focus-on-propulsion-and-landing/", 
            "description": "Clearing blocked filters and clogged valves is the order of the day.", 
            "title": "SpaceX sets date for next Starship flight, explains what went wrong the last time - Ars Technica"
        }, 
        {
            "url": "https://abcnews.go.com/US/memorial-day-weekend-forecast-bring-severe-weather-tornadoes/story?id=110528770", 
            "description": "The highest tornado threat on Friday will be in Wisconsin, Illinois and Iowa.", 
            "title": "Memorial Day weekend weather: Tornadoes and record-high temperatures - ABC News"
        }, 
        {
            "url": "https://www.cbsnews.com/boston/news/karen-read-trial-live-stream-today-brian-higgins/", 
            "description": "Brian Higgins took the stand today for Day 17 of testimony in the Karen Read case. You can watch a live stream of the trial here.", 
            "title": "Watch Live: \"Flirty\" texts between Karen Read, Brian Higgins revealed in murder trial testimony - CBS Boston"
        }, 
        {
            "url": "https://www.axios.com/2024/05/24/icj-ruling-israel-gaza", 
            "description": null, 
            "title": "ICJ orders Israel to halt military offensive in Rafah - Axios"
        }, 
        {
            "url": "https://www.yahoo.com/news/american-missionary-couple-killed-gang-150126309.html", 
            "description": null, 
            "title": "American missionary couple killed by gang in Haiti, family says - Yahoo! Voices"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/24/boeing-nasa-starliner-astronaut-launch-moving-forward.html", 
            "description": "Boeing and NASA are moving forward with a June 1 launch attempt of the first crewed Starliner mission despite a \"stable\" leak in its propulsion system.", 
            "title": "Boeing, NASA say Starliner astronaut launch will move forward despite spacecraft helium leak - CNBC"
        }, 
        {
            "url": "https://www.ft.com/content/5fdb360d-bdf0-4de0-acf1-c6e17f203cd6", 
            "description": "Opposition seeks to curb new president’s administration while Beijing sends fighters, bombers and navy to patrol around island", 
            "title": "Taiwan in political turmoil as China steps up military intimidation - Financial Times"
        }, 
        {
            "url": "https://www.usatoday.com/story/news/investigations/2024/05/24/edan-on-arrested-ucla-protest-attack/73836881007/", 
            "description": "The arrest comes after media reports identified him as a participant in the attack.", 
            "title": "Edan On arrested by UCLA, charged with felony assault on protesters - USA TODAY"
        }, 
        {
            "url": "https://www.nbcsportsboston.com/nba/boston-celtics/jaylen-brown-celtics-pacers-conference-finals-history/615837/?partner=yahoo", 
            "description": "Here's how Jaylen Brown made Celtics playoff history in Game 2 of the Eastern Conference Finals.", 
            "title": "Jaylen Brown became first Celtics player to achieve this playoff feat - Yahoo Sports"
        }
    ], 
    "last_updated": "2024-05-26 02:00:43"
}