{
    "news": [
        {
            "url": "https://www.cnn.com/2024/05/17/entertainment/sean-combs-cassie-ventura/index.html", 
            "description": "A 2016 surveillance video obtained exclusively by CNN shows Sean “Diddy” Combs grab, shove, drag and kick his then-girlfriend Cassie Ventura during an altercation that matches allegations in a now-settled federal lawsuit filed by Ventura in November.", 
            "title": "Sean 'Diddy' Combs seen physically assaulting Cassie Ventura in 2016 surveillance video obtained by CNN - CNN"
        }, 
        {
            "url": "http://deadline.com/2024/05/bugonia-yorgos-lanthimos-emma-stone-movie-focus-features-1235917675/", 
            "description": "The remake of the South Korean film is directed by 'Poor Things' helmer Yorgos Lantimos and stars Emma Stone and Jesse Plemons", 
            "title": "Focus Features Takes Worldwide Rights To Yorgos Lanthimos’ Next Movie ‘Bugonia’ With Emma Stone & Jesse Plemons – Cannes - Deadline"
        }, 
        {
            "url": "https://www.ft.com/content/ab18441b-f302-41e6-b825-4b7ffc778f28", 
            "description": "President has shed support among Black voters who helped him defeat Trump in battleground state in 2020", 
            "title": "'The house is on fire': Democrats fear Biden is losing pivotal Georgia - Financial Times"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/18/media-upfronts-sports-hollywood-strikes.html", 
            "description": "Media companies charming advertisers during the Upfront meetings let sports take center stage as content slates still suffer from last year's Hollywood strikes.", 
            "title": "Media giants lean on sports as Hollywood strikes still loom over content slates - CNBC"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/18/us/baltimore-bridge-dali-ship-crew/index.html", 
            "description": "It could be weeks or even months before crew members can leave, due to complications beyond their control. Here’s why they’re still confined – and how they’re coping", 
            "title": "They’ve been stuck for 7 weeks on the ship that crashed into a Baltimore bridge. This is what life is like for the Dali crew - CNN"
        }, 
        {
            "url": "https://www.formula1.com/en/latest/article/fp3-piastri-fastest-during-final-practice-session-in-imola-after-alonso-and.4i2RfqtmOYJ68QqYqhguNv", 
            "description": "Oscar Piastri interrupted Ferrari’s run at the top of the timesheets at the Emilia-Romagna Grand Prix weekend by setting the pace in the third and final practice session, leading the way from Lando Norris and Carlos Sainz in a twice-red flagged hour.", 
            "title": "2024 Emilia-Romagna Grand Prix FP3 report and highlights: Piastri fastest during final practice session in Imola after Alonso and Perez cause red flags | Formula 1® - Formula 1"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/crgy4gkqkddo", 
            "description": "Moscow continues to make military gains in the Kharkiv region as Ukraine struggles with resources.", 
            "title": "Russia could increase Ukraine attacks, says Volodymyr Zelensky - BBC.com"
        }, 
        {
            "url": "https://www.cbssports.com/golf/news/2024-pga-championship-tv-schedule-coverage-live-stream-channel-where-to-watch-online-golf-tee-times/", 
            "description": "How to watch every memorable moment of the 2024 PGA Championship on TV or streaming live online", 
            "title": "2024 PGA Championship TV schedule, coverage, live stream, channel, where to watch online, golf tee times - CBS Sports"
        }, 
        {
            "url": "https://www.cbsnews.com/news/spanish-tourists-killed-multiple-injured-during-attack-in-afghanistan/", 
            "description": "Eight were wounded and according to preliminary information were from Norway, Australia, Lithuania and Spain.", 
            "title": "3 Spanish tourists killed, multiple injured during attack in Afghanistan - CBS News"
        }, 
        {
            "url": "https://nypost.com/2024/05/18/world-news/german-climate-protests-arrested-after-breaching-runway-at-munich-airport/", 
            "description": "An airport spokesperson said the airport had been fully closed to takeoffs and landings for nearly two hours.", 
            "title": "German climate protests arrested after breaching runway at Munich airport - New York Post "
        }, 
        {
            "url": "https://abcnews.go.com/Business/trump-trusted-biden-inflation-top-issue-voters-poll/story?id=110343680", 
            "description": "Eighty-five percent of people surveyed said inflation is an important issue.", 
            "title": "Trump trusted more than Biden on inflation, a top issue for voters, poll shows - ABC News"
        }, 
        {
            "url": "https://www.reuters.com/world/australians-stranded-new-caledonia-running-out-food-amid-civil-unrest-2024-05-18/", 
            "description": "Unrest in France's Pacific island territory has caused the deaths of at least six people.", 
            "title": "Australians stranded in New Caledonia 'running out of food' amid civil unrest - Reuters.com"
        }, 
        {
            "url": "https://www.newsweek.com/covid-flirt-vaccine-variant-strain-1901599", 
            "description": "Experts have warned of a \"summer wave\" of COVID infections. Should we be concerned?", 
            "title": "How COVID Vaccines Stand Up to New FLiRT Variants - Newsweek"
        }, 
        {
            "url": "https://apnews.com/article/israel-hamas-war-gaza-hostages-shani-louk-a37e4fd656b46be36c4c659a9c2aac7d", 
            "description": "The Israeli military says its troops in Gaza found the bodies of three Israeli hostages killed by Hamas in its Oct. 7 attack, including German-Israeli Shani Louk. A photo of Louk’s twisted body in the back of a pickup truck ricocheted around the world, bringi…", 
            "title": "Israeli military finds bodies of 3 hostages in Gaza, including Shani Louk - The Associated Press"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/18/health/alzheimers-blood-brain-improvement-wellness/index.html", 
            "description": "A 55-year old man reduced signs of Alzheimer’s in his blood through lifestyle changes and a personalized regime of supplements and medications.", 
            "title": "Signs of Alzheimer’s were everywhere. Then his brain improved - CNN"
        }, 
        {
            "url": "https://www.bbc.com/news/world-europe-69031772", 
            "description": "It comes as a man charged with attempting to murder Robert Fico arrived in court on Saturday.", 
            "title": "Slovakia PM Robert Fico 'approaching a positive prognosis' - BBC.com"
        }, 
        {
            "url": "https://www.floridatoday.com/story/tech/science/space/spacex/2024/05/16/spacex-falcon-9-starlink-spacex-friday-cape-canaveral-rocket-launch-space-force-coast/73703679007/", 
            "description": "SpaceX is targeting an early Friday night launch of Starlink 6-59. Here's what to know.", 
            "title": "SpaceX Falcon 9 will light up the sky late Friday over Space Coast - Florida Today"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c72pv86n5r3o", 
            "description": "Boeing shareholders approved a $33m pay package for outgoing boss Dave Calhoun.", 
            "title": "Boeing boss's $33m pay package approved - BBC.com"
        }, 
        {
            "url": "https://www.espn.com/nba/story/_/id/40168537/pacers-stay-dominant-home-roll-knicks-force-game-7", 
            "description": "Challenged by coach Rick Carlisle after a blowout loss in Game 5, the Pacers turned things around at home against the Knicks and forced a Game 7.", 
            "title": "Pacers spurred by fiery Carlisle, roll past Knicks to force Game 7 - ESPN"
        }, 
        {
            "url": "https://thehill.com/media/4671548-van-jones-marjorie-taylor-greene-jasmine-crockett-house-hearing-chaos/", 
            "description": "CNN commentator Van Jones slammed Rep. Marjorie Taylor Greene (R-Ga.) following her personal attacks on a fellow member of Congress during a House Oversight Committee hearing Thursday night. The committee hearing, held to vote on whether to hold Attorney Gene…", 
            "title": "Van Jones rails against Greene after spat with Dems: ‘She’s a disgrace to that Congress’ - The Hill"
        }
    ], 
    "last_updated": "2024-05-19 17:00:03"
}