{
    "news": [
        {
            "url": "https://apnews.com/article/icc-khan-netanyahu-070941d21ccd1f2b9611032b88527575", 
            "description": "The chief prosecutor of the world’s top war crimes court is seeking arrest warrants for Israeli and Hamas leaders, including Israeli Prime Minister Benjamin Netanyahu. Karim Khan of the International Criminal Court on Monday accused Netanyahu, his defense min…", 
            "title": "ICC prosecutor seeks arrest of Israeli, Hamas leaders - The Associated Press"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=LZf9pVTLsAk", 
            "description": "Suzie Siegel, former assistant to Sean ‘Diddy’ Combs talks to CNN’s Erin Burnett about the apology video he released two days after CNN published exclusive h...", 
            "title": "Sean 'Diddy' Combs’ former assistant says she doesn’t believe his apology - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/20/business/trump-media-quarterly-results/index.html", 
            "description": "Trump Media & Technology Group lost more than $300 million during the first quarter and generated very little revenue, the owner of Truth Social announced in a press release Monday.", 
            "title": "Trump Media lost more than $300 million last quarter on very little revenue - CNN"
        }, 
        {
            "url": "https://www.ft.com/content/fb1f730b-141d-4a38-a867-da2403823566", 
            "description": "Arbitrageur came to fame as a mergers expert but his scandal helped define Wall Street excess", 
            "title": "Ivan Boesky, convicted trader, 1937-2024 - Financial Times"
        }, 
        {
            "url": "http://deadline.com/2024/05/trump-apprentice-movie-lawsuit-threat-1235925058/", 
            "description": "In a move that almost everyone was expecting, Trump's team are going after the filmmakers of the picture that Cannes loves", 
            "title": "Trump Campaign Vows To Sue ‘The Apprentice’ Filmmakers Over Scene Of Ivanka Trump Rape By Then Real Estate Mogul - Deadline"
        }, 
        {
            "url": "https://abc13.com/post/houston-destructive-storm-aftermath-city-asks-houstonians-avoid/14846869/", 
            "description": "Crews already boarded up most of the windows with completion eyed for Wednesday. Meanwhile, city officials continue to urge against venturing into parts of downtown Houston.", 
            "title": "Houston destructive storm aftermath: City asks Houstonians to avoid parts of downtown while crews clean up debris - KTRK-TV"
        }, 
        {
            "url": "https://www.bloomberg.com/news/articles/2024-05-20/asian-stocks-look-mixed-as-traders-await-nvidia-markets-wrap", 
            "description": "Asian shares took a breather on Tuesday after seven days of gains, and a gauge of commodities reached a 15-month high. Traders’ focus turns to earnings from chipmaker Nvidia Corp. later in the week.", 
            "title": "Stock Market Today: Dow, S&P Live Updates for May 21 - Bloomberg"
        }, 
        {
            "url": "https://www.wlky.com/article/scottie-scheffler-arrest-charges-arraignment-delayed/60844118", 
            "description": "Scottie Scheffler's lawyer in Louisville said Monday that he does not intend for his client to appear in person for his arraignment.", 
            "title": "Scottie Scheffler's Louisville arraignment delayed to June - WLKY Louisville"
        }, 
        {
            "url": "https://www.mprnews.org/story/2024/05/20/severe-risk-and-flood-watch-tuesday", 
            "description": "An unseasonably deep low-pressure storm is heading for Minnesota. Multiple waves of rain and thunderstorms will sweep across Minnesota from late Monday night through Tuesday.", 
            "title": "Severe risk and flood watch Tuesday - MPR News"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/20/economy/fdic-chair-gruenberg-resigns/index.html", 
            "description": "Martin Gruenberg, head of the Federal Deposit Insurance Corporation, will step down following a scathing independent investigation detailing pervasive sexual harassment, discrimination and bullying at the agency charged with regulating the banking sector.", 
            "title": "FDIC Chair Martin Gruenberg will resign following a scathing investigation that detailed a toxic workplace - CNN"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "http://www.nbcsportsbayarea.com/nba/golden-state-warriors/brandin-podziemski-all-rookie-first-team-trayce-jackson-davis/1736703/", 
            "description": "After bursting onto the scene as a rookie during the 2023-24 NBA season, Warriors guard Brandin Podziemski has been rewarded for his standout efforts.", 
            "title": "Warriors' Podziemski earns 2023-24 NBA All-Rookie First Team honors - NBC Sports Bay Area"
        }, 
        {
            "url": "https://www.androidauthority.com/pixel-speaker-group-volume-control-3445010/", 
            "description": "With the release of Android 15 Beta 2, Pixel phones can once again control the volume of Google Home speaker groups while casting.", 
            "title": "Android 15 Beta 2 fully restores Cast volume controls for speaker groups on Pixel phones - Android Authority"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-hush-money-michael-cohen-363a86879b97d2367831b1392f42689d", 
            "description": "The judge overseeing Donald Trump’s hush money trial briefly closed the courtroom, forcing reporters into the hallway after he admonished a defense witness for his behavior on the witness stand. It happened minutes into the testimony of Robert Costello, a for…", 
            "title": "Judge admonishes defense witness for his behavior after prosecution rests in Trump hush money trial - The Associated Press"
        }, 
        {
            "url": "https://www.foxnews.com/world/un-holds-moment-silence-butcher-tehran-raisi-iranian-president-dies-helicopter-crash", 
            "description": "Despite earning the nickname the “Butcher of Tehran,\" the United Nations on Monday held a minute of silence for Ebrahim Raisi after the Iranian president died in a helicopter crash.", 
            "title": "UN holds moment of silence for ‘Butcher of Tehran’ Raisi after Iranian president dies in helicopter crash - Fox News"
        }, 
        {
            "url": "https://www.wkyt.com/2024/05/20/lfchd-declares-whooping-cough-an-outbreak/", 
            "description": "The Lexington-Fayette County Health Department has declared pertussis or whooping cough in outbreak status.", 
            "title": "LFCHD declares whooping cough an outbreak - WKYT"
        }, 
        {
            "url": "https://www.bbc.com/news/av/world-us-canada-69041446", 
            "description": "Ed Dwight was the first black astronaut candidate in 1961 - but was never picked for a Nasa mission.", 
            "title": "Decades after training, 90-year-old finally goes to space on Blue Origin flight - BBC.com"
        }, 
        {
            "url": "https://www.nhl.com/news/edmonton-oilers-vancouver-canucks-game-7-preview", 
            "description": "Vancouver needs to score without Boeser, Edmonton counting on Skinner to lead way", 
            "title": "3 Keys: Oilers at Canucks, Game 7 of Western 2nd Round - NHL.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/20/climate/doomsday-glacier-melt-antarctica-climate-intl/index.html", 
            "description": "Ocean water is pushing miles beneath Antarctica’s “Doomsday Glacier” on a daily basis making it more vulnerable to melting than previously thought, according to new research, which used radar data from space to perform an X-ray of the crucial glacier.", 
            "title": "Ocean water is rushing miles underneath the ‘Doomsday Glacier’ with potentially dire impacts on sea level rise - CNN"
        }
    ], 
    "last_updated": "2024-05-22 04:30:58"
}