{
    "news": [
        {
            "url": "https://www.bbc.com/news/articles/cg3340881p6o", 
            "description": "The government announced what it calls a \"comprehensive\" compensation scheme on Tuesday.", 
            "title": "'Blood compensation comes too late for my husband' - BBC.com"
        }, 
        {
            "url": "https://www.forbes.com/sites/daniellechemtob/2024/05/21/forbes-daily-target-aims-for-discounts-as-inflation-hits-summer-staples/", 
            "description": "Tuesday's edition of Forbes Daily covers Hims' new weight loss drug, Scarlett Johansson and OpenAI, Temu and Shein's impact on trade routes, Memorial Day prices and more.", 
            "title": "Forbes Daily: Target Aims For Discounts As Inflation Hits Summer Staples - Forbes"
        }, 
        {
            "url": "https://www.theringer.com/nba/2024/5/21/24161364/2024-nba-conference-finals-rudy-gobert-tyrese-haliburton", 
            "description": "Sometimes, NBA playoff series come down to whichever team has the best player. Other times, they hinge on the performance of a key non-star.", 
            "title": "The Four Biggest X Factors of the 2024 NBA Conference Finals - The Ringer"
        }, 
        {
            "url": "https://apnews.com/article/israel-palestinians-west-bank-jenin-raid-a3320a77a3a6ccff41db2a4bc63e4aa3", 
            "description": "Israel is seeking to contain the fallout from a request by the chief prosecutor of the world’s top war crimes court for arrest warrants for Israeli and Hamas leaders. The move was supported by three European countries, including key ally France. Belgium, Slov…", 
            "title": "Israel forces kill at least 7 Palestinians in West Bank raid - The Associated Press"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/21/one-dead-as-london-to-singapore-flight-hit-by-turbulence", 
            "description": "There were 211 passengers and 18 crew members on board the Boeing 777-300ER, which made an emergency landing in Bangkok.", 
            "title": "One dead as Singapore Airlines flight from London hit by severe turbulence - Al Jazeera English"
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-69041617", 
            "description": "On Monday, witness Robert Costello appeared frustrated on the stand, glaring at the judge.", 
            "title": "Trump trial: Judge reprimands Trump witness Robert Costello over groans - BBC.com"
        }, 
        {
            "url": "https://www.cbsnews.com/news/grizzly-grand-teton-surprise-attack/", 
            "description": "A grizzly bear attacked and seriously injured a man in western Wyoming's Grand Teton National Park, prompting closure of a mountain there.", 
            "title": "Surprise attack by grizzly leads to closure of a Grand Teton National Park mountain - CBS News"
        }, 
        {
            "url": "https://finance.yahoo.com/news/macys-beats-lowly-q1-estimates-as-it-weighs-a-future-between-a-turnaround-or-a-buyout-110456567.html", 
            "description": "Macy’s recorded another quarter of sales declines, but not as much as Wall Street feared.", 
            "title": "Macy's beats lowly Q1 estimates, as it weighs a future between a turnaround or a buyout - Yahoo Finance"
        }, 
        {
            "url": "https://nypost.com/2024/05/21/world-news/doomsday-glacier-is-more-vulnerable-than-scientists-thought-study/", 
            "description": "Dubbed the “Doomsday Glacier” by scientists, the Thwaites could raise global sea levels by up to two feet if it melts.", 
            "title": "Doomsday glacier is more vulnerable than scientists thought: study - New York Post "
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/21/lowes-low-q1-2024-earnings.html", 
            "description": "The home improvement retailer Lowe's said sales fell again year over year, and it reiterated its full-year earnings forecast.", 
            "title": "Lowe's beats on earnings and revenue, even as consumers spend less on DIY projects - CNBC"
        }, 
        {
            "url": "http://9to5google.com/2024/05/21/android-15-pixel-volume-control-speaker-groups/", 
            "description": "For the past few years, easy volume controls for speaker groups and other Cast devices from Pixel phones has been...", 
            "title": "Pixel gets speaker group volume controls back in Android 15 - 9to5Google"
        }, 
        {
            "url": "https://nypost.com/2024/05/21/entertainment/ben-affleck-skips-jennifer-lopezs-atlas-premiere/", 
            "description": "As the negative rumors about Jennifer Lopez and Ben Affleck’s marriage continue to mount, the singer had the premiere for her new sci-fi Netflix movie, “Atlas,” on Monday night.", 
            "title": "Ben Affleck skips Jennifer Lopez's 'Atlas' premiere amid rumored marriage woes - New York Post "
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZGVhZGxpbmUuY29tLzIwMjQvMDUvZG9uYWxkLXRydW1wLXRoZS1hcHByZW50aWNlLWNhbm5lcy1zZWJhc3RpYW4tc3Rhbi0xMjM1OTI1MzEyL9IBXmh0dHBzOi8vZGVhZGxpbmUuY29tLzIwMjQvMDUvZG9uYWxkLXRydW1wLXRoZS1hcHByZW50aWNlLWNhbm5lcy1zZWJhc3RpYW4tc3Rhbi0xMjM1OTI1MzEyL2FtcC8?oc=5", 
            "description": null, 
            "title": "‘The Apprentice’ Filmmaker Isn’t Scared By Donald Trump’s Legal Threats, Says “They Don’t Talk About His Success Rate” With Lawsuits; Hopes For September Release Date Timed To Election Debates – Cannes - Deadline"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3Lm5obC5jb20vb2lsZXJzL25ld3MvZ2FtZS1yZWNhcC1vaWxlcnMtMy1jYW51Y2tzLTItZ2FtZS03LTA1LTIwLTI00gEA?oc=5", 
            "description": null, 
            "title": "GAME RECAP: Oilers 3, Canucks 2 (Game 7) | Edmonton Oilers - NHL.com"
        }, 
        {
            "url": "https://www.cnn.com/travel/fujikawaguchiko-japan-photo-blocking-barrier-intl-hnk/index.html", 
            "description": "The Japanese town of Fujikawaguchiko has erected a giant black net to block views of Mount Fuji, a reaction to the town’s huge popularity on Instagram and other social media platforms.", 
            "title": "Japanese town overrun with tourists puts up view-blocking barrier near Mount Fuji - CNN"
        }, 
        {
            "url": "https://scitechdaily.com/webb-space-telescope-cracks-case-of-puffy-microwaved-marshmallow-exoplanet/", 
            "description": "A surprising deficiency of methane suggests that tidal heating has puffed up the atmosphere of the warm gas giant WASP-107 b. Why is the warm gas-giant exoplanet WASP-107 b so, so puffy? With a moderate temperature and an ultra-low density on par with a micro…", 
            "title": "Webb Space Telescope Cracks Case of Puffy “Microwaved Marshmallow” Exoplanet - SciTechDaily"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=fpX39HY7ujI", 
            "description": "Check out the gorgeous opening moments of Ninja Theory's long-anticipated Hellblade II, captured using a PC equipped with a GeForce RTX 4090 at full 4K 60fps...", 
            "title": "Senua's Saga: Hellblade 2 - The First 20 Minutes of Gameplay | 4K 60FPS PC Gameplay - IGN"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/21/france-to-deploy-more-troops-to-troubled-pacific-territory-of-new-caledonia", 
            "description": "Noumea’s international airport remains closed; Australia and New Zealand to use military planes to evacuate tourists.", 
            "title": "France to deploy more troops to troubled Pacific territory of New Caledonia - Al Jazeera English"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cm559l5g529o", 
            "description": "The star says she is \"shocked\" after OpenAI launched a chatbot with a voice \"eerily similar\" to hers.", 
            "title": "ChatGPT: Scarlett Johansson left 'angered' by chatbot imitation - BBC.com"
        }
    ], 
    "last_updated": "2024-05-22 15:00:00"
}