{
    "news": [
        {
            "url": "https://www.wcvb.com/article/karen-read-trial-live-updates-may-21-2024/60854413", 
            "description": "She's accused of killing her Boston police officer boyfriend by striking him with an SUV and leaving him to die in a snowbank.", 
            "title": "Karen Read murder trial: Live updates as key witness returns to stand - WCVB Boston"
        }, 
        {
            "url": "https://www.cbsnews.com/news/singapore-airlines-severe-turbulence-flight-321-london-death-injures-bangkok-landing/", 
            "description": "More than a dozen people on the Singapore Airlines Boeing 777 were also injured and it was forced to divert to Bangkok.", 
            "title": "Severe turbulence on Singapore Airlines flight 321 from London leaves 1 dead, others injured, airline says - CBS News"
        }, 
        {
            "url": "https://www.miamiherald.com/news/nation-world/world/article288608420.html", 
            "description": null, 
            "title": "Kensington Palace shares first official update regarding Princess Catherine’s return - Miami Herald"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/21/24158030/microsoft-copilot-ai-automation-agents", 
            "description": "Microsoft is getting ready to use AI to automate the boring bits of jobs. New Copilot AI agents will work like virtual employees to automate tasks.", 
            "title": "Microsoft's new Copilot AI agents act like virtual employees to automate tasks - The Verge"
        }, 
        {
            "url": "https://decrypt.co/231602/ethereum-etf-applicants-ditch-staking-temporary-concession-sec", 
            "description": "Spot Ethereum ETF filers have removed mentions of staking funds from their registration statements. One analyst says they \"bent the knee\" to the SEC.", 
            "title": "Ethereum ETF Applicants Ditch Staking Language in 'Temporary Concession' to SEC: Analyst - Decrypt"
        }, 
        {
            "url": "https://www.nbcnews.com/news/weather/severe-thunderstorms-possible-tornadoes-giant-hail-high-winds-forecast-rcna153224", 
            "description": "Severe thunderstorms are forecast to roll through the Midwest and the upper Great Lakes on Tuesday, bringing possible tornadoes, damaging winds and large hail.", 
            "title": "Severe thunderstorms with possible tornadoes, giant hail and high winds forecast to rock the Midwest - NBC News"
        }, 
        {
            "url": "https://finance.yahoo.com/news/macys-beats-lowly-q1-estimates-as-it-weighs-between-a-turnaround-and-a-buyout-144307951.html", 
            "description": "Macy’s recorded another quarter of sales declines, but not as much as Wall Street feared.", 
            "title": "Macy's beats lowly Q1 estimates, as it weighs a future between a turnaround or a buyout - Yahoo Finance"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-hush-money-robert-costello-b1beb56a666c398ae5393ede16c326da", 
            "description": "Donald Trump’s lawyers have rested their defense without the ex-president taking the witness stand in his New York hush money trial. The jury was sent home Tuesday until May 28, when closing arguments are expected. Trump did not stop to speak as he left the c…", 
            "title": "Defense rests without Trump taking the witness stand in his New York hush money trial - The Associated Press"
        }, 
        {
            "url": "https://www.npr.org/2024/05/21/1252616600/target-price-reductions-milk-butter", 
            "description": "Target joins other retailers trying to draw inflation-weary shoppers to stores. The chain says reductions have already been reflected in about 1,500 products.", 
            "title": "Target is cutting prices on 5000 items including milk, butter and pet food - NPR"
        }, 
        {
            "url": "https://abcnews.go.com/Entertainment/wireStory/elvis-presleys-granddaughter-fights-companys-attempt-sell-graceland-110431683", 
            "description": "The granddaughter of Elvis Presley is fighting plans to publicly auction his Graceland estate in Memphis after a company attempted to sell the property based on claims that a loan using it as collateral was not repaid", 
            "title": "Graceland is not for sale, Elvis Presley's granddaughter Riley Keough says in lawsuit - ABC News"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy91ay1wb2xpdGljcy02OTA0MzYxMdIBMWh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy91ay1wb2xpdGljcy02OTA0MzYxMS5hbXA?oc=5", 
            "description": null, 
            "title": "Move to extend police protest powers ruled unlawful - BBC.com"
        }, 
        {
            "url": "https://petapixel.com/2024/05/21/huge-adobe-lightroom-update-adds-ai-generative-remove-and-lens-blurring/", 
            "description": "Use AI to remove unwanted objects or add realistic blur to your photos.", 
            "title": "Huge Adobe Lightroom Update Adds AI Generative Remove and Lens Blurring - PetaPixel"
        }, 
        {
            "url": "https://nypost.com/2024/05/21/entertainment/jennifer-lopez-name-drops-ben-affleck-on-jkl-as-divorce-rumors-loom/", 
            "description": "Jennifer Lopez went on “Jimmy Kimmel Live!” the same day that Ben Affleck skipped the red carpet premiere for her new Netflix movie.", 
            "title": "What Jennifer Lopez said about Ben Affleck on 'JKL!' as divorce rumors loom - New York Post "
        }, 
        {
            "url": "https://www.cnn.com/2024/05/21/health/nightmares-daymares-autoimmune-flares-wellness/index.html", 
            "description": "Horrifying dreams involving murder or being crushed or trapped might be a sign of an emerging autoimmune disease such as lupus in certain people, a new study finds.", 
            "title": "Horrific nightmares may signal oncoming flare of these chronic diseases, study says - CNN"
        }, 
        {
            "url": "https://www.axios.com/2024/05/21/israel-ap-equipment-seized-al-jazeera", 
            "description": null, 
            "title": "Israeli officials seize AP equipment, cut live feed citing new media law - Axios"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=pk0PYLbCcug", 
            "description": null, 
            "title": "Andraya Carter outlines the SUCCESSES of Caitlin Clark in the WNBA so far | Get Up - ESPN"
        }, 
        {
            "url": "https://www.cbsnews.com/news/stress-can-impact-your-skin-experts/", 
            "description": "Stress can impact how your skin looks and feels, dermatologists say. Here's how — and what you can do about it.", 
            "title": "Stress can be \"the triggering factor\" for skin problems. Dermatologists share their advice. - CBS News"
        }, 
        {
            "url": "https://www.phillyvoice.com/report-eagles-news-wr-devante-parker-retire-nfl-depth-chart-britain-covey-ainias-smith-parris-campbell-johnny-wilson/", 
            "description": "DeVante Parker, who played with the Patriots the last two seasons, had signed with the Eagles in free agency back in March.", 
            "title": "Report: Eagles WR DeVante Parker retires from the NFL - PhillyVoice.com"
        }, 
        {
            "url": "https://www.npr.org/2024/05/21/1252631480/up-first-newsletter-icc-israel-hamas-arrest-warrants-target-price-cuts", 
            "description": "President Biden called an arrest warrant request for Israeli leaders \"outrageous.\"  Target is lowering prices on 5,000 common products.", 
            "title": "Up First briefing: ICC Israel and Hamas arrest warrants; Target price cuts - NPR"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/21/politics/trump-unified-reich-video/index.html", 
            "description": "Former President Donald Trump posted a video on Monday showing images of a fake newspaper article that references a “unified Reich” if he’s reelected in 2024.", 
            "title": "Trump posts video referencing ‘unified Reich’ if reelected - CNN"
        }
    ], 
    "last_updated": "2024-05-22 20:00:16"
}