{
    "news": [
        {
            "url": "https://www.cbsnews.com/philadelphia/news/delaware-county-linen-shooting-pennsylvania/", 
            "description": "A suspect is in custody after five people were shot, two fatally, in a workplace shooting today at Delaware County Linen in Chester, Pennsylvania, the DA said.", 
            "title": "5 people shot, 2 dead in Chester, Pennsylvania shooting at workplace, DA says - CBS News"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/22/politics/nikki-haley-donald-trump/index.html", 
            "description": "Former South Carolina Gov. Nikki Haley is supporting former President Donald Trump’s 2024 bid, she said Wednesday in her first public remarks since exiting the Republican presidential primary more than two months ago.", 
            "title": "Nikki Haley says she’s voting for Trump in November - CNN"
        }, 
        {
            "url": "https://www.cbsnews.com/news/uvalde-school-shooting-settlement-texas-city-lawsuits/", 
            "description": "Family members of Uvalde school shooting victims also said they're filing lawsuits against dozens of Texas Department of Public Safety officers and Uvalde's school district.", 
            "title": "Uvalde school shooting victims' families announce $2 million settlement with Texas city and new lawsuits - CBS News"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/22/24162429/scarlett-johansson-openai-legal-right-to-publicity-likeness-midler-lawyers", 
            "description": "OpenAI might find itself in legal trouble if Scarlett Johansson decides to use California’s right to publicity rules to protect her voice and identity against ChatGPT.", 
            "title": "Lawyers say OpenAI could be in real trouble with Scarlett Johansson - The Verge"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/22/world/sun-magnetic-field-scn/index.html", 
            "description": "The sun’s powerful magnetic field has long puzzled scientists. A new study suggests the source of its magnetic field is nearer the surface than first thought.", 
            "title": "Scientists say they’ve found where the sun’s magnetic field originates - CNN"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/22/health/ultraprocessed-food-stroke-cognitive-decline-wellness/index.html", 
            "description": "Ultraprocessed foods have been linked to poor health and early death. A new study bolsters those findings by showing a link to stroke and cognitive decline.", 
            "title": "Healthy diets with only 10% ultraprocessed foods may raise risk of cognitive decline, stroke - CNN"
        }, 
        {
            "url": "https://finance.yahoo.com/news/nvidia-stock-pops-4-after-earnings-beat-forecasts-announces-stock-split-and-dividend-hike-202405628.html", 
            "description": "Nvidia reported its fiscal first quarter earnings after the bell on Wednesday, beating analysts' expectations on the top and bottom lines while raising its...", 
            "title": "Nvidia stock pops 4% after earnings beat forecasts, announces stock split and dividend hike - Yahoo Finance"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cg33j53qe31o", 
            "description": "New harrowing footage shows the moment Naama Levy and other women were seized by Hamas gunmen.", 
            "title": "Israeli hostage's family hopes video is reminder of need for deal - BBC.com"
        }, 
        {
            "url": "https://www.espn.com/nfl/story/_/id/40198510/chiefs-patrick-mahomes-weighs-rashee-rice-harrison-butker", 
            "description": "Patrick Mahomes defended the character of Chiefs kicker Harrison Butker and also offered encouragement for wide receiver Rashee Rice after his two off-field incidents.", 
            "title": "Chiefs' Patrick Mahomes weighs in on Rashee Rice, Harrison Butker - ESPN"
        }, 
        {
            "url": "https://www.theverge.com/24162621/google-search-ai-overviews-get-rid-of", 
            "description": "Google’s AI Overviews offer AI-generated answers before your search results. There isn’t a way to turn them off, but there are a few methods you can try to get around them.", 
            "title": "You can get rid of AI Overviews in Google Search - The Verge"
        }, 
        {
            "url": "https://www.yahoo.com/entertainment/jennifer-lopez-ben-affleck-living-191628295.html", 
            "description": "A source confirms to Fox News Digital that Ben Affleck and Jennifer Lopez are living separately, nearly two years after tying the knot.", 
            "title": "Jennifer Lopez, Ben Affleck living separately as 'whirlwind of love' is over and 'real life' sets in: source - Yahoo Entertainment"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=awQSXHsgWA4", 
            "description": null, 
            "title": "Fed minutes indicate worries over the lack of progress on inflation - CNBC Television"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/22/investing/graceland-foreclosure-hearing/index.html", 
            "description": "Graceland can stay in the hands of Elvis Presley’s family for the time being, after a Tennessee court chancellor ruled Wednesday that a mysterious company trying to sell it likely committed fraud.", 
            "title": "Court rules Elvis’ Graceland mansion cannot be foreclosed upon – for now - CNN"
        }, 
        {
            "url": "https://www.usatoday.com/story/money/food/2024/05/22/red-lobster-closings-full-list/73802650007/", 
            "description": "Red Lobster's website lists 99 restaurant locations as closed. Here's a full list, including a state-by-state breakdown, of closed locations.", 
            "title": "Red Lobster location closures: See full list of 99 closed restaurants - USA TODAY"
        }, 
        {
            "url": "https://thehill.com/policy/healthcare/4679900-fish-oil-may-increase-risk-of-stroke-heart-conditions-study/", 
            "description": "Fish oil may increase the risk of stroke and heart conditions like atrial fibrillation, a new study found. The study, published Tuesday in the journal BMJ Medicine, followed more than 400,000 people in the United Kingdom aged 40 to 69 for 12 years. Those peop…", 
            "title": "Fish oil may increase risk of stroke, heart conditions: Study - The Hill"
        }, 
        {
            "url": "https://www.reuters.com/world/uk/rishi-sunak-calls-uk-national-election-july-4-2024-05-22/", 
            "description": "British Prime Minister Rishi Sunak called a national election on Wednesday for July 4, saying Britons would be able to choose their future in a vote his Conservatives are widely expected to lose to the opposition Labour Party after 14 years in power.", 
            "title": "Rishi Sunak calls UK national election for July 4 - Reuters UK"
        }, 
        {
            "url": "https://9to5mac.com/2024/05/22/sonos-ace-vs-airpods-max/", 
            "description": "This detailed comparison looks at the Sonos Ace vs AirPods Max headphones for audio specs, features, battery, price, and more.", 
            "title": "Sonos Ace vs AirPods Max - 9to5Mac"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/22/israel-lobbies-german-officials-to-condemn-icc-arrest-warrants", 
            "description": "Israeli embassy emails politicians as Berlin says it would arrest Netanyahu if warrant comes into force.", 
            "title": "Israel lobbies German officials to ‘condemn’ ICC arrest warrants - Al Jazeera English"
        }, 
        {
            "url": "https://toofab.com/2024/05/22/nicole-brown-simpsons-sisters-react-to-oj-simpsons-death/", 
            "description": "The Brown sister's comments come more than a month after the former football star died following a battle with cancer.", 
            "title": "Nicole Brown Simpson's Sisters React to OJ Simpson's Death - TooFab"
        }, 
        {
            "url": "http://9to5google.com/2024/05/22/android-find-my-device-trackers-shipping/", 
            "description": "After Google announced the launch of the Find My Device network on Android last month, the first trackers are finally...", 
            "title": "Android Find My Device trackers are starting to ship - 9to5Google"
        }
    ], 
    "last_updated": "2024-05-24 01:30:43"
}