{
    "news": [
        {
            "url": "https://www.youtube.com/watch?v=VD58jlmtkE8", 
            "description": "For more info on Coach Paint Lite click here: https://bit.ly/coachpaintlite and use my code: bballbreakdown for 10% OFF! #mavericks #lukadoncic #timberwolves...", 
            "title": "Luka INSANE Game Winner Exposes Wolves Issues | Mavericks Timberwolves Gm 2 Western Conf Finals - BBALLBREAKDOWN"
        }, 
        {
            "url": "https://thewaltdisneycompany.com/remembering-disney-legend-richard-m-sherman/", 
            "description": "Disney Legend Richard M. Sherman, half of the Academy Award®-winning songwriting team of the Sherman Brothers (with his late brother, Disney Legend Robert B. …Read More", 
            "title": "Remembering Disney Legend Richard M. Sherman - The Walt Disney Company"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/25/politics/samuel-alito-wife-upside-down-flag/index.html", 
            "description": "Supreme Court Justice Samuel Alito’s wife previously said the inverted American flag flown at the couple’s house in January 2021 was “an international signal of distress,” The Washington Post reported Saturday, detailing an encounter during that time between …", 
            "title": "Washington Post: Justice Samuel Alito’s wife said upside-down American flag was ‘an international signal of distress’ in 2021 - CNN"
        }, 
        {
            "url": "https://nypost.com/2024/05/25/us-news/six-people-eat-undercooked-bear-meat-contract-brain-worms/", 
            "description": "One family suffered a bear-y bad problem after consuming bear meat at a family reunion: brain worms.", 
            "title": "Six people contract 'brain worms' from eating undercooked bear kabobs - New York Post "
        }, 
        {
            "url": "https://apnews.com/article/trump-libertarian-convention-rfk-jr-biden-816e3209fdf993c2ba7f6caed0ebcdb7", 
            "description": "Donald Trump plans to use an address at the Libertarians’ national convention to court a segment of mostly conservative voters that has often been skeptical of the former president. He's also trying to ensure that party activists aren’t drawn to the campaign …", 
            "title": "Trump to go after RFK Jr. at Libertarian Party convention - The Associated Press"
        }, 
        {
            "url": "http://deadline.com/2024/05/cannes-movie-theaters-box-office-sean-baker-anora-1235941304/", 
            "description": "Sean Baker is concerned about the future of movie theaters. He hopes his Palme D'Or winner 'Anora' helps.", 
            "title": "‘Anora’ Palme D’Or Winner Sean Baker On The Plight Of Theatrical: “Discouraging” But Sees “A Rising Film Culture” – Cannes - Deadline"
        }, 
        {
            "url": "https://www.nbcnews.com/news/us-news/severe-storms-strike-eastern-half-us-memorial-day-weekend-heat-hits-so-rcna154076", 
            "description": "Dangerous severe storms will sweep across the eastern half of the U.S. this Memorial Day weekend, affecting a number of major cities from Saturday to Monday.", 
            "title": "Severe storms to strike eastern half of U.S. this Memorial Day weekend as heat hits the South - NBC News"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.washingtonpost.com/politics/2024/05/25/trump-biden-military-academy/", 
            "description": "The president spoke to graduates of the U.S. Military Academy at a time of numerous foreign policy challenges for the nation and the world.", 
            "title": "Biden indirectly rebukes Trump in West Point graduation speech - The Washington Post"
        }, 
        {
            "url": "https://www.pgatour.com/article/news/latest/2024/05/25/grayson-murray-obituary", 
            "description": "Grayson Murray, who won his second PGA TOUR title at this year’s Sony Open in Hawaii, passed away Saturday.", 
            "title": "PGA TOUR winner Grayson Murray passes away at 30 - PGA TOUR"
        }, 
        {
            "url": "https://www.nbcnews.com/news/sports/harrison-butker-no-regrets-commencement-speech-controversy-rcna154062", 
            "description": "In Harrison Butker's first public comments since giving a commencement speech that sparked accusations of sexism and homophobia, the Kansas City Chiefs kicker said he has no regrets.", 
            "title": "Harrison Butker says he does not regret commencement speech that sparked controversy - NBC News"
        }, 
        {
            "url": "https://www.foxnews.com/world/bidens-320m-gaza-pier-over-budget-under-constant-threat-purely-political-misadventure", 
            "description": "The Gaza humanitarian aid pier project has run to a cost that is estimated at double its initial budget as additional hurdles drive the overall costs even higher, and aid delivery remains at a trickle.", 
            "title": "Biden's $320M Gaza pier: Over budget and under constant threat, a 'purely political' misadventure - Fox News"
        }, 
        {
            "url": "https://www.espn.com/nba/story/_/id/40217637/pacers-star-tyrese-haliburton-hamstring-game-3", 
            "description": "Pacers guard Tyrese Haliburton is out for Game 3 against the Celtics due to a left hamstring injury. His availability for Game 4 is in question.", 
            "title": "Sources - Pacers' Tyrese Haliburton out for Game 3 - ESPN"
        }, 
        {
            "url": "https://www.reuters.com/world/middle-east/israel-presses-with-strikes-gaza-after-world-court-ruling-2024-05-25/", 
            "description": null, 
            "title": "Gaza ceasefire talks could soon resume but Israel-Hamas war rages on - Reuters"
        }, 
        {
            "url": "http://9to5google.com/2024/05/25/pixel-10-tensor-g5-tsmc/", 
            "description": "Last year, Google's switch to TSMC for the Tensor G5 was reported, and additional confirmation today shows that work for the Pixel 10...", 
            "title": "Tensor G5 development at TSMC for Pixel 10 progressing - 9to5Google"
        }, 
        {
            "url": "https://www.foxnews.com/entertainment/rapper-nicki-minaj-films-own-arrest-amsterdam", 
            "description": "Nicki Minaj took to Instagram early Saturday morning to share that she was detained by Amsterdam police while on her way to her show in Manchester, England.", 
            "title": "Rapper Nicki Minaj films own arrest in Amsterdam - Fox News"
        }, 
        {
            "url": "https://www.avclub.com/furiosa-is-fighting-garfield-for-one-of-the-worst-memor-1851501294", 
            "description": "Despite strong reviews, Furiosa: A Mad Max Saga is on track for the worst Memorial Day opening since the '80s", 
            "title": "Furiosa is fighting Garfield for one of the worst Memorial Day box offices in decades - The A.V. Club"
        }, 
        {
            "url": "https://www.washingtonpost.com/business/2024/05/25/russia-assets-ukraine-yellen/", 
            "description": "Treasury Secretary Janet L. Yellen is close to securing European support for a plan to repurpose seized Russian assets for Ukraine.", 
            "title": "U.S., allies take key step toward funding Ukraine with Russian assets - The Washington Post"
        }, 
        {
            "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/what-does-louisianas-new-abortion-pill-law-mean-patients-2024-05-25/", 
            "description": "Here is a look at what the law does, and what might happen next.", 
            "title": "Explainer: What does Louisiana's new abortion pill law mean for patients? - Reuters"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/25/europe/kharkiv-russian-strike-hypermarket-ukraine-intl/index.html", 
            "description": "At least two people have been killed and others are missing after a Russian strike hit a large hardware store in Kharkiv, Ukraine on Saturday, according to officials.", 
            "title": "At least two killed and others missing after Russia strikes hardware store in Kharkiv - CNN"
        }
    ], 
    "last_updated": "2024-05-27 02:00:43"
}