{
    "news": [
        {
            "url": "https://www.theverge.com/24144427/ipad-air-pro-preorder-buy-how-to", 
            "description": "Apple’s latest iPad Pro and iPad Air will launch on May 15th, but you can already preorder them via Apple. Here’s what you need to know in terms of pricing and availability.", 
            "title": "Here's where you can preorder Apple's latest iPad Air and iPad Pro - The Verge"
        }, 
        {
            "url": "https://www.startribune.com/denver-nuggets-jamal-murray-heat-pack-throw-onto-floor-loss-timberwolves-playoffs/600364165/", 
            "description": "Game officials didn't see what he did in real time. But the NBA fined Nuggets star Jamal Murray for his actions during Game 2 of the NBA playoffs.", 
            "title": "Nuggets' Jamal Miuray fined $100000 for throwing heat pack in Game 2 - Star Tribune"
        }, 
        {
            "url": "https://www.washingtonpost.com/business/2024/05/08/biden-foxconn-white-house-trump/", 
            "description": "The investment is expected to create 2,000 permanent jobs and 2,300 temporary union construction jobs.", 
            "title": "Biden champions Microsoft artificial intelligence investment in Wisconsin - The Washington Post"
        }, 
        {
            "url": "https://www.washingtonpost.com/world/2024/05/08/ukraine-electricity-rationing-russia-war/", 
            "description": "The Russian missile and drone strikes, which lasted more than three hours early Wednesday, targeted energy infrastructure in six Ukrainian regions.", 
            "title": "Ukraine orders nationwide electricity rationing after Russian airstrikes - The Washington Post"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/07/stock-market-today-live-updates.html", 
            "description": "The Dow Jones Industrial Average traded higher Wednesday, trying to extend its winning streak to six days straight.", 
            "title": "Stock market today: Live updates - CNBC"
        }, 
        {
            "url": "https://www.macrumors.com/2024/05/08/ipod-nano-appears-in-new-ipad-pro-ad/", 
            "description": "The new iPad Pro has dethroned the iPod nano as Apple's thinnest device ever, and the company has promoted this feat in a nostalgic ad.   In a...", 
            "title": "iPod Nano Makes Rare Appearance in Apple Ad for Thinner iPad Pro - MacRumors"
        }, 
        {
            "url": "https://www.reuters.com/world/middle-east/netanyahu-weighs-risks-rafah-assault-hostage-dilemma-divides-israelis-2024-05-08/", 
            "description": null, 
            "title": "Netanyahu weighs risks of Rafah assault as hostage dilemma divides Israelis - Reuters"
        }, 
        {
            "url": "https://www.nbcnews.com/politics/2024-election/indiana-primary-results-election-governor-senate-rcna151051", 
            "description": "Indiana Republican Rep. Jim Banks won the state’s GOP Senate primary unopposed Tuesday, while Sen. Mike Braun won the nomination for governor.", 
            "title": "Indiana primary election results: Mike Braun wins GOP governor primary, Jim Banks wins Senate primary - NBC News"
        }, 
        {
            "url": "https://gizmodo.com/webb-spots-nearby-rocky-super-earth-atmosphere-1851461827", 
            "description": "The Webb Space Telescope has uncovered a nearby rocky planet with a volatile atmosphere.", 
            "title": "A Planet Just 41 Light-Years From Earth Has an Atmosphere and Is Covered in a Magma Ocean - Gizmodo"
        }, 
        {
            "url": "https://www.bbc.com/news/world-middle-east-68978322", 
            "description": "By delaying a weapons shipment, the US is finally reaching for its biggest lever of influence over Israel.", 
            "title": "Gaza war: US bomb delay biggest warning yet for Israel - BBC.com"
        }, 
        {
            "url": "https://www.npr.org/2024/05/08/1249920941/fani-wade-disqualification-appeal-trump-georgia-case", 
            "description": "The Georgia Court of Appeals will hear oral arguments after former President Trump appealed a decision allowing Fulton County DA Fani Willis to stay on the criminal case involving him and others.", 
            "title": "Georgia appeals court will review Fani Willis disqualification ruling - NPR"
        }, 
        {
            "url": "https://www.nbcnews.com/news/weather/major-storms-continue-country-devastating-overnight-tornadoes-michigan-rcna151217", 
            "description": "A major storm threat bringing damaging winds, large hail and possible tornadoes continues to batter parts of the country from Texas to the mid-Atlantic.", 
            "title": "Major storms continue across the country following devastating overnight tornadoes in Michigan - NBC News"
        }, 
        {
            "url": "https://finance.yahoo.com/news/ftx-billions-more-needed-pay-231400349.html", 
            "description": null, 
            "title": "FTX Has Billions More Than Needed to Pay Bankruptcy Victims - Yahoo Finance"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.foxnews.com/world/idf-releases-footage-precise-counterterrorism-operation-rafah-feud-biden-admin", 
            "description": "Israeli forces are conducting \"precise\" operations around Rafah despite protest from President Biden's administration on Tuesday.", 
            "title": "IDF releases footage of ‘precise counterterrorism operation’ in Rafah amid feud with Biden admin - Fox News"
        }, 
        {
            "url": "https://www.washingtonpost.com/nation/2024/05/08/college-protests-professors-arrests-suspensions/", 
            "description": "College faculty members said they’ve felt a duty to support their students during pro-Palestinian protests even as they’ve faced arrests and suspensions.", 
            "title": "College faculty face discipline for supporting pro-Palestinian student protesters - The Washington Post"
        }, 
        {
            "url": "https://www.pushsquare.com/reviews/ps5/crow-country", 
            "description": "Prepare to eat crow", 
            "title": "Crow Country Review (PS5) - Push Square"
        }, 
        {
            "url": "https://www.today.com/health/news/kim-kardashian-waist-met-gala-rcna151019", 
            "description": "Kim Kardashian's waist in her Maison Margiela dress at the 2024 Met Gala was certainly one of the most memorable looks to hit the red carpet.", 
            "title": "Kim Kardashian's Waist At Met Gala: How Did She Do It? Is It Safe? - TODAY"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://finance.yahoo.com/news/just-one-human-infected-bird-121130918.html", 
            "description": "(Bloomberg) -- It’s spreading rapidly among cows. It’s also infecting skunks, mountain lions and red foxes.Most Read from BloombergAmericans Are Racking Up ‘...", 
            "title": "Just One Human Is Infected by Bird Flu in the US. More Cases Are Likely - Yahoo Finance"
        }
    ], 
    "last_updated": "2024-05-09 18:38:21"
}