{
    "news": [
        {
            "url": "https://www.usatoday.com/story/sports/nba/playoffs/2024/05/22/rick-carlisle-takes-blame-indiana-pacers-loss-to-boston-celtics/73798568007/", 
            "description": null, 
            "title": "Rick Carlisle takes blame for Indiana Pacers' loss to Boston Celtics - USA TODAY"
        }, 
        {
            "url": "https://www.cbsnews.com/boston/news/harvard-university-students-pro-palestinian-encampment-degrees/", 
            "description": "Thirteen Harvard University students who participated in the pro-Palestinian protest encampment on campus will not receive degrees at commencement Thursday.", 
            "title": "13 Harvard University students who participated in pro-Palestinian encampment will not get degrees - CBS Boston"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=K0qKWaxDYrw", 
            "description": "The Senate on Thursday is set to vote on a bipartisan security package that Republicans killed earlier this year.» Subscribe to MSNBC: https://www.youtube.co...", 
            "title": "Senate to vote on border security package - MSNBC"
        }, 
        {
            "url": "https://nypost.com/2024/05/23/us-news/elvis-graceland-alleged-auction-fraud-catches-eyes-of-interested-fbi-officials-reports/", 
            "description": "FBI agents have reportedly been in touch with Elvis Presley’s granddaughter Riley Keough’s camp about conducting a possible criminal probe.", 
            "title": "Elvis' Graceland alleged auction fraud catches eyes of ‘interested’ FBI officials: reports - New York Post "
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3Lm5iY25ld3MuY29tL25ld3MvdXMtbmV3cy9kZWFkbHktdG9ybmFkby1kZXZhc3RhdGVzLWlvd2EtdG93bi1zZXZlcmUtd2VhdGhlci1tb3Zlcy1zb3V0aC1yY25hMTUzNDMw0gEraHR0cHM6Ly93d3cubmJjbmV3cy5jb20vbmV3cy9hbXAvcmNuYTE1MzQzMA?oc=5", 
            "description": null, 
            "title": "4 dead, dozens injured in tornado that devastated Iowa town - NBC News"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/23/house-republicans-college-leaders-protest-negotiations-00159541", 
            "description": null, 
            "title": "House GOP to grill college leaders for negotiating with protesters - POLITICO"
        }, 
        {
            "url": "https://finance.yahoo.com/news/nvidia-stock-pops-7-to-top-1000-after-earnings-beat-forecasts-it-announces-stock-split-and-dividend-hike-202405568.html", 
            "description": "Nvidia reported its fiscal first quarter earnings after the bell on Wednesday, beating analysts' expectations on the top and bottom lines while raising its...", 
            "title": "Nvidia stock pops 7% to top $1,000 after earnings beat forecasts, it announces stock split and dividend hike - Yahoo Finance"
        }, 
        {
            "url": "https://www.bbc.com/news/uk-politics-69050450", 
            "description": "The PM calls an early summer poll in a rain-soaked speech outside 10 Downing Street.", 
            "title": "Rishi Sunak announces UK general election for Thursday 4 July - BBC.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/22/asia/china-military-drills-taiwan-punishment-intl-hnk/index.html", 
            "description": "China has launched two days of military drills surrounding Taiwan in what it called “punishment” for “separatist acts,” days after the self-ruling island swore in a new democratically elected leader.", 
            "title": "China starts ‘punishment’ military drills around Taiwan days after island swears in new leader - CNN"
        }, 
        {
            "url": "https://www.npr.org/2024/05/23/nx-s1-4977237/ap-at-least-9-dead-after-a-stage-collapsed-at-a-political-rally-in-mexico", 
            "description": "A strong gust of wind toppled the stage at a campaign rally Wednesday in the northern Mexican state of Nuevo Leon. In addition to the deaths, at least 60 people were injured.", 
            "title": "At least 9 people are dead after a stage collapsed at a political rally in Mexico - NPR"
        }, 
        {
            "url": "https://www.reuters.com/world/israel-reprimand-irish-norwegian-spanish-envoys-over-palestine-move-2024-05-23/", 
            "description": null, 
            "title": "Israel to reprimand Irish, Norwegian, Spanish envoys over Palestine move - Reuters"
        }, 
        {
            "url": "https://www.businessinsider.com/asml-tsmc-semiconductor-chip-equipment-kill-switch-china-invade-taiwan-2024-5", 
            "description": "Chip giants ASML and TSMC have a remote shutdown option for their advanced EUV chipmaking machines, Bloomberg reported.", 
            "title": "ASML, TSMC can flip chip gear 'kill switch' should China invade Taiwan - Business Insider"
        }, 
        {
            "url": "https://apnews.com/article/nba-playoffs-mavericks-timberwolves-score-b2f2d190d1a0589c2a4ac7b7b15c2d85", 
            "description": "Luka Doncic had 15 of his 33 points in the fourth quarter to lift the Dallas Mavericks to a 108-105 victory over the Minnesota Timberwolves in Game 1 of the Western Conference finals. Kyrie Irving scored 24 of his 30 points in the first half for the Mavericks…", 
            "title": "Doncic leads strong close by Mavericks for 108-105 win over Wolves in Game 1 of West finals - The Associated Press"
        }, 
        {
            "url": "https://bleacherreport.com/articles/10122280-caitlin-clarks-fever-fall-to-0-5-disappoint-wnba-fans-with-loss-to-loyd-storm", 
            "description": "The wait for their first win continues on for Caitlin Clark and the Indiana Fever. Indiana lost 85-83 to the Seattle Storm on Thursday at Climate Pledge Arena…", 
            "title": "Caitlin Clark's Fever Fall to 0-5, Disappoint WNBA Fans with Loss to Loyd, Storm - Bleacher Report"
        }, 
        {
            "url": "https://www.axios.com/2024/05/22/nikki-haley-trump-endorse-vote-2024-election", 
            "description": null, 
            "title": "Nikki Haley says she'll vote for Trump in November - Axios"
        }, 
        {
            "url": "https://www.npr.org/sections/shots-health-news/2024/05/23/1252941968/adhd-diagnoses-are-rising-1-in-9-u-s-kids-have-gotten-one-new-study-finds", 
            "description": "ADHD is an ongoing and expanding public health concern, according to researchers studying the disorder. One million more U.S. children were diagnosed in 2022 compared to 2016, a new study shows.", 
            "title": "ADHD diagnoses are rising. 1 in 9 U.S. kids have gotten one, new study finds - NPR"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/22/travel/san-jose-colombia-shipwreck-expedition-discovery-intl-hnk/index.html", 
            "description": "Colombia has launched the initial phase of an underwater expedition to explore a Spanish warship that sank in the Caribbean more than 300 years ago – believed to contain billions of dollars worth of artifacts and the rights to which are under heated dispute.", 
            "title": "Colombia launches expedition to explore 300-year-old Spanish shipwreck filled with sunken treasure - CNN"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cv22k054z5zo", 
            "description": "Officials are expected to challenge the company's business practices, the BBC's US partner CBS News reported.", 
            "title": "Live Nation: US Department of Justice to sue TicketMaster owner - BBC.com"
        }, 
        {
            "url": "https://thehill.com/regulation/court-battles/4681151-bolton-defends-alito-amid-outrageous-flag-controversy/", 
            "description": "Former national security adviser John Bolton on Wednesday fiercely defended Supreme Court Justice Samuel Alito against a barrage of criticism following reporting that, at one point, two flags associated with the Jan. 6, 2021, attack on the Capitol had been on…", 
            "title": "Bolton defends Alito amid ‘outrageous’ flag controversy - The Hill"
        }, 
        {
            "url": "https://www.sciencealert.com/bird-flu-jumps-to-human-from-cow-for-second-time-in-the-us", 
            "description": "A second case of bird flu has been found in a human, US health authorities announced Wednesday, less than two months after the first one as an outbreak of the disease circulates widely among dairy cows.", 
            "title": "Bird Flu Jumps to Human From Cow For Second Time in The US - ScienceAlert"
        }
    ], 
    "last_updated": "2024-05-24 17:00:03"
}