{
    "news": [
        {
            "url": "https://tvline.com/news/johnny-wactor-dead-general-hospital-cause-of-death-obituary-1235246686/", 
            "description": "'General Hospital's Johnny Wactor has died at the age of 37 — read his obituary.", 
            "title": "Johnny Wactor Dead at 37: 'General Hospital' Actor's Cause of Death - TVLine"
        }, 
        {
            "url": "https://apnews.com/article/furiosa-box-office-1b2a9c0aefec99b5105a09bfaf15679b", 
            "description": "The Memorial Day box office is cruising for a two-decade low. “Furiosa,” the Mad Max prequel starring Anya Taylor-Joy and Chris Hemsworth, claimed the first place spot for Friday-Saturday-Sunday with $25.6 million. That is according to studio estimates on Sun…", 
            "title": "'Furiosa,' 'Garfield' lead slowest Memorial Day box office in decades - The Associated Press"
        }, 
        {
            "url": "https://www.usatoday.com/story/sports/motor/indycar/2024/05/26/indianapolis-500-live-updates-winner-2024-results/73841543007/", 
            "description": "The 108th edition of the Indy 500 is underway after thunderstorms delayed the start of the race by four hours. Follow along for updates.", 
            "title": "Indy 500 live updates: Results, updates, leaders, how Kyle Larson fares at Indianapolis - USA TODAY"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/26/world/qatar-airways-turbulence-dublin-injured-intl/index.html", 
            "description": "Six passengers and six cabin crew were injured after a Qatar Airways flight from Doha to Dublin was hit with turbulence on Sunday.", 
            "title": "12 people injured during turbulence on Qatar Airways flight - CNN"
        }, 
        {
            "url": "http://deadline.com/2024/05/golf-world-struggles-grayson-murray-suicide-news-1235941563/", 
            "description": "Emotions ran high as the news came of Grayson Murray's suicide.", 
            "title": "Golf World Struggles With Grayson Murray Suicide News - Deadline"
        }, 
        {
            "url": "https://www.indystar.com/picture-gallery/sports/motor/indy-500/2024/05/26/month-of-may-crash-photos-2024-marcus-ericsson-rinus-veekay-among-wrecks/73853082007/", 
            "description": "Crash photos during the 2024 Month of May at Indianapolis Motor Speedway.", 
            "title": "Month of May crash photos 2024: Marcus Ericsson, Rinus VeeKay among wrecks - IndyStar"
        }, 
        {
            "url": "https://www.mlb.com/news/ronald-acuna-jr-exits-game-vs-pirates", 
            "description": null, 
            "title": "Ronald Acuña Jr. exits game vs. Pirates - MLB.com"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cxxxp1w6e2ro", 
            "description": "Powerful storms devastate areas in Texas, Arkansas and Oklahoma and leave hundreds of thousands without power.", 
            "title": "Tornadoes rip through Texas, Arkansas and Oklahoma, killing 14 - BBC.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/26/politics/video/donald-trump-libertarian-convention-booed-heckled-contorno-ctmwknd-vpx", 
            "description": "Former President Donald Trump was loudly and consistently booed throughout his speech to the Libertarian convention, particularly when he asked attendees to “nominate me or at least vote for me.” CNN’s Steve Contorno reports.", 
            "title": "Watch Trump react to getting booed at Libertarian convention - CNN"
        }, 
        {
            "url": "https://www.cbsnews.com/boston/news/amc-theater-massachusetts-stabbing-braintree/", 
            "description": "A man stabbed four girls inside a theater at an AMC multiplex in Braintree, Massachusetts, police said.", 
            "title": "4 girls hurt during unprovoked stabbing attack in AMC movie theater near Boston; suspect arrested - CBS Boston"
        }, 
        {
            "url": "https://nypost.com/2024/05/26/us-news/trumps-bronx-rally-should-be-wake-up-call-for-biden-dem-ex-gov-paterson/", 
            "description": "“This is a wake-up call to the Democratic Party, who just seems to think that you can criticize what Trump did four years ago and that that will be enough,” Paterson said on 77 WABC radio&#82…", 
            "title": "Trump's well-attended Bronx rally should be 'wake-up call' for Biden: Dem ex-Gov. Paterson - New York Post "
        }, 
        {
            "url": "https://bgr.com/science/it-might-be-time-for-nasa-to-bail-on-boeings-starliner/", 
            "description": "The first crewed launch of Boeing's Starliner has been put on hold once again. Maybe it's time to let the dream go.", 
            "title": "It might be time for NASA to bail on Boeing's Starliner - BGR"
        }, 
        {
            "url": "https://www.foxnews.com/entertainment/nicki-minaj-shares-update-after-amsterdam-arrest-livestream-ill-have-lawyers-god-take-from-here", 
            "description": "Nicki Minaj updated fans after she missed a show due to an alleged arrest in Amsterdam for drug possession, which she had livestreamed earlier that day.", 
            "title": "Nicki Minaj shares update after Amsterdam arrest livestream: ‘I’ll have the lawyers & GOD take it from here’ - Fox News"
        }, 
        {
            "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-26-2024-eb25eb70d2c7b9e6bcd0497060eccbca", 
            "description": "Palestinian medics say an Israeli airstrike has killed at least 22 people when it hit tents for displaced people in the southern Gaza city of Rafah. They say “numerous” others are trapped in the debris. The strike Sunday came two days after the International …", 
            "title": "Palestinian medics say Israeli airstrike kills 22 in Gaza's Rafah as displaced people are hit - The Associated Press"
        }, 
        {
            "url": "https://www.wave3.com/2024/05/26/man-dead-after-being-hit-by-tree-east-louisville-during-severe-weather/", 
            "description": "One person has died following the severe weather that pushed through Louisville Sunday afternoon, according to Mayor Craig Greenberg.", 
            "title": "Man dead after being hit by tree in east Louisville during severe weather - WAVE 3"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.cnet.com/deals/best-memorial-day-appliance-sales-2024-05-26/", 
            "description": "The holiday weekend brings eye-opening discounts from major retailers on big-ticket appliances for your home.", 
            "title": "Memorial Day Weekend Appliance Deals: Huge Savings on Refrigerators, Dishwashers, Microwaves and More - CNET"
        }, 
        {
            "url": "https://www.indiewire.com/awards/predictions/cannes-palme-dor-winner-anora-jesse-plemons-oscar-boost-1235009182/", 
            "description": "At the 2024 Cannes Film Festival, Palme d'Or winner 'Anora' and Best Actor winner Jesse Plemons Get an Oscars boost.", 
            "title": "Cannes: Palme d'Or Winner 'Anora,' Jesse Plemons Get Oscar Boost - IndieWire"
        }, 
        {
            "url": "https://www.foxbusiness.com/markets/buttigieg-defends-bidens-ev-strategy-after-question-how-only-8-federal-charging-stations-have-been-built", 
            "description": "Transportation Secretary Pete Buttigieg said the \"handful\" of EV charging stations that have been built are the \"beginning stages\" of Biden's goal to reach 500,000 by 2030.", 
            "title": "Buttigieg defends Biden’s EV strategy after question on how only 8 federal charging stations have been built - Fox Business"
        }, 
        {
            "url": "https://www.nbcnews.com/news/weather/350000-power-missouri-arkansas-kentucky-storms-batter-middle-america-rcna154115", 
            "description": "At least 15 deaths have been reported as a series of severe storms and tornadoes battered the South and the Great Plains over Memorial Day weekend, leaving hundreds of thousands of homes and businesses without power.", 
            "title": "Nearly 400,000 without power in Missouri, Arkansas, Kentucky as storms batter central U.S. - NBC News"
        }
    ], 
    "last_updated": "2024-05-28 03:08:36"
}