{
    "news": [
        {
            "url": "https://www.cnn.com/2024/05/21/politics/mar-a-lago-documents-walt-nauta-donald-trump/index.html", 
            "description": "Months before Donald Trump was indicted for mishandling classified documents, a federal judge said that investigators had “strong evidence” that the former president “intended” to hide classified documents at his Mar-a-Lago resort, according to newly released…", 
            "title": "Federal judge found ‘strong evidence’ of crimes before Trump was charged in classified documents case - CNN"
        }, 
        {
            "url": "https://www.foxweather.com/weather-news/severe-weather-outbreak-midwest-tuesday", 
            "description": "A series of large, violent tornadoes struck the Hawkeye State on Tuesday, causing significant destruction in some rural communities.", 
            "title": "Tornadoes cause destruction in Iowa as deadly storms race across state - Fox Weather "
        }, 
        {
            "url": "https://www.youtube.com/watch?v=wM7Uk5l1S-k", 
            "description": "HOOP STREAMS IS BACK! Will the Celtics or Pacers come out of the East? Gary Striewski and Cassidy Hubbarth, break down which team has the best odds to advanc...", 
            "title": "Boston Celtics vs Indiana Pacers ECF preview: Can the Pacers steal game 1? | Hoop Streams 🏀 - ESPN"
        }, 
        {
            "url": "https://apnews.com/article/singapore-airlines-flight-turbulence-5a9a268e1a6a6fb9ece7e58b5ea9231b", 
            "description": "Singapore Airlines says one of its flights hit severe turbulence over the Indian Ocean and descended 6,000 feet in about three minutes. Authorities say a British man died, possibly after a heart attack, and several people were severely injured. The flight fro…", 
            "title": "Singapore Airlines flight: 1 dead, dozens injured after severe turbulence - The Associated Press"
        }, 
        {
            "url": "https://www.cbsnews.com/news/rudy-giuliani-arraignment-arizona-elector-scheme-2020-election/", 
            "description": "Arizona is one of seven states that Trump lost in 2020 where his allies are accused of schemes to put up alternate electors.", 
            "title": "Rudy Giuliani pleads not guilty as Trump allies are arraigned in Arizona 2020 election case - CBS News"
        }, 
        {
            "url": "https://www.axios.com/2024/05/21/biden-trump-unified-reich-nazi-germany", 
            "description": null, 
            "title": "Biden blasts Trump's \"unified Reich\" video: \"That's Hitler's language\" - Axios"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://spacenews.com/spacex-nears-next-starship-test-flight-as-starbase-expansion-continues/", 
            "description": "As SpaceX prepares for its next Starship test flight, the company is also working to scale up facilities in Texas to build and launch those vehicles.", 
            "title": "SpaceX nears next Starship test flight as Starbase expansion continues - SpaceNews"
        }, 
        {
            "url": "https://www.si.com/golf/louisville-police-say-internal-investigation-ongoing-scottie-scheffler-arrest", 
            "description": "The police chief said in a statement that any policy violations “will be appropriately addressed” and that an update on the investigation will be provided Thursday.", 
            "title": "Louisville Police Says Internal Investigation 'Ongoing' After Scheffler Arrest - Sports Illustrated"
        }, 
        {
            "url": "https://www.nbcnews.com/business/real-estate/rents-are-rising-falling-rcna153402", 
            "description": "Driven by the work-from-home dynamic, as well as by new migration patterns, both single-family and multifamily rent prices were red-hot during the first years of the pandemic.", 
            "title": "Here's where rents are rising — and where they're falling - NBC News"
        }, 
        {
            "url": "https://www.wsoctv.com/news/local/family-says-hornets-star-lamelo-ball-drove-over-her-sons-foot-sues-player-team/NNDHLNYVTJHCBE53VOEEYIMBKE/", 
            "description": "A local family is suing Charlotte Hornets star LaMelo Ball claiming he drove over their son's foot and broke it.", 
            "title": "Family says Hornets star LaMelo Ball drove over her son’s foot, sues player and team - WSOC Charlotte"
        }, 
        {
            "url": "https://techcrunch.com/2024/05/21/microsoft-build-2024-windows-ai-operating-system-copilot-plus-pcs/", 
            "description": "Microsoft unveiled a new lineup of Windows machines it's calling Copilot+ PCs, plus generative AI-powered features. And new Microsoft Surface devices are on the way.", 
            "title": "Microsoft wants to make Windows an AI operating system, launches Copilot+ PCs - TechCrunch"
        }, 
        {
            "url": "https://www.usatoday.com/story/money/2024/05/21/trump-media-truth-social-stock-price/73788529007/", 
            "description": "Trump Media, the parent company of Truth Social, trading on the stock market as DJT, reported more than $300 million in losses in Q1 of 2024.", 
            "title": "Truth Social lost more than $300 million. Stock prices falling - USA TODAY"
        }, 
        {
            "url": "https://www.space.com/dream-chaser-space-plane-arrives-florida", 
            "description": "The vehicle, named Tenacity, will reach orbit in the coming months, if all goes to plan.", 
            "title": "Dream Chaser space plane arrives in Florida ahead of 1st launch to ISS (photo) - Space.com"
        }, 
        {
            "url": "https://www.wsj.com/us-news/trump-testimony-unlikely-hush-money-trial-736af137", 
            "description": null, 
            "title": "Donald Trump Decides Against Testifying in Hush-Money Trial, Defense Rests - The Wall Street Journal"
        }, 
        {
            "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/south-carolina-governor-signs-ban-gender-affirming-care-transgender-mi-rcna153382", 
            "description": "Gov. Henry McMaster signed into law a ban on gender-affirming care for transgender minors, making South Carolina the 25th state to restrict or ban such care.", 
            "title": "South Carolina governor signs ban on gender-affirming care for transgender minors - NBC News"
        }, 
        {
            "url": "https://www.foxnews.com/us/virginia-father-detained-turks-caicos-stray-ammo-pleads-guilty", 
            "description": "Turks and Caicos police arrested Tyler Wenrich on April 20 after airport security they found two stray bullets in his luggage before his flight home. He pleaded guilty on Monday.", 
            "title": "Virginia father detained in Turks and Caicos for stray ammo pleads guilty - Fox News"
        }, 
        {
            "url": "https://www.npr.org/2024/05/21/1252727848/antarctica-thwaites-glacier-climate-change-sea-level-rise", 
            "description": "At 80 miles across, Thwaites is the world's widest glacier. It has been nicknamed the \"Doomsday Glacier\" for the catastrophic effects its thawing could have on global sea-level rise.", 
            "title": "New research on Antarctica's Thwaites Glacier could reshape sea-level rise predictions - NPR"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.fox5atlanta.com/election/georgia-2024-primary-election-results-fulton-county", 
            "description": "This story features results for the 2024 Georgia Democratic and Republican primaries held May 21, including District Attorney Fani Willis.", 
            "title": "Fulton County Georgia 2024 primary election results - FOX 5 Atlanta"
        }
    ], 
    "last_updated": "2024-05-23 04:00:51"
}