{
    "news": [
        {
            "url": "https://www.pgatour.com/article/news/latest/2024/05/25/grayson-murray-obituary", 
            "description": "Grayson Murray, who won his second PGA TOUR title at this year’s Sony Open in Hawaii, passed away Saturday.", 
            "title": "PGA TOUR winner Grayson Murray passes away at 30 - PGA TOUR"
        }, 
        {
            "url": "https://www.usatoday.com/story/news/nation/2024/05/25/brain-worms-black-bear-meat/73853429007/", 
            "description": null, 
            "title": "Brain worms hit family gathering after they eat black bear meat: CDC - USA TODAY"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "http://deadline.com/2024/05/cannes-film-festival-winners-2024-full-list-1235940952/", 
            "description": "Sean Baker's Anora has won the Palme d'Or at this year's Cannes Film Festival - see the full list of winners", 
            "title": "Cannes Film Festival: ‘Anora’ Wins Palme D’Or; ‘All We Imagine As Light’ Takes Grand Prize; ‘Emilia Perez’ Jury Prize & Best Actress Ensemble – Full List - Deadline"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.thedailybeast.com/harrison-butker-breaks-his-silence-on-controversial-commencement-speech", 
            "description": "The deeply Catholic Chiefs kicker made his first public address since he went viral for telling female college graduates to embrace being homemakers.", 
            "title": "Harrison Butker Breaks His Silence and Doubles Down on Viral Commencement Speech - The Daily Beast"
        }, 
        {
            "url": "https://www.washingtonpost.com/business/2024/05/25/russia-assets-ukraine-yellen/", 
            "description": "Treasury Secretary Janet L. Yellen is close to securing European support for a plan to repurpose seized Russian assets for Ukraine.", 
            "title": "U.S., allies take key step toward funding Ukraine with Russian assets - The Washington Post"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/25/europe/kharkiv-russian-strike-hypermarket-ukraine-intl/index.html", 
            "description": "At least two people have been killed and others are missing after a Russian strike hit a large hardware store in Kharkiv, Ukraine on Saturday, according to officials.", 
            "title": "At least two killed and others missing after Russia strikes hardware store in Kharkiv - CNN"
        }, 
        {
            "url": "https://www.cbsnews.com/news/walmart-capital-one-credit-card-rewards-what-to-know/", 
            "description": "The partnership between the two companies has ended, but card-holders can still use their Capital One Walmart Rewards cards.", 
            "title": "Walmart ends credit card partnership with Capital One: What to know - CBS News"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/furiosa-box-office-garfield-worst-memorial-day-1235909084/", 
            "description": "The bad news doesn't end there: overall revenue for the four-day holiday could hit a 25-year low.", 
            "title": "Box Office Meltdown: 'Furiosa' or 'Garfield' to Win Memorial Day With Worst No. 1 Opening in Three Decades - Hollywood Reporter"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/25/sport/manchester-united-manchester-city-fa-cup-spt-intl/index.html", 
            "description": "Manchester United won the FA Cup on Saturday, defying the odds to defeat overwhelming favorite Manchester City 2-1 and deny its crosstown rival back-to-back league and cup doubles.", 
            "title": "Manchester United shocks Manchester City in English FA Cup final as its teenage scorers make history at Wembley - CNN"
        }, 
        {
            "url": "https://www.newsweek.com/video-showing-donald-trumps-bronx-rally-crowd-size-1904744", 
            "description": "\"The zoom out of Trump speaking and the real crowd size says it all,\" Fred Wellman wrote on X on Friday.", 
            "title": "Video Showing Donald Trump's Bronx Rally Crowd Size Goes Viral - Newsweek"
        }, 
        {
            "url": "https://www.thedailybeast.com/at-least-20-people-killed-in-horrific-amusement-park-fire-in-western-india", 
            "description": "The cause of the fire is being investigated.", 
            "title": "At Least 20 People Killed in Horrific Amusement Park Fire - The Daily Beast"
        }, 
        {
            "url": "https://apnews.com/article/israel-gaza-rafah-offensive-us-united-nations-403a7c44b248b828559253206140eae5", 
            "description": "A U.N. court's order that Israel halt its offensive in the southern Gaza city of Rafah is deepening a disconnect with the United States. The military operation faces mounting international condemnation, but American officials describe it, at least for now, as…", 
            "title": "UN court order demanding that Israel halt its Gaza offensive further isolates the US position - The Associated Press"
        }, 
        {
            "url": "https://www.cnet.com/deals/best-memorial-day-sales-2024-05-25/", 
            "description": "It's Memorial Day weekend and we're here rounding up all the best deals to save you a bit of cash. Let's kick things off!", 
            "title": "Memorial Day Sales 2024: Get the Best Deals From Amazon, Best Buy, Walmart and More - CNET"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/25/politics/donald-trump-libertarian-party-rfk/index.html", 
            "description": "Donald Trump will address the Libertarian Party’s convention Saturday, a move illustrative of his campaign’s intensifying concern over third-party candidates.", 
            "title": "Trump courts Libertarians amid mounting concern over third-party candidates - CNN"
        }, 
        {
            "url": "https://www.mlive.com/weather/2024/05/weekend-weather-update-see-timing-of-sunday-memorial-day-rain.html", 
            "description": "We all get some rain sometime from Sunday through Sunday night into Memorial Day.  We will also have a large area dry out Memorial Day.", 
            "title": "Weekend weather update: See timing of Sunday-Memorial Day rain - MLive.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/25/world/nasa-prefire-mission-launch-scn/index.html", 
            "description": "NASA has launched the first of two research satellites to measure how much heat is lost to space from the Arctic and Antarctica.", 
            "title": "NASA launches tiny CubeSat to set its sights on Earth - CNN"
        }, 
        {
            "url": "https://apnews.com/article/papua-new-guinea-landslide-6908ec1ed79d30c6a02dfa3bdac25f79", 
            "description": "An emergency convoy has delivered food, water and other provisions to stunned survivors of a landslide that devastated a remote village in the mountains of Papua New Guinea. The landslide is feared to have buried scores of people. Official Serhan Aktoprak sai…", 
            "title": "Papua New Guinea: Rescuers race to rescue trapped villagers - The Associated Press"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }
    ], 
    "last_updated": "2024-05-27 01:10:29"
}