{
    "news": [
        {
            "url": "https://www.washingtonpost.com/dc-md-va/2024/05/31/retired-four-star-navy-admiral-arrested-bribery/", 
            "description": "Retired four-star Adm. Robert P. Burke is accused of awarding a single-source contract in exchange for a future $500,000-a-year job.", 
            "title": "Retired four-star Navy Admiral Robert P. Burke arrested in bribery scheme - The Washington Post"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/31/africa/south-africa-election-results-intl/index.html", 
            "description": "South Africa’s ruling African National Congress (ANC) party looks set to lose its majority for the first time in 30 years with results from 90% of polling stations.", 
            "title": "Nelson Mandela’s party has been dealt a seismic election blow. Where does it leave South Africa? - CNN"
        }, 
        {
            "url": "https://www.npr.org/2024/05/31/g-s1-2335/marian-robinson-dead", 
            "description": "Robinson was a widow and lifelong Chicago resident when she moved to the White House in 2009 to help care for granddaughters Malia and Sasha.", 
            "title": "Marian Robinson, Michelle Obama's mother, dies at 86 - NPR"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/31/24169091/netflix-mike-tyson-jake-paul-boxing-rescheduled", 
            "description": "The officially sanctioned boxing match between former boxing champ Mike Tyson and former YouTuber Jake Paul is on hold, Netflix says a new date will be announced soon.", 
            "title": "Netflix's Mike Tyson vs. Jake Paul fight is postponed - The Verge"
        }, 
        {
            "url": "https://gizmodo.com/boeing-first-crewed-starliner-launch-iss-nasa-tense-1851512733", 
            "description": "Starliner's latest delay was due to a helium leak, which the company decided not to repair.", 
            "title": "Watch Live as Boeing Attempts a Tense First Crewed Launch to the ISS - Gizmodo"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cw8860gn1nwo", 
            "description": "It would begin with a six-week ceasefire and the withdrawal of IDF forces from populated areas.", 
            "title": "Israel-Gaza war: Biden unveils Israeli proposal to end conflict - BBC.com"
        }, 
        {
            "url": "https://www.nbcnews.com/news/crime-courts/michelle-troconis-sentenced-jennifer-dulos-murder-rcna154868", 
            "description": "Michelle Troconis, the Connecticut woman convicted of helping her boyfriend murder his estranged wife in 2019, was sentenced to 14 1/2 years in prison Friday following an emotional, hours-long hearing.", 
            "title": "Michelle Troconis sentenced to more than 14 years for helping boyfriend murder his wife - NBC News"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c6ppv06e3n8o", 
            "description": "Their data is being sold online by the same gang who this week claimed to have hacked Ticketmaster.", 
            "title": "All Santander staff and millions of customers have data hacked - BBC.com"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/movies/movie-news/captain-america-brave-new-world-reshoots-1235912919/", 
            "description": "Giancarlo Esposito joins the cast for part of a 22-day shoot as a villainous character.", 
            "title": "Captain America: Brave New World Reshoots to Last 22 Days - Hollywood Reporter"
        }, 
        {
            "url": "https://sports.yahoo.com/gable-steveson-olympic-gold-medal-winner-and-ncaa-champion-wrestler-signs-with-bills-191631398.html", 
            "description": null, 
            "title": "Gable Steveson, Olympic gold medal winner and NCAA champion wrestler, signs with Bills - Yahoo Sports"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/31/biden-ukraine-kyiv-zelenskyy-00161082", 
            "description": null, 
            "title": "How Biden got to a 'yes' on letting Ukraine hit inside Russia - POLITICO"
        }, 
        {
            "url": "https://www.buzzfeed.com/mychalthompson/angelina-jolie-brad-pitt-shiloh-last-name-change", 
            "description": "Amid the ongoing legal battles of their parents, one of six children has taken legal steps to change her name.", 
            "title": "Angelina Jolie And Brad Pitt's Daughter Officially Filed To Drop Dad's Last Name - BuzzFeed"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/31/us/chad-daybell-sentencing-death-penalty-decision/index.html", 
            "description": "A day after delivering a guilty verdict in Chad Daybell’s murder trial, an Idaho jury on Friday began deliberating whether he will face the death penalty for killing his first wife and two of his second wife’s children.", 
            "title": "Idaho jury begins deliberations in sentencing of Chad Daybell, who faces possible death penalty for 3 murders - CNN"
        }, 
        {
            "url": "https://thehill.com/policy/healthcare/4697185-women-mediterranean-diet-live-longer/", 
            "description": "Women who are on a Mediterranean diet live significantly longer, according to a new study. The Mediterranean diet often consists of higher consumption of food and ingredients like olive oil, fruits, fish, nuts and vegetables and lower consumption of red meat …", 
            "title": "Women on Mediterranean diet live significantly longer: Study - The Hill"
        }, 
        {
            "url": "https://apnews.com/article/pickton-dead-canada-serial-killer-pig-farm-f2f2c3545ac0bea23a38cc690cf1c796", 
            "description": "Canadian serial killer Robert Pickton, who took female victims to his pig farm during a crime spree near Vancouver in the late 1990s and early 2000s, has died after being assaulted in prison. He was 74. The Correctional Service of Canada said in statement tha…", 
            "title": "Canadian serial killer Robert Pickton, who brought victims to pig farm, is dead after prison assault - The Associated Press"
        }, 
        {
            "url": "https://www.managingmadrid.com/2024/5/31/24159590/what-to-look-out-for-as-real-madrid-face-borussia-dortmund-in-champions-league-final", 
            "description": "Both teams have arrived in heroic fashion", 
            "title": "What To Look Out For As Real Madrid Face Borussia Dortmund In Champions League Final - Managing Madrid"
        }, 
        {
            "url": "https://www.npr.org/2024/05/31/nx-s1-4987130/auroras-northern-lights-solar-sun", 
            "description": "The same solar region that brought an outburst of night-time beauty in early May is coming back around. But things have changed, a space weather expert tells NPR.", 
            "title": "Are auroras coming back? - NPR"
        }, 
        {
            "url": "https://apnews.com/article/trump-2024-campaign-trial-4629840240cb308c5eae335532ad17ed", 
            "description": "Donald Trump sought to move past his historic criminal conviction on Friday and build momentum for his bid to return to the White House with fierce attacks on the judge who oversaw the case, the prosecution’s star witness and the criminal justice system as a …", 
            "title": "Trump responds to guilty verdict by falsely blasting 'rigged trial' - The Associated Press"
        }, 
        {
            "url": "https://apnews.com/article/israel-netanyahu-war-gaza-congress-596b0adf6ed8f71ccaaecccec8b9d341", 
            "description": "Congressional leaders have invited Israeli Prime Minister Benjamin Netanyahu to deliver an address a the U.S. Capitol. The visit would provide a show of wartime support for the longtime ally despite mounting political divisions over Israel’s military assault …", 
            "title": "US leaders invite Israel's Netanyahu to deliver an address to Congress - The Associated Press"
        }, 
        {
            "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3Lm5iY25ld3MuY29tL25ld3MvdXMtbmV3cy90ZXhhcy1zdXByZW1lLWNvdXJ0LXJlamVjdHMtY2hhbGxlbmdlLWFib3J0aW9uLWJhbi1tZWRpY2FsLWV4Y2VwdGlvbnMtcmNuYTE1NDg5NtIBAA?oc=5", 
            "description": null, 
            "title": "Texas Supreme Court rejects challenge to state's abortion ban over exceptions for pregnancy complications - NBC News"
        }
    ], 
    "last_updated": "2024-06-02 03:47:33"
}