{
    "news": [
        {
            "url": "https://www.motherjones.com/politics/2024/05/steve-bannon-just-inched-a-bit-closer-to-prison/", 
            "description": "There's still a chance he could run out the clock—on his contempt charges, anyway.", 
            "title": "Steve Bannon Still Isn't in Prison, but He's a Little Closer – Mother Jones - Mother Jones"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/c6pyv8q94g1o", 
            "description": "The attempt came during an attack on a town in the northeastern Kharkiv region, says the military.", 
            "title": "Ukraine says it repelled Russian bid to cross border - BBC.com"
        }, 
        {
            "url": "https://people.com/how-justin-bieber-pregnant-wife-hailey-kept-their-baby-news-secret-exclusive-8646800", 
            "description": "On Thursday, May 9, Justin Bieber and wife Hailey Bieber announced that they are expecting their first baby together.", 
            "title": "How Justin Bieber, Pregnant Wife Hailey Kept Baby News Secret (Exclusive) - PEOPLE"
        }, 
        {
            "url": "https://www.espn.com/nfl/story/_/id/40120931/cardinals-signing-former-jaguars-wr-zay-jones-per-source", 
            "description": "Wide receiver Zay Jones is signing a one-year deal with the Cardinals after being released by the Jaguars last month, a source told ESPN.", 
            "title": "Cardinals signing former Jaguars WR Zay Jones, per source - ESPN"
        }, 
        {
            "url": "https://variety.com/2024/tv/news/sam-rubin-dead-ktla-entertainment-reporter-1235998979/", 
            "description": "Sam Rubin, a popular entertainment reporter on KTLA since 1991, died Friday, a source close to the station confirmed. He was 64.", 
            "title": "Sam Rubin, Longtime KTLA Entertainment Reporter, Dies at 64 - Variety"
        }, 
        {
            "url": "https://theathletic.com/5484933/2024/05/10/kylian-mbappe-psg-transfer-exit/", 
            "description": "Kylian Mbappe has announced that he will be leaving Paris Saint-Germain at the end of the season because he “needs a new challenge after seven years”.\nThe Athletic previously reported that the 25-year-old forward would leave the French club when his contract …", 
            "title": "Mbappe confirms he will leave PSG at the end of this season - The Athletic"
        }, 
        {
            "url": "https://9to5mac.com/2024/05/10/apple-brand-new-siri-wwdc/", 
            "description": "Apple is preparing to unveil a major revamp to Siri at WWDC in June, as reported by The New York...", 
            "title": "Apple to unveil brand new Siri at WWDC powered by generative AI - 9to5Mac"
        }, 
        {
            "url": "https://www.aljazeera.com/news/2024/5/10/un-backs-palestines-bid-for-membership-how-did-your-country-vote", 
            "description": "A breakdown by country of the UN General Assembly vote on a resolution for Palestinian to become a full UN member.", 
            "title": "UN backs Palestine’s bid for membership: How did your country vote? - Al Jazeera English"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/10/24153767/sam-altman-openai-google-io-search-engine-launch", 
            "description": "Sam Altman, CEO of OpenAI, denied recent reports that an upcoming event would be related to ChatGPT-5 or a new search engine.", 
            "title": "Sam Altman shoots down reports of search engine launch ahead of Google I/O - The Verge"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/10/mcdonalds-working-on-5-value-meal.html", 
            "description": "The potential new offering comes at a time when low-income consumers are beginning to pull back on spending, particularly at fast-food brands.", 
            "title": "McDonald's working on $5 value meal - CNBC"
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-68985412", 
            "description": "In a first for the US, two Virginia schools will have their original Confederate names reinstated.", 
            "title": "Virginia school board votes to restore Confederate names - BBC.com"
        }, 
        {
            "url": "https://www.wctv.tv/2024/05/10/storm-recap-big-bend-sees-60-mph-wind-gusts-probable-tornadoes-launch-debris-into-sky-friday/", 
            "description": "Damaging wind gusts and tornadoes leave a trail of destruction.", 
            "title": "Big Bend sees 60+ mph wind gusts, probable tornadoes launch debris into sky Friday - WCTV"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/10/business/sunspots-disrupt-phones-gps-scn/index.html", 
            "description": "Buckle up: An unusual amount of solar activity this week could disrupt some of the most important technologies society relies on.", 
            "title": "Why tonight’s massive solar storm could disrupt communications and GPS systems - CNN"
        }, 
        {
            "url": "https://finance.yahoo.com/news/novavax-stock-doubles-after-sanofi-deal-marks-new-chapter-for-company-172419830.html", 
            "description": "Novavax stock popped Friday on news of a licensing deal and minority stake from Big Pharma player Sanofi.", 
            "title": "Novavax stock doubles after Sanofi deal marks 'new chapter' for company - Yahoo Finance"
        }, 
        {
            "url": "https://www.bbc.com/news/articles/cv2j0v237vko", 
            "description": "Protesters opposed to the expansion of the site have clashed with police.", 
            "title": "Grünheide: Tesla factory protesters clash with police in Germany - BBC.com"
        }, 
        {
            "url": "https://www.cbsnews.com/news/magna-carta-british-library-environmental-activists-smash-arrest/", 
            "description": "Video posted online shows the Rev. Sue Parfitt and Judy Bruce —protesters from Just Stop Oil — gluing themselves to the display.", 
            "title": "Priest, 82, and retired teacher, 85, smash case holding copy of Magna Carta in environmental protest - CBS News"
        }, 
        {
            "url": "https://apnews.com/article/trump-trial-hush-money-stormy-daniels-cohen-ddef05884265e4d6217b55a89304b878", 
            "description": "Prosecutors in Donald Trump’s hush money trial are narrowing in on checks and phone records as they lay the groundwork for jurors to hear eventually from their star witness: Michael Cohen, Trump’s former attorney. With the third week of the testimony drawing …", 
            "title": "Trump hush money trial: Michael Cohen awaits turn after graphic Stormy Daniels account - The Associated Press"
        }, 
        {
            "url": "http://www.rollingstone.com/music/music-features/taylor-swift-eras-tour-france-america-tickets-1235018606/", 
            "description": "Many American Taylor Swift fans are flying to France because it's cheaper to see her on vacation than buy U.S. tickets.", 
            "title": "American Taylor Swift Fans Are Flocking to France for Eras Concerts - Rolling Stone"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/10/gop-kari-lake-questions-00157290", 
            "description": null, 
            "title": "Kari Lake keeps giving Republicans new reasons to worry - POLITICO"
        }
    ], 
    "last_updated": "2024-05-12 00:39:54"
}