{
    "news": [
        {
            "url": "https://www.bbc.com/news/world-us-canada-69003233", 
            "description": "An explosion blasted away debris trapping a cargo ship in the Patapsco River.", 
            "title": "Baltimore bridge blown up in controlled demolition - BBC.com"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/13/entertainment/taylor-swift-travis-kelce-paris/index.html", 
            "description": "Taylor Swift closed out her four-night Eras Tour run in Paris on Sunday with a show that appeared to be Taylor-made for Travis Kelce.", 
            "title": "Taylor Swift’s last Eras Tour show in Paris was full of Travis Kelce nods, and he seemed to love it - CNN"
        }, 
        {
            "url": "https://www.post-gazette.com/news/world/2024/05/13/kremlin-shake-up-putin-shigu-belousov/stories/202405130060", 
            "description": "False", 
            "title": "A Kremlin shake-up of Russia's Defense Ministry comes at a key moment in the Ukraine war - Pittsburgh Post-Gazette"
        }, 
        {
            "url": "https://www.foxsports.com/stories/nfl/exclusive-cowboys-will-face-browns-in-week-1-to-mark-tom-bradys-fox-sports-debut", 
            "description": "The Cowboys' Sept. 8 matchup vs. the Browns on FOX will be the first America's Game of the Week of 2024 — and mark Tom Brady's debut as FOX Sports' lead NFL analyst.", 
            "title": "Exclusive: Cowboys will face Browns in Week 1 to mark Tom Brady's FOX Sports debut - FOX Sports"
        }, 
        {
            "url": "https://www.espn.com/nfl/story/_/id/40140300/sources-lions-signing-qb-jared-goff-4-year-212m-extension", 
            "description": "The Lions are signing quarterback Jared Goff to a four-year, $212 million contract extension that includes $170 million guaranteed, sources told ESPN's Adam Schefter on Monday.", 
            "title": "Sources - Lions signing QB Jared Goff to 4-year, $212M extension - ESPN"
        }, 
        {
            "url": "https://www.cbsnews.com/news/missouri-man-sai-kandula-crashed-u-haul-white-house-security-barrier-pleads-guilty/", 
            "description": "Sai Kandula acknowledged he had deliberately slammed into a security bollard in a failed attempt to seize power at the White House and install a dictatorship aligned with Nazi beliefs.", 
            "title": "Missouri man who crashed U-Haul into White House security barrier pleads guilty - CBS News"
        }, 
        {
            "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-kharkiv-donetzk-397dd892f936726bd1acbd45991a18a6", 
            "description": "Ukrainian officials and commanders say Russian troops are locked in intense battles with Ukrainian soldiers in the embattled town of Vovchansk and are pushing ahead with a ground offensive that opened a new front to put pressure on overstretched Ukrainian for…", 
            "title": "Russia-Ukraine war: Army locked in 'fierce' border battles amid Russian assault, Zelenskyy says - The Associated Press"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.bbc.com/news/world-middle-east-69001835", 
            "description": "Fierce fighting is reported as Israel says it is targeting areas of where Hamas has regrouped.", 
            "title": "Gaza war: Palestinians flee as Israeli forces go back into Jabalia - BBC.com"
        }, 
        {
            "url": "https://finance.yahoo.com/news/gamestop-stock-soars-over-70-as-roaring-kitty-revival-reignites-meme-stock-bonanza-200701976.html", 
            "description": "GameStop stock surged as much as 110% after 'Roaring Kitty,' who was credited with starting the 2021 meme stock frenzy, posted on X for the first time in...", 
            "title": "GameStop stock soars over 70% as 'Roaring Kitty' revival reignites meme-stock bonanza - Yahoo Finance"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.gsmarena.com/watch_the_google_i_o_livestream_here-news-62838.php", 
            "description": "Google will formally introduce Android 15 and should talk about how the Gemini AI meshes with the phone OS as well as all other Google properties.", 
            "title": "Watch the Google I/O livestream here - GSMArena.com news - GSMArena.com"
        }, 
        {
            "url": "https://gizmodo.com/apple-ios-18-ai-voice-memos-notes-1851473478", 
            "description": "The AI-powered feature is coming to iOS 18 later this year.", 
            "title": "Apple Is Bringing AI Transcription to Voice Memos, and I Can't Wait - Gizmodo"
        }, 
        {
            "url": "https://gizmodo.com/not-just-auroras-heres-the-tech-that-got-hit-by-this-w-1851472838", 
            "description": "SpaceX's Elon Musk said the company's Starlink satellites were \"under a lot of pressure\" from the incoming radiation.", 
            "title": "Not Just Auroras: Here's the Tech That Got Hit by This Weekend's Solar Storm - Gizmodo"
        }, 
        {
            "url": "https://www.reuters.com/world/middle-east/un-says-gaza-death-toll-still-over-35000-not-all-bodies-identified-2024-05-13/", 
            "description": "The death toll in the Gaza Strip from the Israel-Hamas war is still more than 35,000, but the enclave's Ministry of Health has updated its breakdown of the fatalities, the United Nations said on Monday after Israel questioned a sudden change in numbers.", 
            "title": "UN says Gaza death toll still over 35000 but not all bodies identified - Reuters"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/13/europe/georgia-foreign-agents-law-explained-intl/index.html", 
            "description": "Georgia’s parliament is set to pass a highly controversial so-called “foreign agents” bill that has triggered widespread protests across the former Soviet Republic nestled in the Caucasus Mountains.", 
            "title": "What is Georgia’s ‘foreign agents’ bill, and why is Europe so alarmed? - CNN"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/tv/tv-news/wicked-trailer-snoop-dogg-olympics-nbcuniversal-upfront-1235897889/", 
            "description": "Donna Langley will have you renditioned if you filmed one second of Cynthia Erivo and Ariana Grande on that phone of yours.", 
            "title": "Inside the NBCUniversal Upfront: Snoop Dogg, Penguins and a Top Secret ‘Wicked’ Trailer - Hollywood Reporter"
        }, 
        {
            "url": "https://www.bbc.com/news/world-us-canada-69004988", 
            "description": "Parishioners from the church 'confronted' the gunman and restrained him until police arrived.", 
            "title": "Gunman arrested at Louisiana church during First Communion Mass - BBC.com"
        }, 
        {
            "url": "https://nypost.com/2024/05/13/entertainment/steve-buscemi-spotted-with-black-eye-swollen-face-after-random-nyc-attack/", 
            "description": "The 66-year-old “Boardwalk Empire” actor was sporting bruises and a swollen chin while shooting a commercial in Soho on Saturday.", 
            "title": "Steve Buscemi spotted with black eye, swollen face after random NYC attack - New York Post "
        }, 
        {
            "url": "https://www.cbsnews.com/news/legendary-treasure-conman-healing-powers-poland-officials/", 
            "description": "A collection of silver and gold coins unearthed in Poland may have belonged to notorious fraudster Anthony Jaczewicz.", 
            "title": "Legendary treasure that apparently belonged to notorious 18th-century conman unearthed in Poland - CBS News"
        }
    ], 
    "last_updated": "2024-05-15 02:00:43"
}