{
    "news": [
        {
            "url": "https://www.bbc.com/news/articles/cpvvyxr79glo", 
            "description": "The Pope was speaking at a meeting of bishops on whether gay men should be allowed to become priests.", 
            "title": "Pope Francis allegedly used derogatory term for gay people - BBC.com"
        }, 
        {
            "url": "https://apnews.com/article/tornadoes-weather-texas-oklahoma-arkansas-kentucky-91b0ff5c06f9bdc8b8ca68f36afbafa2", 
            "description": "A series of powerful storms in the central and southern U.S. over the Memorial Day holiday weekend has killed at least 22 people as they left a wide trail of destroyed homes, businesses and power outages. The destructive storms caused deaths in Texas, Oklahom…", 
            "title": "Severe Memorial Day weather: Powerful US storms head east after killing 20 - The Associated Press"
        }, 
        {
            "url": "https://www.axios.com/2024/05/26/rafah-tent-camp-israel-airstrike", 
            "description": null, 
            "title": "Israeli airstrike kills dozens in Rafah tent camp, Gaza authorities say - Axios"
        }, 
        {
            "url": "https://www.cbssports.com/nba/news/celtics-vs-pacers-score-live-updates-game-4-highlights-as-boston-looks-to-sweep-indiana-in-east-finals/live/", 
            "description": "The Pacers have to win at home on Monday as their season is on the line", 
            "title": "Celtics vs. Pacers score: Live updates, Game 4 highlights as Boston looks to sweep Indiana in East finals - CBS Sports"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/tv/tv-news/jimmy-kimmel-son-third-heart-surgery-memorial-day-weekend-1235909726/", 
            "description": "The late-night host has been outspoken about his child's health issues and the importance of health insurance.", 
            "title": "Jimmy Kimmel Reveals Son Billy Had Third Open Heart Surgery Over Memorial Day Weekend - Hollywood Reporter"
        }, 
        {
            "url": "http://www.hollywoodreporter.com/business/digital/elon-musk-ai-startup-xai-raises-6-billion-1235909709/", 
            "description": "The startup, xAI, says that it has raised the cash from investors including Fidelity, Sequoia, Andreessen Horowitz and Prince Alwaleed Bin Talal.", 
            "title": "Elon Musk’s AI Startup Raises $6B - Hollywood Reporter"
        }, 
        {
            "url": "https://nypost.com/2024/05/27/us-news/north-korean-spy-satellite-explodes-mid-air-after-launch/", 
            "description": "North Korea’s attempt to blast a second spy satellite into orbit went up in flames not long after takeoff on Monday, the hermit nation’s state news agency confirmed.", 
            "title": "North Korean spy satellite explodes mid-air after launch - New York Post "
        }, 
        {
            "url": "https://editorial.rottentomatoes.com/article/weekend-box-office-results-furiosa-edges-out-garfield-in-worst-memorial-day-weekend-in-decades/", 
            "description": "George Miller's action-packed prequel narrowly beat The Garfield Movie over the three-day weekend but suffered the worst overall Memorial Day debut since 1989.", 
            "title": "Weekend Box Office Results: Furiosa Edges Out Garfield in Worst Memorial Day Weekend in Decades - Rotten Tomatoes"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/27/us/va-tech-company-doj-penalty-reaj/index.html", 
            "description": "A Virginia company, Arthur Grand Technologies Inc., will pay a $7,500 civil penalty after being fined by the Department of Justice over a discriminatory job posting.", 
            "title": "Virginia technology company to pay civil penalty over discriminatory ‘Whites only’ job posting, according to DOJ - CNN"
        }, 
        {
            "url": "https://www.cbsnews.com/boston/news/amc-massachusetts-stabbing-security-review/", 
            "description": "A spokesperson for movie theater chain AMC said the company is reviewing security policies and will have extra measures in place after four girls were stabbed in Braintree.", 
            "title": "AMC conducting review after 4 girls randomly stabbed inside Massachusetts movie theater - CBS Boston"
        }, 
        {
            "url": "https://www.reuters.com/world/middle-east/egyptian-guard-killed-shooting-rafah-border-israel-egypt-investigating-2024-05-27/", 
            "description": null, 
            "title": "Egyptian guard killed in shooting on Rafah border, Israel and Egypt investigating - Reuters.com"
        }, 
        {
            "url": "https://local12.com/news/nation-world/black-bear-kebabs-gives-family-parasitic-worms-3-people-hospitalized-infected-meat-wild-game-cdc-parasites-worm-disease-control-prevention-saskatchewan-hunted-frozen-thawed-cooked-roundworm-infections-mild-severe-symptoms-life-threatening-cooked-properly", 
            "description": "The meat was originally harvested in the Canadian province of Saskatchewan and frozen for 45 days before it was thawed.", 
            "title": "Black bear 'kebabs' gives family parasitic worms, 3 people hospitalized - WKRC TV Cincinnati"
        }, 
        {
            "url": "https://www.usatoday.com/story/news/nation/2024/05/27/louisiana-prison-escape-tangipahoa-parish-sheriff/73870361007/", 
            "description": "Tangipahoa Parish Sheriff's Office is looking for 2 inmates who they say escaped from a local jail. One was in on charges related to a 2022 homicide.", 
            "title": "Louisiana prison escape: 2 inmates found, 2 at large Monday - USA TODAY"
        }, 
        {
            "url": "https://www.ky3.com/2024/05/27/tornado-damages-community-texas-county-mo/", 
            "description": "A powerful storm hit Texas County on Sunday afternoon in the Bendavis-Houston area of Texas County.", 
            "title": "Tornado damages community in Texas County, Mo. - KY3"
        }, 
        {
            "url": "https://www.espn.com/mlb/story/_/id/40230155/cubs-craig-counsell-booed-brewers-fans-milwaukee-return", 
            "description": "Craig Counsell, who is in his first year managing the Cubs after 18 seasons with the Brewers as a player and manager, was booed in his first return to Milwaukee.", 
            "title": "Cubs' Craig Counsell booed by Brewers fans in Milwaukee return - ESPN"
        }, 
        {
            "url": "https://apnews.com/article/papua-new-guinea-landslide-3e1444634d8859b1f2378b334c6a0d41", 
            "description": "A Papua New Guinea government official has told the United Nations that more than 2,000 people are believed to have been buried alive by a landslide Friday. The official formally asked for international help. The government figure is roughly triple a U.N. est…", 
            "title": "PNG landslide: More than 2,000 killed, government says - The Associated Press"
        }, 
        {
            "url": "https://variety.com/2024/film/news/richard-dreyfuss-cabot-theater-offensive-remarks-1236017160/", 
            "description": "In recent years, “Jaws” star Richard Dreyfuss has come under fire for speaking out on subjects such as Oscar diversity requirements and the use of Blackface....", 
            "title": "Richard Dreyfuss Sparks Outrage, Massachusetts Theater Apologizes For His 'Offensive and Distressing' Remarks at 'Jaws' Screening - Yahoo Entertainment"
        }, 
        {
            "url": "https://www.cnn.com/cnn-underscored/deals/best-buy-memorial-day-sale-2024-05-27", 
            "description": "Dyson, Apple, and Sony are all on sale at Best Buy for Memorial Day with discounts up to 45% off.", 
            "title": "Here are 25 of the best deals to shop at Best Buy’s Memorial Day sale - CNN Underscored"
        }, 
        {
            "url": "https://www.teslarati.com/spacex-announces-next-starship-test-flight-date/", 
            "description": "SpaceX's Starship will one day transport human life to other planets.", 
            "title": "SpaceX announces next Starship test flight date - TESLARATI"
        }, 
        {
            "url": "https://abc30.com/post/passenger-united-flight-fresno-measles-officials-confirm/14878374/", 
            "description": "A passenger on a flight to Fresno was confirmed to be traveling with measles, according to LA County health officials.", 
            "title": "Passenger on United flight to Fresno had measles, officials confirm - KFSN-TV"
        }
    ], 
    "last_updated": "2024-05-29 01:49:30"
}