{
    "news": [
        {
            "url": "http://www.hollywoodreporter.com/tv/tv-features/911-season-7-finale-ryan-guzman-interview-1235912170/", 
            "description": "The fan-favorite firefighter in the ABC procedural drama says the beloved father-son dynamic will never be the same: \"Eddie is not the best part of Christopher’s life anymore.\"", 
            "title": "‘9-1-1’ Star Ryan Guzman Breaks Down That Emotional Finale Goodbye - Hollywood Reporter"
        }, 
        {
            "url": "https://www.eonline.com/news/1402720/ben-affleck-and-jennifer-lopez-reunite-at-family-event-amid-breakup-speculation", 
            "description": "Amid speculation of a split, Ben Affleck and Jennifer Lopez—who tied the knot in July 2022—were spotted attending a family event together in Los Angeles on May 30. See the couple's reunion.", 
            "title": "Ben Affleck and Jennifer Lopez Reunite at Family Event Amid Breakup Speculation - E! Online - E! NEWS"
        }, 
        {
            "url": "https://www.foxnews.com/us/attorneys-idaho-murder-suspect-bryan-kohberger-maintain-da-slow-walking-evidence", 
            "description": "Bryan Kohberger, who is accused of killing four University of Idaho students, appeared in court Thursday for a pretrial hearing.", 
            "title": "Attorneys for Idaho murder suspect Bryan Kohberger maintain DA is slow-walking evidence - Fox News"
        }, 
        {
            "url": "https://www.wxii12.com/article/wxii-12-news-spot-international-space-station-tonight-refueling-spacecraft-progress-88-kazakhastan/60954080", 
            "description": "Spot the International Space Station tonight and its refueling spacecraft Progress 88", 
            "title": "Spot the Space Station tonight and Progress 88 spacecraft - WXII12 Winston-Salem"
        }, 
        {
            "url": "https://www.nba.com/news/93-candidates-withdraw-2024-nba-draft", 
            "description": "Early entry candidates have until 5 p.m. ET on June 16, 2024 to decide whether or not to withdraw for consideration in NBA Draft.", 
            "title": "93 early entry candidates withdraw from 2024 NBA Draft - NBA.com"
        }, 
        {
            "url": "https://apnews.com/article/bomb-rafah-civilians-israel-us-ada219d17926a14ca8c179338d53d109", 
            "description": "Defense experts who've reviewed debris images from an Israeli airstrike that ignited a deadly fire in a camp for displaced Palestinians question why Israel didn't use smaller, more precise weapons when so many civilians were nearby. The defense experts say th…", 
            "title": "Israel could have used smaller weapons against Hamas to avoid deaths in Gaza tent fire, experts say - The Associated Press"
        }, 
        {
            "url": "https://www.theverge.com/2024/5/30/24168099/jeep-wagoneer-s-trailhawk-concept-ev-off-road", 
            "description": "Jeep’s Wagoneer S electric SUV could be getting a Trailhawk trim based on a new concept released today. The EV sports tow hooks, 31.5-inch tires, and a host of rugged details.", 
            "title": "Jeep's Wagoneer S Trailhawk concept teases a fully electric off-roader - The Verge"
        }, 
        {
            "url": "https://www.reuters.com/world/middle-east/israel-reopens-gaza-food-sales-rafah-raid-chokes-aid-2024-05-30/", 
            "description": null, 
            "title": "Exclusive: Israel reopens Gaza food sales as Rafah raid chokes aid - Reuters"
        }, 
        {
            "url": "https://www.livescience.com/space/cosmology/james-webb-telescope-discovers-the-2-earliest-galaxies-in-the-known-universe-and-1-is-shockingly-big", 
            "description": "The James Webb Space Telescope has detected the two earliest, most distant galaxies in the known universe, dating to just 300 million years after the Big Bang. The detection of even earlier galaxies is likely to follow.", 
            "title": "James Webb telescope discovers the 2 earliest galaxies in the known universe — and 1 is shockingly big - Livescience.com"
        }, 
        {
            "url": "https://www.fox9.com/news/minneapolis-police-death-officer-2-citizens-killed-mass-shooting", 
            "description": "A Minneapolis police officer and the suspected shooter were killed in a mass shooting in the city on Thursday.", 
            "title": "Minneapolis police death: Officer, suspected shooter dead after mass shooting - FOX 9 Minneapolis-St. Paul"
        }, 
        {
            "url": "https://thehill.com/homenews/campaign/4694985-donald-trump-vote-convicted-felon/", 
            "description": null, 
            "title": "Can Trump still vote as a convicted felon? - The Hill"
        }, 
        {
            "url": "https://removed.com", 
            "description": "[Removed]", 
            "title": "[Removed]"
        }, 
        {
            "url": "https://www.cnn.com/2024/05/30/business/boeing-safety-plan-faa/index.html", 
            "description": "Boeing executives presented sweeping changes to the company’s production process and safety systems in a three-hour meeting with the Federal Aviation Administration on Thursday. The plan is meant to reassure the public, airline customers and regulators that t…", 
            "title": "3-hour meeting ends with FAA saying Boeing can’t increase Max plane production until quality is fixed - CNN"
        }, 
        {
            "url": "https://www.politico.com/news/2024/05/30/biden-ukraine-weapons-strike-russia-00160731", 
            "description": null, 
            "title": "Biden secretly gave Ukraine permission to strike inside Russia with US weapons - POLITICO"
        }, 
        {
            "url": "https://www.espn.com/college-sports/story/_/id/40246983/sec-greg-sankey-confident-ncaa-division-operate-together", 
            "description": "SEC commissioner Greg Sankey says that the NCAA basketball tournament might change from its current field of 68 teams.", 
            "title": "SEC's Greg Sankey confident NCAA Division I can operate together - ESPN"
        }, 
        {
            "url": "https://apnews.com/article/south-africa-election-change-vote-anc-25a03780bec29503ab3d9f6e9f96dc4c", 
            "description": "Partial results in South Africa’s national election have put the long-ruling African National Congress at less than 50% of the vote. It raises the possibility that it might lose its majority for the first time since it swept to power under Nelson Mandela at t…", 
            "title": "South Africa election: Early results put ruling ANC short of a majority - The Associated Press"
        }, 
        {
            "url": "https://www.youtube.com/watch?v=NBXKrkdXkG4", 
            "description": "Champ Islam Makhachev and challenger Dustin Poirier had their first UFC 302 faceoff at the pre-fight press conference for their lightweight title fight on Sa...", 
            "title": "Islam Makhachev, Dustin Poirier Separated at Faceoff After Exchanging Words | UFC 302 - MMA Junkie"
        }, 
        {
            "url": "https://www.chicagobears.com/news/chicago-bears-nfl-films-and-hbo-announce-hard-knocks-training-camp-with-the-chicago-bears", 
            "description": "Remaining a fixture in the national spotlight, Hard Knocks: Training Camp with the Chicago Bears debuts Tuesday, August 6th at 9 p.m. ET / 8 p.m. CT.", 
            "title": "NFL Films and HBO announce Hard Knocks: Training Camp with the Chicago Bears - ChicagoBears.com"
        }, 
        {
            "url": "https://talkingbiznews.com/media-news/wsjs-varghese-among-the-layoffs/", 
            "description": "Daniel Varghese, who oversaw the gear and gadgets section of Off Duty at The Wall Street Journal, editing stories about personal technology, was among the layoffs at the publication on Thursday. “I had so much fun working with the team at Off Duty, and hope t…", 
            "title": "WSJ’s Varghese among the layoffs - Talking Biz News"
        }, 
        {
            "url": "https://www.cnbc.com/2024/05/30/gap-gps-earnings-q1-2024.html", 
            "description": "Gap has been in the midst of a turnaround under CEO Richard Dickson, who has focused on better marketing and storytelling for the company's portfolio of brands.", 
            "title": "Gap shares pop 20% as earnings beat on sales growth at all four brands - CNBC"
        }
    ], 
    "last_updated": "2024-06-01 04:51:36"
}